----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mafton/Documents/School/Econ 644/assignment2.log
  log type:  text
 opened on:  18 Feb 2018, 13:17:52

. use ceos.dta, clear

. use ceos.dta, clear

. set more off

. 
. /*Here we compute probabilities for the binary distribution wth posiible values 
> 0,1 and probabilities .3&.7*/
. 
. display binomial(1,0,0.7)
.3

. display binomial(1,1,0.7)
1

. display 1,0,0.7
1 0 .7

. 
. /*Compute probabilities for the univariate standard normal distribution N(0,1), 
> i.e., mean zero and variance one.*/
. display normal(0)
.5

. display normal(1.645) - normal(-1.645)
.90003019

. display normal(1.96) - normal(-1.96)
.95000421

. display normal(4) - normal(-4)
.99993666

. 
. /*Compute probabilities for the bi-variate standard normal distribution, i.e., t
> wo independent standard normals.*/
. 
. display binormal(0,0,0)
.25

. 
. /*Draw a random sample from the N(3,16) distribution, i.e., mean 3 and variance 
> 16, or standard deviation 4.*/
. drawnorm x, n(100000) means(3) sds(4)
(obs 100,000)

. 
. /*Plot the distribution of variable x*/
. histogram x, bin(5)
(bin=5, start=-14.347679, width=7.002227)

. histogram x, bin(50)
(bin=50, start=-14.347679, width=.7002227)

. display x
1.165148

. summarize x

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           x |    100,000    2.997155    3.991971  -14.34768   20.66346

. browse x

. 
. drawnorm y, n(100000) means(3) sds(4)

. 
. /*Make a box plot for variable x*/
. graph hbox x

. histogram x, bin(50)
(bin=50, start=-14.347679, width=.7002227)

. graph hbox x

. 
. /*Create a new variable*/
. generate s = (x-3)/4

. generate s2 = (x-3)/4

. 
. /*Draw a random sample from the standard normal distribution*/
. 
. drawnorm z

. drawnorm z2

. 
. /*Here we create random 0-1 numbers. We use these to assign treatment (1) to 70%
>  of observations, so 30% will be controls (0).*/
. generate t = rbinomial(1,0.7)

. generate t2 = rbinomial(1, .7)

. browse t2

. 
. /*Plot the distribution of variable t*/
. histogram t, discrete width(.2) fraction addlabel
(start=0, width=.2)

. histogram t, discrete width(0.2) fraction
(start=0, width=.2)

. histogram t, discrete width(.2) fraction addlabel
(start=0, width=.2)

. 
. /*Plot the histograms for the treated z and control z compare summary stats*/
. histogram z, by(t)

. histogram z
(bin=50, start=-4.9538178, width=.17837622)

.  by t, sort: summarize z

----------------------------------------------------------------------------------
-> t = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           z |     29,794   -.0028328    .9957508  -4.526519   3.959472

----------------------------------------------------------------------------------
-> t = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           z |     70,206   -.0045745    1.005442  -4.953818   3.964993


. summarize z

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           z |    100,000   -.0040556     1.00256  -4.953818   3.964993

. by t, sort: summarize z

----------------------------------------------------------------------------------
-> t = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           z |     29,794   -.0028328    .9957508  -4.526519   3.959472

----------------------------------------------------------------------------------
-> t = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           z |     70,206   -.0045745    1.005442  -4.953818   3.964993


. count if t!=0
  70,206

. count if t!=1
  29,794

. 
. count if z>0
  49,791

. count if z<0
  50,209

. count if z==0
  0

. 
. /*Computing Mean, Median, Standard Deviation, Min, Max*/
. 
. summarize

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           x |    100,000    2.997155    3.991971  -14.34768   20.66346
           y |    100,000    2.992208    4.002968   -13.1978    20.9333
           s |    100,000   -.0007113    .9979926   -4.33692   4.415864
          s2 |    100,000   -.0007113    .9979926   -4.33692   4.415864
           z |    100,000   -.0040556     1.00256  -4.953818   3.964993
-------------+---------------------------------------------------------
          z2 |    100,000   -.0080297    1.000896  -4.332942   4.369254
           t |    100,000      .70206    .4573553          0          1
          t2 |    100,000      .70047    .4580544          0          1

. 
. /*Graph a Scatterplot of (s,z) for the First 200 Observations*/
. twoway (scatter z s in 1/200)

. twoway (scatter s x in 1/200) 

. 
. correlate x s
(obs=100,000)

             |        x        s
-------------+------------------
           x |   1.0000
           s |   1.0000   1.0000


. correlate s z
(obs=100,000)

             |        s        z
-------------+------------------
           s |   1.0000
           z |  -0.0036   1.0000


. correlate z t
(obs=100,000)

             |        z        t
-------------+------------------
           z |   1.0000
           t |  -0.0008   1.0000


. 
. /*Graph the BLP of (s,z) for the First 200 Observations*/
. twoway (scatter z s in 1/200) (lfit z s) 

. twoway (scatter s x in 1/200) (lfit s x) 

. 
. save class2.dta, replace
file class2.dta saved

. log close    
      name:  <unnamed>
       log:  /Users/mafton/Documents/School/Econ 644/assignment2.log
  log type:  text
 closed on:  18 Feb 2018, 13:18:16
----------------------------------------------------------------------------------
