----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mafton/Documents/School/Econ 644/class5.log
  log type:  text
 opened on:  25 Feb 2018, 16:34:49

. set more off

. pwd
/Users/mafton/Documents/School/Econ 644

. regress salary ceoten age grad mktval

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(4, 172)       =      9.87
       Model |  11348587.4         4  2837146.84   Prob > F        =    0.0000
    Residual |  49417377.4       172  287310.334   R-squared       =    0.1868
-------------+----------------------------------   Adj R-squared   =    0.1678
       Total |  60765964.7       176  345261.163   Root MSE        =    536.01

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   10.55413   6.019706     1.75   0.081    -1.327879    22.43614
         age |   1.649817   5.162111     0.32   0.750    -8.539427    11.83906
        grad |  -43.43346    82.2966    -0.53   0.598    -205.8748    119.0079
      mktval |   .0371649   .0063706     5.83   0.000     .0245903    .0497395
       _cons |   578.0711   288.3528     2.00   0.047     8.905383    1147.237
------------------------------------------------------------------------------

. test ( ceoten==0)

 ( 1)  ceoten = 0

       F(  1,   172) =    3.07
            Prob > F =    0.0813

. test ceoten==0 college==0)
invalid 'college' 
r(198);

. test ceoten==0 college==0
invalid 'college' 
r(198);

. test ( ceoten==0) ( college==0)
college not found
r(111);

. test (ceoten college)
college not found
r(111);

. test ( ceoten profits)
profits not found
r(111);

. test ( age grad)

 ( 1)  age = 0
 ( 2)  grad = 0

       F(  2,   172) =    0.21
            Prob > F =    0.8097

. test (ceoten mktval)

 ( 1)  ceoten = 0
 ( 2)  mktval = 0

       F(  2,   172) =   18.33
            Prob > F =    0.0000

. corr ceoten mktval
(obs=177)

             |   ceoten   mktval
-------------+------------------
      ceoten |   1.0000
      mktval |   0.0066   1.0000


. generate lceoten = log(Ceoten)
Ceoten not found
r(111);

. generate lceoten = log(ceoten)
(5 missing values generated)

. regress salary lceoten

      Source |       SS           df       MS      Number of obs   =       172
-------------+----------------------------------   F(1, 170)       =      6.22
       Model |  2116516.52         1  2116516.52   Prob > F        =    0.0136
    Residual |  57859462.1       170  340349.777   R-squared       =    0.0353
-------------+----------------------------------   Adj R-squared   =    0.0296
       Total |  59975978.7       171  350736.717   Root MSE        =     583.4

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lceoten |   121.2063   48.60458     2.49   0.014     25.26008    217.1526
       _cons |   666.7176   95.05199     7.01   0.000     479.0834    854.3519
------------------------------------------------------------------------------

. browse ceoten

. browse ceoten lceoten

. browse ceoten lceoten if . 

. browse ceoten lceoten if lceoten==.

. replace lceoten = 0 if lceoten==.
(5 real changes made)

. browse lceoten if lceoten==0

. browse lceoten ceoten if lceoten==0

. regress salary lceoten

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      8.01
       Model |  2658341.36         1  2658341.36   Prob > F        =    0.0052
    Residual |  58107623.4       175  332043.562   R-squared       =    0.0437
-------------+----------------------------------   Adj R-squared   =    0.0383
       Total |  60765964.7       176  345261.163   Root MSE        =    576.23

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lceoten |    129.473   45.75845     2.83   0.005     39.16354    219.7824
       _cons |   648.4243   88.21307     7.35   0.000     474.3259    822.5227
------------------------------------------------------------------------------

. regress salary ceoten

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      3.65
       Model |  1241694.06         1  1241694.06   Prob > F        =    0.0577
    Residual |  59524270.7       175   340138.69   R-squared       =    0.0204
-------------+----------------------------------   Adj R-squared   =    0.0148
       Total |  60765964.7       176  345261.163   Root MSE        =    583.21

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   11.74613    6.14774     1.91   0.058     -.387127    23.87939
       _cons |   772.4263   65.67567    11.76   0.000     642.8079    902.0446
------------------------------------------------------------------------------

. test lceoten
lceoten not found
r(111);

. test ceoten

 ( 1)  ceoten = 0

       F(  1,   175) =    3.65
            Prob > F =    0.0577

. regress ceoten lceoten

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =    612.54
       Model |  6999.81994         1  6999.81994   Prob > F        =    0.0000
    Residual |  1999.81847       175  11.4275341   R-squared       =    0.7778
-------------+----------------------------------   Adj R-squared   =    0.7765
       Total |  8999.63842       176  51.1343092   Root MSE        =    3.3805

------------------------------------------------------------------------------
      ceoten |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lceoten |   6.643811   .2684418    24.75   0.000     6.114011    7.173611
       _cons |  -3.202975   .5175016    -6.19   0.000    -4.224323   -2.181627
------------------------------------------------------------------------------

. regress salary ceoten lceoten

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =      4.72
       Model |   3129626.1         2  1564813.05   Prob > F        =    0.0100
    Residual |  57636338.6       174  331243.326   R-squared       =    0.0515
-------------+----------------------------------   Adj R-squared   =    0.0406
       Total |  60765964.7       176  345261.163   Root MSE        =    575.54

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |  -15.35134   12.86999    -1.19   0.235    -40.75274    10.05005
     lceoten |   231.4644   96.95375     2.39   0.018     40.10762    422.8212
       _cons |   599.2543   97.27316     6.16   0.000     407.2671    791.2415
------------------------------------------------------------------------------

. test lceoten

 ( 1)  lceoten = 0

       F(  1,   174) =    5.70
            Prob > F =    0.0180

. regress salary mktval ceoten lceoten profmarg

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(4, 172)       =     12.79
       Model |  13933547.8         4  3483386.96   Prob > F        =    0.0000
    Residual |  46832416.9       172  272281.494   R-squared       =    0.2293
-------------+----------------------------------   Adj R-squared   =    0.2114
       Total |  60765964.7       176  345261.163   Root MSE        =    521.81

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mktval |   .0381728   .0061251     6.23   0.000     .0260826    .0502629
      ceoten |  -19.40737    11.7386    -1.65   0.100    -42.57762    3.762882
     lceoten |   267.3422   88.87033     3.01   0.003     91.92526    442.7591
    profmarg |  -3.047343    2.23277    -1.36   0.174    -7.454501    1.359814
       _cons |   453.3955   91.39396     4.96   0.000     272.9973    633.7937
------------------------------------------------------------------------------

. regress salary mktval lceoten

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =     23.21
       Model |  12797615.5         2  6398807.73   Prob > F        =    0.0000
    Residual |  47968349.3       174  275680.168   R-squared       =    0.2106
-------------+----------------------------------   Adj R-squared   =    0.2015
       Total |  60765964.7       176  345261.163   Root MSE        =    525.05

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mktval |    .037259   .0061437     6.06   0.000     .0251332    .0493847
     lceoten |   132.0766    41.6965     3.17   0.002     49.78059    214.3726
       _cons |   509.9077   83.56034     6.10   0.000     344.9853      674.83
------------------------------------------------------------------------------

. test mkval lceoten
mkval not found
r(111);

. test mktval lceoten

 ( 1)  mktval = 0
 ( 2)  lceoten = 0

       F(  2,   174) =   23.21
            Prob > F =    0.0000

. regress salary mktval ceoten

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =     19.72
       Model |  11227107.9         2  5613553.96   Prob > F        =    0.0000
    Residual |  49538856.8       174  284706.074   R-squared       =    0.1848
-------------+----------------------------------   Adj R-squared   =    0.1754
       Total |  60765964.7       176  345261.163   Root MSE        =    533.58

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mktval |    .036974   .0062433     5.92   0.000     .0246517    .0492963
      ceoten |   11.52597   5.624648     2.05   0.042     .4246476    22.62729
       _cons |   641.0594   64.04995    10.01   0.000     514.6446    767.4742
------------------------------------------------------------------------------

. test mktval ceoten

 ( 1)  mktval = 0
 ( 2)  ceoten = 0

       F(  2,   174) =   19.72
            Prob > F =    0.0000

. clear all 

. use ceos.dta

. set more off

. log using class7.log, replace
log file already open
r(604);

. log close
      name:  <unnamed>
       log:  /Users/mafton/Documents/School/Econ 644/class5.log
  log type:  text
 closed on:  25 Feb 2018, 16:53:24
----------------------------------------------------------------------------------
