----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mafton/Documents/School/Econ 644/class7.log
  log type:  text
 opened on:  25 Feb 2018, 16:53:26

. do "/var/folders/ks/zj678rv15j14wrl6l0lwz9dw0000gn/T//SD02539.000000"

. generate salarydol = salary*1000

. regress salarydol ceoten

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      3.65
       Model |  1.2417e+12         1  1.2417e+12   Prob > F        =    0.0577
    Residual |  5.9524e+13       175  3.4014e+11   R-squared       =    0.0204
-------------+----------------------------------   Adj R-squared   =    0.0148
       Total |  6.0766e+13       176  3.4526e+11   Root MSE        =    5.8e+05

------------------------------------------------------------------------------
   salarydol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   11746.13    6147.74     1.91   0.058     -387.127    23879.39
       _cons |   772426.3   65675.67    11.76   0.000     642807.9    902044.6
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/ks/zj678rv15j14wrl6l0lwz9dw0000gn/T//SD02539.000000"

. generate ceotenmon = ceoten*12

. regress salary ceotenmon

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      3.65
       Model |  1241694.06         1  1241694.06   Prob > F        =    0.0577
    Residual |  59524270.7       175   340138.69   R-squared       =    0.0204
-------------+----------------------------------   Adj R-squared   =    0.0148
       Total |  60765964.7       176  345261.163   Root MSE        =    583.21

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   ceotenmon |   .9788441   .5123117     1.91   0.058    -.0322606    1.989949
       _cons |   772.4263   65.67567    11.76   0.000     642.8079    902.0446
------------------------------------------------------------------------------

. 
end of do-file

. regress salary ceoten

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      3.65
       Model |  1241694.06         1  1241694.06   Prob > F        =    0.0577
    Residual |  59524270.7       175   340138.69   R-squared       =    0.0204
-------------+----------------------------------   Adj R-squared   =    0.0148
       Total |  60765964.7       176  345261.163   Root MSE        =    583.21

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   11.74613    6.14774     1.91   0.058     -.387127    23.87939
       _cons |   772.4263   65.67567    11.76   0.000     642.8079    902.0446
------------------------------------------------------------------------------

. regress salary ceoten age grad mktval

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(4, 172)       =      9.87
       Model |  11348587.4         4  2837146.84   Prob > F        =    0.0000
    Residual |  49417377.4       172  287310.334   R-squared       =    0.1868
-------------+----------------------------------   Adj R-squared   =    0.1678
       Total |  60765964.7       176  345261.163   Root MSE        =    536.01

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   10.55413   6.019706     1.75   0.081    -1.327879    22.43614
         age |   1.649817   5.162111     0.32   0.750    -8.539427    11.83906
        grad |  -43.43346    82.2966    -0.53   0.598    -205.8748    119.0079
      mktval |   .0371649   .0063706     5.83   0.000     .0245903    .0497395
       _cons |   578.0711   288.3528     2.00   0.047     8.905383    1147.237
------------------------------------------------------------------------------

. regress salary ceoten age grad mktval, beta

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(4, 172)       =      9.87
       Model |  11348587.4         4  2837146.84   Prob > F        =    0.0000
    Residual |  49417377.4       172  287310.334   R-squared       =    0.1868
-------------+----------------------------------   Adj R-squared   =    0.1678
       Total |  60765964.7       176  345261.163   Root MSE        =    536.01

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      ceoten |   10.55413   6.019706     1.75   0.081                 .1284413
         age |   1.649817   5.162111     0.32   0.750                 .0236468
        grad |  -43.43346    82.2966    -0.53   0.598                -.0369922
      mktval |   .0371649   .0063706     5.83   0.000                 .4074729
       _cons |   578.0711   288.3528     2.00   0.047                        .
------------------------------------------------------------------------------

. display mean ceoten
mean not found
r(111);

. display mean(ceoten)
unknown function mean()
r(133);

. summarize ceoten

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ceoten |        177    7.954802    7.150826          0         37

. test age grad

 ( 1)  age = 0
 ( 2)  grad = 0

       F(  2,   172) =    0.21
            Prob > F =    0.8097

. generate ceotensq = (ceoten)sq
unknown function ()
r(133);

. do "/var/folders/ks/zj678rv15j14wrl6l0lwz9dw0000gn/T//SD02539.000000"

. 
. regress salary ceoten age

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =      2.28
       Model |  1549476.74         2  774738.369   Prob > F        =    0.1057
    Residual |    59216488       174  340324.644   R-squared       =    0.0255
-------------+----------------------------------   Adj R-squared   =    0.0143
       Total |  60765964.7       176  345261.163   Root MSE        =    583.37

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   9.640682   6.535822     1.48   0.142    -3.259013    22.54038
         age |   5.277427   5.549411     0.95   0.343    -5.675397    16.23025
       _cons |   491.3727   302.7515     1.62   0.106    -106.1654    1088.911
------------------------------------------------------------------------------

. 
. regress salary ceoten age college

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(3, 173)       =      1.62
       Model |  1655674.54         3  551891.512   Prob > F        =    0.1876
    Residual |  59110290.2       173  341677.978   R-squared       =    0.0272
-------------+----------------------------------   Adj R-squared   =    0.0104
       Total |  60765964.7       176  345261.163   Root MSE        =    584.53

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   9.459174   6.556892     1.44   0.151    -3.482631    22.40098
         age |   4.801191   5.625666     0.85   0.395    -6.302588    15.90497
     college |  -150.4276   269.8226    -0.56   0.578    -682.9958    382.1405
       _cons |   665.8686   435.8762     1.53   0.128    -194.4515    1526.189
------------------------------------------------------------------------------

. 
. regress salary ceoten age

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =      2.28
       Model |  1549476.74         2  774738.369   Prob > F        =    0.1057
    Residual |    59216488       174  340324.644   R-squared       =    0.0255
-------------+----------------------------------   Adj R-squared   =    0.0143
       Total |  60765964.7       176  345261.163   Root MSE        =    583.37

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   9.640682   6.535822     1.48   0.142    -3.259013    22.54038
         age |   5.277427   5.549411     0.95   0.343    -5.675397    16.23025
       _cons |   491.3727   302.7515     1.62   0.106    -106.1654    1088.911
------------------------------------------------------------------------------

. 
. regress salary ceoten age college grad

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(4, 172)       =      1.23
       Model |  1695520.19         4  423880.048   Prob > F        =    0.2982
    Residual |  59070444.6       172  343432.817   R-squared       =    0.0279
-------------+----------------------------------   Adj R-squared   =    0.0053
       Total |  60765964.7       176  345261.163   Root MSE        =    586.03

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   9.589631   6.584856     1.46   0.147    -3.407902    22.58716
         age |   4.936118   5.653988     0.87   0.384    -6.224018    16.09625
     college |  -165.4244   274.0741    -0.60   0.547    -706.4062    375.5574
        grad |   30.76111   90.30929     0.34   0.734    -147.4961    209.0183
       _cons |   655.4537   438.0625     1.50   0.136    -209.2169    1520.124
------------------------------------------------------------------------------

. 
. test (college grad)

 ( 1)  college = 0
 ( 2)  grad = 0

       F(  2,   172) =    0.21
            Prob > F =    0.8087

. 
. generate ceotensq = ceoten^2

. 
. label variable ceotensq "ceoten^2"

. 
end of do-file

. do "/var/folders/ks/zj678rv15j14wrl6l0lwz9dw0000gn/T//SD02539.000000"

. generate ceoten_mktval = ceoten*mktval

. 
. label variable ceoten_mktval "ceoten*mktval"

. 
end of do-file

. do "/var/folders/ks/zj678rv15j14wrl6l0lwz9dw0000gn/T//SD02539.000000"

. generate lsalary = ln(salary)

. 
. label variable lsalary "ln(salary)"

. 
end of do-file

. help rt

