----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mafton/Documents/School/Econ 644/class10.log
  log type:  text
 opened on:   1 Apr 2018, 17:05:09

. set more off

. use ceosalary.dta

. gen female = (gender="F")
gender="F" invalid name
r(198);

. gen female = (gender=="F")

. label female "1 if female 0 if male"
invalid syntax
r(198);

. label variable female "1 if female 0 if male"

. browse mstatus

. gen married = (mstatus=="Married")
type mismatch
r(109);

. gen married = 
invalid syntax
r(198);

. gen married = (mstatus=="married")
type mismatch
r(109);

. tostring mstatus, replace
mstatus has value label; no replace

. browse mstatus

. gen married = (mstatus=="married")
type mismatch
r(109);

. decode mstatus, generate(m)

. browse m

. gen married = (m=="married")

. gen divorce = ("m=="divorced")
too few quotes
r(132);

. gen divorce = (m=="divorced")

. gen widowed = (m=="widowed")

. regress salary married divorce widowed age college grad comten ceoten pro
> fits mktval female

      Source |       SS           df       MS      Number of obs   =       
> 177
-------------+----------------------------------   F(11, 165)      =      4
> .29
       Model |  13502073.8        11  1227461.25   Prob > F        =    0.0
> 000
    Residual |    47263891       165  286447.824   R-squared       =    0.2
> 222
-------------+----------------------------------   Adj R-squared   =    0.1
> 703
       Total |  60765964.7       176  345261.163   Root MSE        =    535
> .21

---------------------------------------------------------------------------
> ---
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interv
> al]
-------------+-------------------------------------------------------------
> ---
     married |    114.684   162.2978     0.71   0.481    -205.7641    435.1
> 321
     divorce |   196.8915   194.1341     1.01   0.312    -186.4156    580.1
> 987
     widowed |  -45.79657   289.4235    -0.16   0.874    -617.2476    525.6
> 545
         age |   4.250667   5.707916     0.74   0.458    -7.019302    15.52
> 064
     college |  -179.4677   257.1257    -0.70   0.486    -687.1483     328.
> 213
        grad |  -70.47112   85.44714    -0.82   0.411    -239.1818     98.2
> 396
      comten |  -5.136405   3.941707    -1.30   0.194    -12.91909    2.646
> 281
      ceoten |   12.25928   6.187919     1.98   0.049     .0415695    24.47
> 699
     profits |   .2383963   .2556576     0.93   0.352    -.2663858    .7431
> 783
      mktval |   .0247887   .0159819     1.55   0.123    -.0067666    .0563
> 439
      female |  -264.8524   153.5259    -1.73   0.086    -567.9808    38.27
> 606
       _cons |   624.9867   450.3966     1.39   0.167    -264.2969     1514
> .27
---------------------------------------------------------------------------
> ---

. regress salary married divorce widowed age college grad comten ceoten profits mktval female

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(11, 165)      =      4.29
       Model |  13502073.8        11  1227461.25   Prob > F        =    0.0000
    Residual |    47263891       165  286447.824   R-squared       =    0.2222
-------------+----------------------------------   Adj R-squared   =    0.1703
       Total |  60765964.7       176  345261.163   Root MSE        =    535.21

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     married |    114.684   162.2978     0.71   0.481    -205.7641    435.1321
     divorce |   196.8915   194.1341     1.01   0.312    -186.4156    580.1987
     widowed |  -45.79657   289.4235    -0.16   0.874    -617.2476    525.6545
         age |   4.250667   5.707916     0.74   0.458    -7.019302    15.52064
     college |  -179.4677   257.1257    -0.70   0.486    -687.1483     328.213
        grad |  -70.47112   85.44714    -0.82   0.411    -239.1818     98.2396
      comten |  -5.136405   3.941707    -1.30   0.194    -12.91909    2.646281
      ceoten |   12.25928   6.187919     1.98   0.049     .0415695    24.47699
     profits |   .2383963   .2556576     0.93   0.352    -.2663858    .7431783
      mktval |   .0247887   .0159819     1.55   0.123    -.0067666    .0563439
      female |  -264.8524   153.5259    -1.73   0.086    -567.9808    38.27606
       _cons |   624.9867   450.3966     1.39   0.167    -264.2969     1514.27
------------------------------------------------------------------------------

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of salary

         chi2(1)      =     1.59
         Prob > chi2  =   0.2068

. test married=divorce=widowed=age=college=grad=comten=ceoten=profits=mktval=female=0

 ( 1)  married - divorce = 0
 ( 2)  married - widowed = 0
 ( 3)  married - age = 0
 ( 4)  married - college = 0
 ( 5)  married - grad = 0
 ( 6)  married - comten = 0
 ( 7)  married - ceoten = 0
 ( 8)  married - profits = 0
 ( 9)  married - mktval = 0
 (10)  married - female = 0
 (11)  married = 0

       F( 11,   165) =    4.29
            Prob > F =    0.0000

. test married divorce widowed age college grad comten ceoten profits mktval female

 ( 1)  married = 0
 ( 2)  divorce = 0
 ( 3)  widowed = 0
 ( 4)  age = 0
 ( 5)  college = 0
 ( 6)  grad = 0
 ( 7)  comten = 0
 ( 8)  ceoten = 0
 ( 9)  profits = 0
 (10)  mktval = 0
 (11)  female = 0

       F( 11,   165) =    4.29
            Prob > F =    0.0000

. regress salary age college grad comten ceoten profits mktval female

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(8, 168)       =      5.76
       Model |  13080324.7         8  1635040.58   Prob > F        =    0.0000
    Residual |  47685640.1       168  283843.096   R-squared       =    0.2153
-------------+----------------------------------   Adj R-squared   =    0.1779
       Total |  60765964.7       176  345261.163   Root MSE        =    532.77

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   3.540182    5.63355     0.63   0.531     -7.58149    14.66185
     college |  -210.1964   254.6122    -0.83   0.410    -712.8479    292.4552
        grad |  -69.37517   84.78809    -0.82   0.414    -236.7626    98.01223
      comten |  -5.686159   3.897423    -1.46   0.146    -13.38039    2.008077
      ceoten |   12.86975   6.120072     2.10   0.037     .7875975    24.95191
     profits |   .2448475   .2525791     0.97   0.334    -.2537904    .7434855
      mktval |   .0243655   .0158453     1.54   0.126     -.006916     .055647
      female |  -270.2888   152.4191    -1.77   0.078    -571.1923    30.61471
       _cons |   815.5428   407.8634     2.00   0.047     10.34489    1620.741
------------------------------------------------------------------------------

. test age college grad comten ceoten profits mktval female

 ( 1)  age = 0
 ( 2)  college = 0
 ( 3)  grad = 0
 ( 4)  comten = 0
 ( 5)  ceoten = 0
 ( 6)  profits = 0
 ( 7)  mktval = 0
 ( 8)  female = 0

       F(  8,   168) =    5.76
            Prob > F =    0.0000

. regress age college grad ceoten profits mktval female

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(6, 170)       =      5.37
       Model |  1989.69257         6  331.615428   Prob > F        =    0.0000
    Residual |  10493.6747       170   61.727498   R-squared       =    0.1594
-------------+----------------------------------   Adj R-squared   =    0.1297
       Total |  12483.3672       176  70.9282229   Root MSE        =    7.8567

------------------------------------------------------------------------------
         age |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     college |   -6.95062   3.712884    -1.87   0.063    -14.27992    .3786753
        grad |   -1.41666    1.22174    -1.16   0.248    -3.828396    .9950756
      ceoten |   .3779625   .0838673     4.51   0.000      .212407     .543518
     profits |   .0029489   .0037146     0.79   0.428    -.0043837    .0102815
      mktval |  -.0000239   .0002336    -0.10   0.919    -.0004851    .0004373
      female |  -2.218924   2.240614    -0.99   0.323    -6.641934    2.204086
       _cons |   60.57799   3.799988    15.94   0.000     53.07676    68.07923
------------------------------------------------------------------------------

. regress salary age college grad ceoten profits mktval female

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(7, 169)       =      6.24
       Model |  12476151.9         7  1782307.42   Prob > F        =    0.0000
    Residual |  48289812.8       169  285738.537   R-squared       =    0.2053
-------------+----------------------------------   Adj R-squared   =    0.1724
       Total |  60765964.7       176  345261.163   Root MSE        =    534.55

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |    .381314   5.218199     0.07   0.942    -9.919934    10.68256
     college |  -193.5405   255.2039    -0.76   0.449    -697.3387    310.2577
        grad |  -45.35565    83.4516    -0.54   0.588    -210.0975    119.3862
      ceoten |   11.24002   6.037322     1.86   0.064    -.6782591     23.1583
     profits |   .2293377   .2531965     0.91   0.366    -.2704976     .729173
      mktval |   .0240192   .0158963     1.51   0.133    -.0073618    .0554001
      female |  -264.9895   152.8837    -1.73   0.085    -566.7973    36.81837
       _cons |    853.915   408.3712     2.09   0.038     47.74914    1660.081
------------------------------------------------------------------------------

. test age college grad ceoten profits mktval female

 ( 1)  age = 0
 ( 2)  college = 0
 ( 3)  grad = 0
 ( 4)  ceoten = 0
 ( 5)  profits = 0
 ( 6)  mktval = 0
 ( 7)  female = 0

       F(  7,   169) =    6.24
            Prob > F =    0.0000

. regress college grad ceoten profits mktval female

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(5, 171)       =      2.91
       Model |  .381048065         5  .076209613   Prob > F        =    0.0151
    Residual |    4.477709       171  .026185433   R-squared       =    0.0784
-------------+----------------------------------   Adj R-squared   =    0.0515
       Total |  4.85875706       176  .027606574   Root MSE        =    .16182

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        grad |   .0524046   .0248422     2.11   0.036     .0033676    .1014415
      ceoten |  -.0020265   .0017204    -1.18   0.240    -.0054225    .0013694
     profits |  -.0000466   .0000764    -0.61   0.542    -.0001975    .0001042
      mktval |   1.50e-06   4.81e-06     0.31   0.756    -8.00e-06     .000011
      female |  -.1117347   .0453506    -2.46   0.015    -.2012537   -.0222157
       _cons |   .9731723   .0242315    40.16   0.000     .9253409    1.021004
------------------------------------------------------------------------------

. regress salary college grad ceoten profits mktval female

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(6, 170)       =      7.32
       Model |  12474626.1         6  2079104.36   Prob > F        =    0.0000
    Residual |  48291338.6       170  284066.698   R-squared       =    0.2053
-------------+----------------------------------   Adj R-squared   =    0.1772
       Total |  60765964.7       176  345261.163   Root MSE        =    532.98

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     college |  -196.1908   251.8734    -0.78   0.437    -693.3931    301.0114
        grad |  -45.89585      82.88    -0.55   0.580    -209.5024    117.7107
      ceoten |   11.38414   5.689363     2.00   0.047     .1532457    22.61504
     profits |   .2304621    .251988     0.91   0.362    -.2669664    .7278907
      mktval |   .0240101   .0158493     1.51   0.132    -.0072766    .0552968
      female |  -265.8356    151.998    -1.75   0.082    -565.8822    34.21103
       _cons |   877.0142   257.7823     3.40   0.001     368.1477    1385.881
------------------------------------------------------------------------------

. regress salary ceoten profits mktval female

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(4, 172)       =     10.77
       Model |  12168370.2         4  3042092.55   Prob > F        =    0.0000
    Residual |  48597594.5       172  282544.154   R-squared       =    0.2002
-------------+----------------------------------   Adj R-squared   =    0.1817
       Total |  60765964.7       176  345261.163   Root MSE        =    531.55

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   12.18854   5.620233     2.17   0.031     1.095032    23.28205
     profits |   .2468763   .2508167     0.98   0.326    -.2481988    .7419515
      mktval |   .0227567   .0157407     1.45   0.150    -.0083131    .0538265
      female |  -233.7872    148.241    -1.58   0.117     -526.393    58.81852
       _cons |   654.1589   64.68905    10.11   0.000     526.4723    781.8455
------------------------------------------------------------------------------

. regress salary ceoten

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      3.65
       Model |  1241694.06         1  1241694.06   Prob > F        =    0.0577
    Residual |  59524270.7       175   340138.69   R-squared       =    0.0204
-------------+----------------------------------   Adj R-squared   =    0.0148
       Total |  60765964.7       176  345261.163   Root MSE        =    583.21

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   11.74613    6.14774     1.91   0.058     -.387127    23.87939
       _cons |   772.4263   65.67567    11.76   0.000     642.8079    902.0446
------------------------------------------------------------------------------

. regress salary ceoten profits mktval female, beta

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(4, 172)       =     10.77
       Model |  12168370.2         4  3042092.55   Prob > F        =    0.0000
    Residual |  48597594.5       172  282544.154   R-squared       =    0.2002
-------------+----------------------------------   Adj R-squared   =    0.1817
       Total |  60765964.7       176  345261.163   Root MSE        =    531.55

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
      ceoten |   12.18854   5.620233     2.17   0.031                 .1483317
     profits |   .2468763   .2508167     0.98   0.326                  .169932
      mktval |   .0227567   .0157407     1.45   0.150                 .2495024
      female |  -233.7872    148.241    -1.58   0.117                -.1076866
       _cons |   654.1589   64.68905    10.11   0.000                        .
------------------------------------------------------------------------------

. test profits

 ( 1)  profits = 0

       F(  1,   172) =    0.97
            Prob > F =    0.3264

. exit, clear
