------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\dray\Downloads\disc10.log
  log type:  text
 opened on:   6 Nov 2018, 22:36:34

. use "C:\Users\dray\Downloads\agg_pt.dta", clear

. sort year 

. gen yr_qtr = yq(year, qtr)

. format yr_qtr %tq

. 
. tsset yr_qtr
        time variable:  yr_qtr, 2010q1 to 2017q4
                delta:  1 quarter

. 
. twoway (scatter pt yr_qtr, sort), ytitle(Personal Current Tax Receipts) xtitle(Time) title(Personal Income
>  over Time)

. 
. gen pt_1=L1.pt
(1 missing value generated)

. gen pt_2=L2.pt
(2 missing values generated)

. 
. regress pt pt_1 pt_2, robust

Linear regression                               Number of obs     =         30
                                                F(2, 27)          =     106.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8715
                                                Root MSE          =     19.632

------------------------------------------------------------------------------
             |               Robust
          pt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        pt_1 |   .8579884   .1371397     6.26   0.000      .576601    1.139376
        pt_2 |   .0509729   .1300446     0.39   0.698    -.2158567    .3178024
       _cons |   37.17057    20.5065     1.81   0.081    -4.905292    79.24643
------------------------------------------------------------------------------

. 
. gen qtr_1 = 1 if qtr==2
(24 missing values generated)

. replace qtr_1 = 0 if qtr_1==.
(24 real changes made)

. gen qtr_2 = 2 if qtr == 3
(24 missing values generated)

. replace qtr_2 = 0 if qtr_2 == .
(24 real changes made)

. gen qtr_3 = 3 if qtr ==4 
(24 missing values generated)

. replace qtr_3 = 0 if qtr_3 ==.
(24 real changes made)

. 
. gen t = _n

. regress pt pt_1 pt_2 i.qtr t

      Source |       SS           df       MS      Number of obs   =        30
-------------+----------------------------------   F(6, 23)        =    177.32
       Model |   79244.869         6  13207.4782   Prob > F        =    0.0000
    Residual |  1713.10627        23  74.4828812   R-squared       =    0.9788
-------------+----------------------------------   Adj R-squared   =    0.9733
       Total |  80957.9752        29  2791.65432   Root MSE        =    8.6303

------------------------------------------------------------------------------
          pt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        pt_1 |   .8375338   .2046782     4.09   0.000     .4141247    1.260943
        pt_2 |  -.1820108   .2021095    -0.90   0.377    -.6001061    .2360846
             |
         qtr |
          2  |  -4.723705   8.377307    -0.56   0.578    -22.05349    12.60608
          3  |   5.743161   9.387722     0.61   0.547    -13.67682    25.16314
          4  |   32.22863   7.496944     4.30   0.000     16.72002    47.73724
             |
           t |   1.884004   .9750059     1.93   0.066    -.1329494    3.900957
       _cons |   78.25049   37.42905     2.09   0.048     .8225951    155.6784
------------------------------------------------------------------------------

. regress pt i.qtr, robust

Linear regression                               Number of obs     =         32
                                                F(3, 28)          =       0.70
                                                Prob > F          =     0.5610
                                                R-squared         =     0.0666
                                                Root MSE          =     59.331

------------------------------------------------------------------------------
             |               Robust
          pt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         qtr |
          2  |   -10.0625   30.61651    -0.33   0.745    -72.77758    52.65258
          3  |  -5.825001   30.40205    -0.19   0.849    -68.10077    56.45077
          4  |     27.925    30.7706     0.91   0.372    -35.10571    90.95571
             |
       _cons |     329.25   22.89545    14.38   0.000     282.3508    376.1492
------------------------------------------------------------------------------

. predict yresid2, resid

. regress pt_1 i.qtr, robust

Linear regression                               Number of obs     =         31
                                                F(3, 27)          =       0.37
                                                Prob > F          =     0.7761
                                                R-squared         =     0.0357
                                                Root MSE          =     58.859

------------------------------------------------------------------------------
             |               Robust
        pt_1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         qtr |
          2  |     -18.45   31.03848    -0.59   0.557     -82.1357    45.23569
          3  |   -28.5125    29.1863    -0.98   0.337    -88.39785    31.37285
          4  |    -24.275    28.9602    -0.84   0.409    -83.69643    35.14643
             |
       _cons |      347.7   20.89877    16.64   0.000     304.8193    390.5807
------------------------------------------------------------------------------

. predict wresid2, resid
(1 missing value generated)

. regress pt_2 i.qtr, robust

Linear regression                               Number of obs     =         30
                                                F(3, 26)          =       0.51
                                                Prob > F          =     0.6784
                                                R-squared         =     0.0502
                                                Root MSE          =     58.408

------------------------------------------------------------------------------
             |               Robust
        pt_2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         qtr |
          2  |   33.57143   29.19833     1.15   0.261    -26.44659    93.58946
          3  |   15.12143     30.706     0.49   0.627    -47.99566    78.23852
          4  |   5.058929   28.82288     0.18   0.862    -54.18735     64.3052
             |
       _cons |   314.1286   20.33756    15.45   0.000     272.3241     355.933
------------------------------------------------------------------------------

. predict xresid2, resid
(2 missing values generated)

. 
. regress yresid2 wresid2 xresid2, robust

Linear regression                               Number of obs     =         30
                                                F(2, 27)          =     300.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9585
                                                Root MSE          =      10.91

------------------------------------------------------------------------------
             |               Robust
     yresid2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     wresid2 |   .8264827   .1317692     6.27   0.000     .5561147    1.096851
     xresid2 |   .1217968   .1159321     1.05   0.303    -.1160761    .3596698
       _cons |    3.72283   2.080189     1.79   0.085     -.545365    7.991025
------------------------------------------------------------------------------

. 
. regress pt pt_1 pt_2 t qtr_1 qtr_2 qtr_3, robust

Linear regression                               Number of obs     =         30
                                                F(6, 23)          =     269.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9788
                                                Root MSE          =     8.6303

------------------------------------------------------------------------------
             |               Robust
          pt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        pt_1 |   .8375338   .2203686     3.80   0.001     .3816667    1.293401
        pt_2 |  -.1820108   .1736972    -1.05   0.306    -.5413307    .1773092
           t |   1.884004    1.02584     1.84   0.079    -.2381069    4.006115
       qtr_1 |  -4.723705   6.300941    -0.75   0.461    -17.75819    8.310784
       qtr_2 |    2.87158   4.589969     0.63   0.538    -6.623493    12.36665
       qtr_3 |   10.74288   2.731826     3.93   0.001     5.091664    16.39409
       _cons |   78.25049   44.36868     1.76   0.091    -13.53311    170.0341
------------------------------------------------------------------------------

. predict pt_det, resid
(2 missing values generated)

. 
. gen pt_det_1 = L1.pt_det
(3 missing values generated)

. gen pt_det_2 = L2.pt_det
(4 missing values generated)

. reg pt_det pt_det_1 pt_det_2, robust

Linear regression                               Number of obs     =         28
                                                F(2, 25)          =       0.06
                                                Prob > F          =     0.9446
                                                R-squared         =     0.0038
                                                Root MSE          =     8.0033

------------------------------------------------------------------------------
             |               Robust
      pt_det |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    pt_det_1 |  -.0367108   .2286904    -0.16   0.874    -.5077075    .4342858
    pt_det_2 |    .047974    .158082     0.30   0.764    -.2776021      .37355
       _cons |   .4631835   1.524061     0.30   0.764     -2.67568    3.602047
------------------------------------------------------------------------------

. regress pt pt_1 pt_2 t qtr_1 qtr_2 qtr_3, robust

Linear regression                               Number of obs     =         30
                                                F(6, 23)          =     269.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9788
                                                Root MSE          =     8.6303

------------------------------------------------------------------------------
             |               Robust
          pt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        pt_1 |   .8375338   .2203686     3.80   0.001     .3816667    1.293401
        pt_2 |  -.1820108   .1736972    -1.05   0.306    -.5413307    .1773092
           t |   1.884004    1.02584     1.84   0.079    -.2381069    4.006115
       qtr_1 |  -4.723705   6.300941    -0.75   0.461    -17.75819    8.310784
       qtr_2 |    2.87158   4.589969     0.63   0.538    -6.623493    12.36665
       qtr_3 |   10.74288   2.731826     3.93   0.001     5.091664    16.39409
       _cons |   78.25049   44.36868     1.76   0.091    -13.53311    170.0341
------------------------------------------------------------------------------

. twoway (scatter pt_det yr_qtr, sort), ytitle(Detrended Personal Current Tax Receipts) xtitle(Time) title(P
> ersonal Income over Time)

. 
. 
end of do-file

. log closes
closes invalid
r(198);

. log close
      name:  <unnamed>
       log:  C:\Users\dray\Downloads\disc10.log
  log type:  text
 closed on:   6 Nov 2018, 22:36:48
------------------------------------------------------------------------------------------------------------
