------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mafton/Documents/Empirical Analysis II 2018\Final.log
  log type:  text
 opened on:  16 Aug 2018, 21:08:54

. 
. use "/Users/mafton/Library/Containers/com.apple.mail/Data/Library/Mail Downloads/D5360477-2DD3-438E-
> A6A5-EB8539AC620C/beauty1.dta"

. 
. /*Question 2*/
. gen lwage = ln(wage)

. 
. reg lwage belavg abvavg educ exper if female==1

      Source |       SS           df       MS      Number of obs   =       436
-------------+----------------------------------   F(4, 431)       =     26.82
       Model |  23.8401989         4  5.96004972   Prob > F        =    0.0000
    Residual |  95.7722647       431  .222209431   R-squared       =    0.1993
-------------+----------------------------------   Adj R-squared   =    0.1919
       Total |  119.612464       435  .274971181   Root MSE        =    .47139

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      belavg |  -.1083224   .0687651    -1.58   0.116     -.243479    .0268342
      abvavg |   .0384978   .0508339     0.76   0.449    -.0614153     .138411
        educ |   .0827915   .0089815     9.22   0.000     .0651385    .1004444
       exper |   .0110146   .0022148     4.97   0.000     .0066614    .0153677
       _cons |   .1046085    .124335     0.84   0.401    -.1397699    .3489869
------------------------------------------------------------------------------

. /*belavg not statistically significant pvalue higher than .05*/
. 
. reg lwage belavg abvavg educ exper if female==0

      Source |       SS           df       MS      Number of obs   =       824
-------------+----------------------------------   F(4, 819)       =     45.18
       Model |  43.4105072         4  10.8526268   Prob > F        =    0.0000
    Residual |  196.750746       819  .240232901   R-squared       =    0.1808
-------------+----------------------------------   Adj R-squared   =    0.1768
       Total |  240.161253       823  .291811973   Root MSE        =    .49014

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      belavg |  -.1732432    .054881    -3.16   0.002    -.2809673   -.0655192
      abvavg |  -.0375949   .0392972    -0.96   0.339    -.1147299    .0395401
        educ |   .0661737   .0066341     9.97   0.000     .0531518    .0791956
       exper |   .0146529   .0014513    10.10   0.000     .0118042    .0175015
       _cons |   .7505399   .0961824     7.80   0.000     .5617468     .939333
------------------------------------------------------------------------------

. /*belavg statistically significant; pvalue higher than .05*/
. 
. /*Question 3*/
. reg lwage belavg abvavg educ exper if female==1

      Source |       SS           df       MS      Number of obs   =       436
-------------+----------------------------------   F(4, 431)       =     26.82
       Model |  23.8401989         4  5.96004972   Prob > F        =    0.0000
    Residual |  95.7722647       431  .222209431   R-squared       =    0.1993
-------------+----------------------------------   Adj R-squared   =    0.1919
       Total |  119.612464       435  .274971181   Root MSE        =    .47139

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      belavg |  -.1083224   .0687651    -1.58   0.116     -.243479    .0268342
      abvavg |   .0384978   .0508339     0.76   0.449    -.0614153     .138411
        educ |   .0827915   .0089815     9.22   0.000     .0651385    .1004444
       exper |   .0110146   .0022148     4.97   0.000     .0066614    .0153677
       _cons |   .1046085    .124335     0.84   0.401    -.1397699    .3489869
------------------------------------------------------------------------------

. 
. test abvavg = belavg

 ( 1)  - belavg + abvavg = 0

       F(  1,   431) =    4.00
            Prob > F =    0.0462

. 
. /*pvalue less than .05, lwage between these two groups are not equal*/
. 
. /*Question 4. Yes, when relevant variables are omitted some of the effect they have on the dependent
> variable will be attributed to the included variables.*/
. 
. /*Question 5*/
. ovtest

Ramsey RESET test using powers of the fitted values of lwage
       Ho:  model has no omitted variables
                 F(3, 428) =      1.05
                  Prob > F =      0.3683

. /*We do not reject the null that there are no omitted variables. 
> No form misspecification found using the Ramsey test.*/
. /*Question 6*/
. gen educsq = educ^2

. 
. reg lwage belavg abvavg educ exper educsq expersq if female==1

      Source |       SS           df       MS      Number of obs   =       436
-------------+----------------------------------   F(6, 429)       =     20.20
       Model |  26.3495834         6  4.39159723   Prob > F        =    0.0000
    Residual |  93.2628803       429  .217395991   R-squared       =    0.2203
-------------+----------------------------------   Adj R-squared   =    0.2094
       Total |  119.612464       435  .274971181   Root MSE        =    .46626

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      belavg |  -.1370005   .0685399    -2.00   0.046    -.2717162   -.0022848
      abvavg |   .0469632   .0503431     0.93   0.351    -.0519866     .145913
        educ |  -.0247646   .0511924    -0.48   0.629    -.1253837    .0758545
       exper |   .0283745   .0073209     3.88   0.000     .0139852    .0427637
      educsq |   .0042285   .0020606     2.05   0.041     .0001784    .0082785
     expersq |  -.0004678    .000179    -2.61   0.009    -.0008196   -.0001159
       _cons |   .6609742   .3271631     2.02   0.044     .0179321    1.304016
------------------------------------------------------------------------------

. 
. reg lwage belavg abvavg educ exper educsq expersq if female==0

      Source |       SS           df       MS      Number of obs   =       824
-------------+----------------------------------   F(6, 817)       =     38.95
       Model |  53.4179471         6  8.90299119   Prob > F        =    0.0000
    Residual |  186.743306       817  .228571978   R-squared       =    0.2224
-------------+----------------------------------   Adj R-squared   =    0.2167
       Total |  240.161253       823  .291811973   Root MSE        =    .47809

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      belavg |  -.1710157   .0535938    -3.19   0.001    -.2762135   -.0658179
      abvavg |  -.0406589   .0384065    -1.06   0.290     -.116046    .0347283
        educ |   .0374904   .0359106     1.04   0.297    -.0329976    .1079783
       exper |   .0503501   .0056273     8.95   0.000     .0393045    .0613957
      educsq |   .0009718    .001461     0.67   0.506     -.001896    .0038396
     expersq |  -.0008022   .0001219    -6.58   0.000    -.0010414    -.000563
       _cons |   .6757041   .2302123     2.94   0.003     .2238268    1.127581
------------------------------------------------------------------------------

. 
. /*Adj R2 increased, educ and exper at first increase lwage and then start to decrease lwage. 
> standard errors increased slightly on educ and exper*/
. 
. /*Question 7*/
. reg lwage female belavg abvavg exper expersq educ educsq union goodhlth black married south bigcity 
> smllcity service

      Source |       SS           df       MS      Number of obs   =     1,260
-------------+----------------------------------   F(15, 1244)     =     59.42
       Model |  185.741455        15  12.3827637   Prob > F        =    0.0000
    Residual |  259.238517     1,244  .208391091   R-squared       =    0.4174
-------------+----------------------------------   Adj R-squared   =    0.4104
       Total |  444.979972     1,259  .353439215   Root MSE        =     .4565

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.3737648   .0305851   -12.22   0.000    -.4337689   -.3137607
      belavg |   -.139171   .0408547    -3.41   0.001    -.2193227   -.0590193
      abvavg |   .0099867    .029542     0.34   0.735    -.0479709    .0679444
       exper |   .0399223   .0043426     9.19   0.000     .0314027    .0484419
     expersq |  -.0006272   .0000962    -6.52   0.000    -.0008159   -.0004386
        educ |  -.0194128   .0289829    -0.67   0.503    -.0762736    .0374479
      educsq |   .0036047   .0011819     3.05   0.002      .001286    .0059234
       union |   .1565156   .0296101     5.29   0.000     .0984243    .2146068
    goodhlth |   .0782605   .0526075     1.49   0.137    -.0249488    .1814698
       black |  -.0905561    .051046    -1.77   0.076    -.1907019    .0095896
     married |   .0419894    .030751     1.37   0.172    -.0183402     .102319
       south |   .0680594   .0344379     1.98   0.048     .0004968    .1356221
     bigcity |   .2449862   .0372158     6.58   0.000     .1719735    .3179988
    smllcity |   .0984928   .0304009     3.24   0.001     .0388502    .1581355
     service |   -.165873   .0326044    -5.09   0.000    -.2298387   -.1019074
       _cons |   .8190226    .188716     4.34   0.000     .4487858    1.189259
------------------------------------------------------------------------------

. /*Female is statistically significant and there is a decrease in wage compared to men. abvavg isn't 
> significant in the pooled model but below average looks is. So, being good looking doesn't help 
> lwage but being considered bad looking hurts lwage.*/
. /*Question 8*/
. test union goodhlth black married south bigcity smllcity service

 ( 1)  union = 0
 ( 2)  goodhlth = 0
 ( 3)  black = 0
 ( 4)  married = 0
 ( 5)  south = 0
 ( 6)  bigcity = 0
 ( 7)  smllcity = 0
 ( 8)  service = 0

       F(  8,  1244) =   15.06
            Prob > F =    0.0000

. /*Jointly Significant. */
. /*Question 9*/
. predict uhat, resid

. 
. gen uhatsq = uhat^2 

. 
. reg uhatsq female belavg abvavg exper expersq educ educsq union goodhlth black married south bigcity
>  smllcity service

      Source |       SS           df       MS      Number of obs   =     1,260
-------------+----------------------------------   F(15, 1244)     =      2.11
       Model |  5.87533965        15   .39168931   Prob > F        =    0.0078
    Residual |  231.316025     1,244  .185945357   R-squared       =    0.0248
-------------+----------------------------------   Adj R-squared   =    0.0130
       Total |  237.191364     1,259  .188396636   Root MSE        =    .43121

------------------------------------------------------------------------------
      uhatsq |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.0251249    .028891    -0.87   0.385    -.0818054    .0315556
      belavg |  -.0264312   .0385918    -0.68   0.494    -.1021434     .049281
      abvavg |   .0180567   .0279057     0.65   0.518    -.0366908    .0728041
       exper |   .0041646    .004102     1.02   0.310    -.0038831    .0122123
     expersq |  -.0000994   .0000908    -1.09   0.274    -.0002776    .0000788
        educ |   .0003749   .0273776     0.01   0.989    -.0533364    .0540862
      educsq |  -.0003388   .0011164    -0.30   0.762    -.0025291    .0018514
       union |  -.0715564     .02797    -2.56   0.011    -.1264301   -.0166828
    goodhlth |  -.1016831   .0496937    -2.05   0.041    -.1991758   -.0041905
       black |   .0992309   .0482186     2.06   0.040     .0046321    .1938297
     married |   .0385476   .0290478     1.33   0.185    -.0184404    .0955356
       south |  -.0364672   .0325304    -1.12   0.262    -.1002877    .0273533
     bigcity |   .0249618   .0351544     0.71   0.478    -.0440067    .0939304
    smllcity |  -.0005365    .028717    -0.02   0.985    -.0568757    .0558026
     service |   .0935007   .0307985     3.04   0.002      .033078    .1539233
       _cons |   .2905883   .1782632     1.63   0.103    -.0591415    .6403181
------------------------------------------------------------------------------

. 
. scalar LM = e(r2)*e(N)

. scalar pvalue = chi2tail(e(df_m),LM)

. disp "Breusch-Pagan test: LM = " LM ", p-value = " pvalue
Breusch-Pagan test: LM = 31.210782, p-value = .0082315

. /*pvalue less than .05, heteroskedasticity exists p = .008. FGLS.*/
. 
. gen luhatsq = ln(uhatsq)

. 
. reg luhatsq female abvavg exper expersq educ educsq union goodhlth black married south bigcity smllc
> ity service

      Source |       SS           df       MS      Number of obs   =     1,260
-------------+----------------------------------   F(14, 1245)     =      1.39
       Model |  100.275548        14  7.16253915   Prob > F        =    0.1481
    Residual |  6395.94079     1,245  5.13730184   R-squared       =    0.0154
-------------+----------------------------------   Adj R-squared   =    0.0044
       Total |  6496.21633     1,259  5.15982235   Root MSE        =    2.2666

------------------------------------------------------------------------------
     luhatsq |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |   .0627301   .1517936     0.41   0.679    -.2350695    .3605297
      abvavg |   .0055619   .1422356     0.04   0.969     -.273486    .2846097
       exper |   .0188305   .0215588     0.87   0.383    -.0234652    .0611262
     expersq |  -.0003206   .0004774    -0.67   0.502    -.0012571    .0006159
        educ |  -.1620516   .1435776    -1.13   0.259    -.4437323    .1196291
      educsq |   .0068537   .0058599     1.17   0.242    -.0046427      .01835
       union |  -.3975444   .1467716    -2.71   0.007    -.6854913   -.1095974
    goodhlth |  -.1872882   .2611409    -0.72   0.473    -.6996129    .3250366
       black |   .4312594   .2530576     1.70   0.089    -.0652071    .9277259
     married |   .1780334   .1526802     1.17   0.244    -.1215056    .4775723
       south |  -.1409335   .1707908    -0.83   0.409    -.4760031    .1941362
     bigcity |    .126714   .1847478     0.69   0.493    -.2357375    .4891654
    smllcity |    .152591   .1507643     1.01   0.312    -.1431893    .4483712
     service |   .1758496   .1618196     1.09   0.277    -.1416196    .4933189
       _cons |  -2.338664   .9313562    -2.51   0.012    -4.165864   -.5114626
------------------------------------------------------------------------------

. 
. predict fitted
(option xb assumed; fitted values)

. 
. gen hhat = exp(fitted)

. 
. wls0 lwage female abvavg exper expersq educ educsq union goodhlth black married south bigcity smllci
> ty service, wvar(hhat) type(loge2) noconst graph

WLS regression -  type: proportional to log(e^2)

(sum of wgt is   2.1761e+02)

      Source |       SS           df       MS      Number of obs   =     1,260
-------------+----------------------------------   F(14, 1245)     =     65.64
       Model |  166.527449        14  11.8948178   Prob > F        =    0.0000
    Residual |  225.617975     1,245  .181219257   R-squared       =    0.4247
-------------+----------------------------------   Adj R-squared   =    0.4182
       Total |  392.145424     1,259  .311473728   Root MSE        =     .4257

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.3495595   .0288533   -12.12   0.000     -.406166   -.2929529
      abvavg |   .0272548   .0268884     1.01   0.311    -.0254968    .0800063
       exper |   .0461292   .0039462    11.69   0.000     .0383873    .0538711
     expersq |  -.0007678   .0000886    -8.66   0.000    -.0009417   -.0005939
        educ |  -.0006202   .0328014    -0.02   0.985    -.0649722    .0637318
      educsq |     .00287   .0013252     2.17   0.031     .0002702    .0054698
       union |   .1624869   .0249824     6.50   0.000     .1134747     .211499
    goodhlth |   .0816407   .0575447     1.42   0.156    -.0312546    .1945361
       black |  -.0713085   .0655213    -1.09   0.277    -.1998528    .0572358
     married |   .0498747   .0277729     1.80   0.073    -.0046121    .1043616
       south |   .0548386   .0293833     1.87   0.062    -.0028076    .1124848
     bigcity |   .1969907   .0339079     5.81   0.000     .1304679    .2635136
    smllcity |   .0831217   .0279282     2.98   0.003     .0283301    .1379133
     service |  -.1764276   .0353583    -4.99   0.000    -.2457961   -.1070592
       _cons |   .6386701   .2135741     2.99   0.003     .2196651    1.057675
------------------------------------------------------------------------------

. /*blk is no longer signif. The standard error went up on blk and so did the coefficient.*/
. /*Question 10*/
. reg lwage female abvavg exper expersq educ educsq union goodhlth black married south bigcity smllcit
> y service c.female#c.abvavg c.female#c.belavg

      Source |       SS           df       MS      Number of obs   =     1,260
-------------+----------------------------------   F(16, 1243)     =     55.22
       Model |  184.874073        16  11.5546296   Prob > F        =    0.0000
    Residual |  260.105899     1,243  .209256556   R-squared       =    0.4155
-------------+----------------------------------   Adj R-squared   =    0.4079
       Total |  444.979972     1,259  .353439215   Root MSE        =    .45745

-----------------------------------------------------------------------------------
            lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
           female |  -.3819182   .0384391    -9.94   0.000    -.4573309   -.3065056
           abvavg |  -.0036201   .0358034    -0.10   0.919    -.0738618    .0666217
            exper |   .0403845   .0043595     9.26   0.000     .0318318    .0489373
          expersq |  -.0006399   .0000966    -6.62   0.000    -.0008294   -.0004504
             educ |  -.0176247   .0290323    -0.61   0.544    -.0745824    .0393331
           educsq |   .0035825   .0011848     3.02   0.003     .0012581    .0059068
            union |   .1622519   .0296335     5.48   0.000     .1041147    .2203891
         goodhlth |   .0771283   .0527241     1.46   0.144    -.0263097    .1805663
            black |  -.0783288   .0511636    -1.53   0.126    -.1787054    .0220478
          married |   .0453394   .0308336     1.47   0.142    -.0151523    .1058311
            south |   .0663693   .0345296     1.92   0.055    -.0013735     .134112
          bigcity |   .2453913   .0373161     6.58   0.000     .1721817    .3186008
         smllcity |   .1000514   .0304552     3.29   0.001     .0403022    .1598007
          service |  -.1661508   .0326785    -5.08   0.000    -.2302619   -.1020397
                  |
c.female#c.abvavg |   .0765237    .060239     1.27   0.204    -.0416577    .1947051
                  |
c.female#c.belavg |  -.1387129   .0670951    -2.07   0.039    -.2703451   -.0070807
                  |
            _cons |   .7812078   .1883671     4.15   0.000     .4116553     1.15076
-----------------------------------------------------------------------------------

. 
. predict uhat2, resid

. 
. gen uhatsq2 = uhat2^2 

. 
. reg uhatsq2 female abvavg exper expersq educ educsq union goodhlth black married south bigcity smllc
> ity service

      Source |       SS           df       MS      Number of obs   =     1,260
-------------+----------------------------------   F(14, 1245)     =      2.22
       Model |  5.56556883        14   .39754063   Prob > F        =    0.0059
    Residual |  223.420169     1,245  .179453951   R-squared       =    0.0243
-------------+----------------------------------   Adj R-squared   =    0.0133
       Total |  228.985738     1,259  .181879061   Root MSE        =    .42362

------------------------------------------------------------------------------
     uhatsq2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.0292748   .0283702    -1.03   0.302    -.0849335    .0263839
      abvavg |   .0193492   .0265838     0.73   0.467    -.0328048    .0715032
       exper |   .0044162   .0040293     1.10   0.273    -.0034889    .0123212
     expersq |  -.0001059   .0000892    -1.19   0.236    -.0002809    .0000692
        educ |   .0013272   .0268346     0.05   0.961    -.0513189    .0539732
      educsq |  -.0003742   .0010952    -0.34   0.733    -.0025229    .0017744
       union |  -.0732662   .0274316    -2.67   0.008    -.1270835    -.019449
    goodhlth |   -.093606   .0488072    -1.92   0.055    -.1893594    .0021474
       black |   .0968317   .0472964     2.05   0.041     .0040422    .1896212
     married |   .0362885   .0285359     1.27   0.204    -.0196953    .0922723
       south |  -.0336075   .0319208    -1.05   0.293    -.0962319     .029017
     bigcity |   .0232632   .0345293     0.67   0.501     -.044479    .0910053
    smllcity |   .0000672   .0281778     0.00   0.998    -.0552141    .0553485
     service |    .092292   .0302441     3.05   0.002      .032957    .1516269
       _cons |   .2760357   .1740703     1.59   0.113    -.0654679    .6175393
------------------------------------------------------------------------------

. 
. scalar LM = e(r2)*e(N)

. scalar pvalue = chi2tail(e(df_m),LM)

. disp "Breusch-Pagan test: LM = " LM ", p-value = " pvalue
Breusch-Pagan test: LM = 30.624688, p-value = .00625408

. /*Heteroskedastic*/
. gen luhatsq2 = ln(uhatsq2)

. 
. reg luhatsq2 female abvavg exper expersq educ educsq union goodhlth black married south bigcity smll
> city service

      Source |       SS           df       MS      Number of obs   =     1,260
-------------+----------------------------------   F(14, 1245)     =      1.11
       Model |  73.4537899        14  5.24669928   Prob > F        =    0.3468
    Residual |  5903.41691     1,245  4.74170033   R-squared       =    0.0123
-------------+----------------------------------   Adj R-squared   =    0.0012
       Total |   5976.8707     1,259  4.74731588   Root MSE        =    2.1775

------------------------------------------------------------------------------
    luhatsq2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |   .0151199   .1458321     0.10   0.917    -.2709839    .3012237
      abvavg |   .0146028   .1366494     0.11   0.915    -.2534857    .2826913
       exper |    .023626   .0207121     1.14   0.254    -.0170086    .0642605
     expersq |  -.0004306   .0004586    -0.94   0.348    -.0013303    .0004692
        educ |  -.1220066   .1379387    -0.88   0.377    -.3926246    .1486113
      educsq |   .0051568   .0056297     0.92   0.360     -.005888    .0162016
       union |  -.3504458   .1410073    -2.49   0.013    -.6270839   -.0738078
    goodhlth |  -.1092478   .2508848    -0.44   0.663    -.6014514    .3829559
       black |   .3338262    .243119     1.37   0.170     -.143142    .8107945
     married |   .1399657   .1466839     0.95   0.340    -.1478091    .4277406
       south |  -.0487143   .1640832    -0.30   0.767    -.3706243    .2731958
     bigcity |  -.0423001    .177492    -0.24   0.812    -.3905166    .3059164
    smllcity |  -.0232356   .1448432    -0.16   0.873    -.3073993    .2609282
     service |   .1836455   .1554643     1.18   0.238    -.1213554    .4886465
       _cons |  -2.502558    .894778    -2.80   0.005    -4.257997   -.7471188
------------------------------------------------------------------------------

. 
. predict fitted2
(option xb assumed; fitted values)

. 
. gen hhat2 = exp(fitted2)

. 
. gen fbelavg = female*belavg

. gen fabvavg = female*abvavg

. wls0 lwage female abvavg exper expersq educ educsq union goodhlth black married south bigcity smllci
> ty service fabvavg fbelavg , wvar(hhat2) type(loge2) noconst graph

WLS regression -  type: proportional to log(e^2)

(sum of wgt is   1.9423e+02)

      Source |       SS           df       MS      Number of obs   =     1,260
-------------+----------------------------------   F(16, 1243)     =     58.43
       Model |  172.362515        16  10.7726572   Prob > F        =    0.0000
    Residual |  229.154926     1,243  .184356336   R-squared       =    0.4293
-------------+----------------------------------   Adj R-squared   =    0.4219
       Total |   401.51744     1,259  .318917745   Root MSE        =    .42937

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.3528939    .036164    -9.76   0.000    -.4238432   -.2819446
      abvavg |   .0006451   .0336797     0.02   0.985    -.0654303    .0667205
       exper |   .0460738   .0039723    11.60   0.000     .0382806    .0538671
     expersq |  -.0007716   .0000892    -8.65   0.000    -.0009467   -.0005966
        educ |  -.0024784   .0324052    -0.08   0.939    -.0660533    .0610965
      educsq |   .0029433   .0013086     2.25   0.025     .0003761    .0055106
       union |    .165441   .0253094     6.54   0.000     .1157872    .2150949
    goodhlth |   .0713113   .0549841     1.30   0.195    -.0365606    .1791833
       black |  -.0620958   .0598426    -1.04   0.300    -.1794995    .0553078
     married |   .0541654   .0281438     1.92   0.055    -.0010492      .10938
       south |    .044301   .0308647     1.44   0.151    -.0162517    .1048537
     bigcity |   .2047058   .0348515     5.87   0.000     .1363316      .27308
    smllcity |   .0871943   .0293126     2.97   0.003     .0296866    .1447021
     service |  -.1623481   .0351603    -4.62   0.000    -.2313282    -.093368
     fabvavg |   .0484549   .0573228     0.85   0.398    -.0640052     .160915
     fbelavg |  -.1175261   .0653949    -1.80   0.073    -.2458226    .0107704
       _cons |   .6628055   .2100519     3.16   0.002     .2507101    1.074901
------------------------------------------------------------------------------

. 
. test fbelavg fabvavg

 ( 1)  fbelavg = 0
 ( 2)  fabvavg = 0

       F(  2,  1243) =    2.44
            Prob > F =    0.0880

. /*Not jointly significant. pvalue too high*/
. /*Question 11*/
. use "/Users/mafton/Library/Containers/com.apple.mail/Data/Library/Mail Downloads/4F9D7FC9-E4D4-409C-
> 9BF0-D5604BBCB7E2/beauty2.dta", clear

. 
. count if wage==.
  300

. 
. /*If part of the population is unobserved, there is an endogenous sample selection bias.
> There may be selection factors which partly determine the wage. Therefore the estimators may be bias
> ed.*/
. 
. heckman lwage female abvavg exper expersq educ educsq union goodhlth black married south bigcity sml
> lcity service c.female#c.abvavg c.female#c.belavg, select(south married female bigcity smllcity good
> hlth) twostep
note: two-step estimate of rho = 1.4995585 is being truncated to 1

Heckman selection model -- two-step estimates   Number of obs     =      1,260
(regression model with sample selection)        Censored obs      =        300
                                                Uncensored obs    =        960

                                                Wald chi2(16)     =       1.37
                                                Prob > chi2       =     1.0000

-----------------------------------------------------------------------------------
            lwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
lwage             |
           female |  -.3563223   .9808453    -0.36   0.716    -2.278744    1.566099
           abvavg |   .0006133   .7388327     0.00   0.999    -1.447472    1.448699
            exper |   .0448864   .0919644     0.49   0.625    -.1353606    .2251333
          expersq |  -.0007317   .0020302    -0.36   0.719    -.0047109    .0032475
             educ |  -.0242184   .7038985    -0.03   0.973    -1.403834    1.355397
           educsq |   .0036598   .0277146     0.13   0.895    -.0506599    .0579794
            union |   .1437906   .6365371     0.23   0.821    -1.103799     1.39138
         goodhlth |  -.5292086   5.193762    -0.10   0.919     -10.7088    9.650378
            black |   .0438602    1.25811     0.03   0.972    -2.421989     2.50971
          married |   .3738914    3.26742     0.11   0.909    -6.030135    6.777917
            south |   .2418672   1.724915     0.14   0.888    -3.138904    3.622639
          bigcity |   3.149205   25.06916     0.13   0.900    -45.98545    52.28386
         smllcity |   2.012278   16.23381     0.12   0.901     -29.8054    33.82996
          service |  -.1488888   .6961704    -0.21   0.831    -1.513358     1.21558
                  |
c.female#c.abvavg |   .0563125   1.238972     0.05   0.964    -2.372028    2.484653
                  |
c.female#c.belavg |  -.1230298   1.523222    -0.08   0.936    -3.108491    2.862431
                  |
            _cons |  -4.940951   50.36278    -0.10   0.922    -103.6502    93.76829
------------------+----------------------------------------------------------------
select            |
            south |   .0337381   .1050884     0.32   0.748    -.1722313    .2397076
          married |   .0723085    .089251     0.81   0.418    -.1026202    .2472371
           female |   .0074176   .0866562     0.09   0.932    -.1624254    .1772606
          bigcity |   .5720744   .1126323     5.08   0.000     .3513191    .7928297
         smllcity |   .3463637   .0882991     3.92   0.000     .1733007    .5194267
         goodhlth |  -.1164204   .1601823    -0.73   0.467    -.4303718    .1975311
            _cons |    .491905   .1831627     2.69   0.007     .1329128    .8508972
------------------+----------------------------------------------------------------
mills             |
           lambda |   11.21876    97.3728     0.12   0.908    -179.6284     202.066
------------------+----------------------------------------------------------------
              rho |    1.00000
            sigma |   11.21876
-----------------------------------------------------------------------------------

. /*lambda doesn't seem to be significant so there doesn't seem to be much of a selection problem. The
>  parameters in the lwage model became insignificant.*/
. 
. log close
      name:  <unnamed>
       log:  /Users/mafton/Documents/Empirical Analysis II 2018\Final.log
  log type:  text
 closed on:  16 Aug 2018, 21:09:25
------------------------------------------------------------------------------------------------------
