--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mafton/Documents/Empirical Analysis II 2018/Final output.log
  log type:  text
 opened on:  11 Aug 2018, 17:35:44

. use "$data/SMOKE.dta", clear

. reg cigs lcigpric lincome educ age agesq restaurn white

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(7, 799)       =      6.38
       Model |  8029.43631         7  1147.06233   Prob > F        =    0.0000
    Residual |  143724.246       799  179.880158   R-squared       =    0.0529
-------------+----------------------------------   Adj R-squared   =    0.0446
       Total |  151753.683       806  188.280003   Root MSE        =    13.412

------------------------------------------------------------------------------
        cigs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lcigpric |  -.8509044   5.782321    -0.15   0.883    -12.20124    10.49943
     lincome |   .8690144   .7287636     1.19   0.233     -.561503    2.299532
        educ |  -.5017533   .1671677    -3.00   0.003     -.829893   -.1736135
         age |   .7745021   .1605158     4.83   0.000     .4594197    1.089585
       agesq |  -.0090686   .0017481    -5.19   0.000    -.0124999   -.0056373
    restaurn |  -2.865621   1.117406    -2.56   0.011    -5.059019   -.6722234
       white |  -.5592363   1.459461    -0.38   0.702    -3.424067    2.305594
       _cons |  -2.682435   24.22073    -0.11   0.912    -50.22621    44.86134
------------------------------------------------------------------------------

. di 2*_b[age] + 2*_b[agesq]
1.5308671

. gen educsq = educ^2

. reg cigs lcigpric lincome educ educsq aage agesq restaurn white
variable aage not found
r(111);

. reg cigs lcigpric lincome educ educsq age agesq restaurn white

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(8, 798)       =      7.00
       Model |  9955.76783         8  1244.47098   Prob > F        =    0.0000
    Residual |  141797.915       798  177.691623   R-squared       =    0.0656
-------------+----------------------------------   Adj R-squared   =    0.0562
       Total |  151753.683       806  188.280003   Root MSE        =     13.33

------------------------------------------------------------------------------
        cigs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lcigpric |   -.738594   5.747139    -0.13   0.898    -12.01989     10.5427
     lincome |   .6429412   .7275639     0.88   0.377     -.785224    2.071106
        educ |   2.795521   1.015125     2.75   0.006     .8028908    4.788152
      educsq |  -.1312803   .0398719    -3.29   0.001    -.2095465    -.053014
         age |   .8210826   .1601624     5.13   0.000     .5066933    1.135472
       agesq |   -.009326   .0017391    -5.36   0.000    -.0127399   -.0059122
    restaurn |  -2.797201   1.110782    -2.52   0.012      -4.9776    -.616801
       white |  -.6575381   1.450863    -0.45   0.651    -3.505496     2.19042
       _cons |  -21.76888   24.76106    -0.88   0.380    -70.37338    26.83562
------------------------------------------------------------------------------

. di abs(_b[educ]/(2*_b[educsq]))
10.64715

. gen college = (educ>12 & educ<=17)

. gen postgrad = (educ>17)

. reg cigs lcigpric lincome college postgrad age agesq restaurn white

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(8, 798)       =      6.13
       Model |  8783.03094         8  1097.87887   Prob > F        =    0.0000
    Residual |  142970.652       798  179.161218   R-squared       =    0.0579
-------------+----------------------------------   Adj R-squared   =    0.0484
       Total |  151753.683       806  188.280003   Root MSE        =    13.385

------------------------------------------------------------------------------
        cigs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lcigpric |  -.9719259   5.775202    -0.17   0.866    -12.30831    10.36446
     lincome |   .7895044   .7156523     1.10   0.270     -.615279    2.194288
     college |  -2.376504   1.077594    -2.21   0.028    -4.491757   -.2612502
    postgrad |  -5.607243    1.67158    -3.35   0.001    -8.888457    -2.32603
         age |   .7897323    .160321     4.93   0.000     .4750316    1.104433
       agesq |  -.0091198   .0017408    -5.24   0.000    -.0125369   -.0057027
    restaurn |  -2.872457   1.115333    -2.58   0.010     -5.06179   -.6831251
       white |  -.7187046    1.45758    -0.49   0.622    -3.579848    2.142439
       _cons |    -6.7848   24.21754    -0.28   0.779    -54.32241    40.75281
------------------------------------------------------------------------------

. summarize cigs

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        cigs |        807    8.686493    13.72152          0         80

. lcigs lcigprice
command lcigs is unrecognized
r(199);

. reg lcigs lcigprice
variable lcigs not found
r(111);

. reg cigs lcigpric lincome college postgrad age agesq restaurn white, robust

Linear regression                               Number of obs     =        807
                                                F(8, 798)         =       8.85
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0579
                                                Root MSE          =     13.385

------------------------------------------------------------------------------
             |               Robust
        cigs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lcigpric |  -.9719259   6.012446    -0.16   0.872      -12.774    10.83015
     lincome |   .7895044   .5843113     1.35   0.177    -.3574642    1.936473
     college |  -2.376504   1.090398    -2.18   0.030    -4.516891   -.2361165
    postgrad |  -5.607243   1.685067    -3.33   0.001    -8.914932   -2.299555
         age |   .7897323   .1382378     5.71   0.000     .5183796    1.061085
       agesq |  -.0091198   .0014574    -6.26   0.000    -.0119806    -.006259
    restaurn |  -2.872457   1.013931    -2.83   0.005    -4.862744   -.8821708
       white |  -.7187046   1.375795    -0.52   0.602     -3.41931    1.981901
       _cons |    -6.7848   25.70112    -0.26   0.792     -57.2346      43.665
------------------------------------------------------------------------------

. predict uhat, resid

. gen uhatsq = uhat^2

. regress uhatsq lcigpric lincome college postgrad age agesq restaurn white

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(8, 798)       =      4.06
       Model |   4361789.6         8  545223.699   Prob > F        =    0.0001
    Residual |   107175617       798  134305.285   R-squared       =    0.0391
-------------+----------------------------------   Adj R-squared   =    0.0295
       Total |   111537407       806  138383.879   Root MSE        =    366.48

------------------------------------------------------------------------------
      uhatsq |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lcigpric |   61.53555   158.1218     0.39   0.697    -248.8482    371.9193
     lincome |    25.4053   19.59416     1.30   0.195    -13.05688    63.86748
     college |  -4.074769   29.50392    -0.14   0.890    -61.98922    53.83968
    postgrad |  -28.73823   45.76692    -0.63   0.530     -118.576    61.09954
         age |    19.0841     4.3895     4.35   0.000     10.46777    27.70043
       agesq |  -.2105238   .0476621    -4.42   0.000    -.3040818   -.1169659
    restaurn |  -69.95761   30.53718    -2.29   0.022    -129.9003   -10.01492
       white |   8.381343   39.90772     0.21   0.834    -69.95517    86.71785
       _cons |  -675.0724   663.0627    -1.02   0.309    -1976.626    626.4808
------------------------------------------------------------------------------

. scalar LM = e(R2)*e(N)

. scalar pvalue = chi2tail(e(df_m),LM) 

. disp "BP Test: LM = " LM ", p-value = " pvalue
BP Test: LM = ., p-value = .

. scalar LM = e(r2)*e(N)

. scalar pvalue = chi2tail(e(df_m),LM) 

. disp "BP Test: LM = " LM ", p-value = " pvalue
BP Test: LM = 31.558598, p-value = .00011171

. reg cigs lcigpric lincome college postgrad age agesq restaurn white

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(8, 798)       =      6.13
       Model |  8783.03094         8  1097.87887   Prob > F        =    0.0000
    Residual |  142970.652       798  179.161218   R-squared       =    0.0579
-------------+----------------------------------   Adj R-squared   =    0.0484
       Total |  151753.683       806  188.280003   Root MSE        =    13.385

------------------------------------------------------------------------------
        cigs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lcigpric |  -.9719259   5.775202    -0.17   0.866    -12.30831    10.36446
     lincome |   .7895044   .7156523     1.10   0.270     -.615279    2.194288
     college |  -2.376504   1.077594    -2.21   0.028    -4.491757   -.2612502
    postgrad |  -5.607243    1.67158    -3.35   0.001    -8.888457    -2.32603
         age |   .7897323    .160321     4.93   0.000     .4750316    1.104433
       agesq |  -.0091198   .0017408    -5.24   0.000    -.0125369   -.0057027
    restaurn |  -2.872457   1.115333    -2.58   0.010     -5.06179   -.6831251
       white |  -.7187046    1.45758    -0.49   0.622    -3.579848    2.142439
       _cons |    -6.7848   24.21754    -0.28   0.779    -54.32241    40.75281
------------------------------------------------------------------------------

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of cigs

         chi2(1)      =    52.32
         Prob > chi2  =   0.0000

. estat hettest, fstat

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of cigs

         F(1 , 805)   =    24.42
         Prob > F     =   0.0000

. estat hettest lcigpric lincome college postgrad age agesq restaurn white

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: lcigpric lincome college postgrad age agesq restaurn white

         chi2(8)      =    69.48
         Prob > chi2  =   0.0000

. estat hettest lcigpric lincome college postgrad age agesq restaurn white, fstat

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: lcigpric lincome college postgrad age agesq restaurn white

         F(8 , 798)   =     4.06
         Prob > F     =   0.0001

. estat hettest lcigpric lincome college postgrad age agesq restaurn white, iid

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: lcigpric lincome college postgrad age agesq restaurn white

         chi2(8)      =    31.56
         Prob > chi2  =   0.0001

. reg cigs lcigpric lincome college postgrad age agesq restaurn white

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(8, 798)       =      6.13
       Model |  8783.03094         8  1097.87887   Prob > F        =    0.0000
    Residual |  142970.652       798  179.161218   R-squared       =    0.0579
-------------+----------------------------------   Adj R-squared   =    0.0484
       Total |  151753.683       806  188.280003   Root MSE        =    13.385

------------------------------------------------------------------------------
        cigs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lcigpric |  -.9719259   5.775202    -0.17   0.866    -12.30831    10.36446
     lincome |   .7895044   .7156523     1.10   0.270     -.615279    2.194288
     college |  -2.376504   1.077594    -2.21   0.028    -4.491757   -.2612502
    postgrad |  -5.607243    1.67158    -3.35   0.001    -8.888457    -2.32603
         age |   .7897323    .160321     4.93   0.000     .4750316    1.104433
       agesq |  -.0091198   .0017408    -5.24   0.000    -.0125369   -.0057027
    restaurn |  -2.872457   1.115333    -2.58   0.010     -5.06179   -.6831251
       white |  -.7187046    1.45758    -0.49   0.622    -3.579848    2.142439
       _cons |    -6.7848   24.21754    -0.28   0.779    -54.32241    40.75281
------------------------------------------------------------------------------

. 
. estat hettest lcigpric lincome college postgrad age agesq restaurn white, iid

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: lcigpric lincome college postgrad age agesq restaurn white

         chi2(8)      =    31.56
         Prob > chi2  =   0.0001

. 
. replace educ=14 if educ=13.5
invalid syntax
r(198);

. replace educ=14 if educ==13.5
(128 real changes made)

. gen smoke = (cigs>0)

. reg smoke lcigpric lincome educ age agesq restaurn whit

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(7, 799)       =      7.36
       Model |  11.5687931         7  1.65268473   Prob > F        =    0.0000
    Residual |  179.348183       799  .224465811   R-squared       =    0.0606
-------------+----------------------------------   Adj R-squared   =    0.0524
       Total |  190.916976       806  .236869698   Root MSE        =    .47378

------------------------------------------------------------------------------
       smoke |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lcigpric |  -.0695335   .2042604    -0.34   0.734    -.4704838    .3314169
     lincome |   .0114597   .0257491     0.45   0.656    -.0390843    .0620036
        educ |  -.0278946   .0058512    -4.77   0.000    -.0393802   -.0164091
         age |   .0197193   .0056698     3.48   0.001     .0085898    .0308487
       agesq |  -.0002588   .0000618    -4.19   0.000      -.00038   -.0001376
    restaurn |  -.1014495   .0394693    -2.57   0.010    -.1789253   -.0239737
       white |   -.026329   .0515564    -0.51   0.610     -.127531    .0748729
       _cons |   .6580353    .855598     0.77   0.442     -1.02145    2.337521
------------------------------------------------------------------------------

. di _b[cons] + 4*_b[lcigprice] + 10*_b[lincome] + 10*_b[educ] + 40*_b[age] + 40^2*_b[agesq] + _b[restau
> rn] + _b[white]
[cons] not found
r(111);

. di _b[_cons] + 4*_b[lcigprice] + 10*_b[lincome] + 10*_b[educ] + 40*_b[age] + 40^2*_b[agesq] + _b[resta
> urn] + _b[white]
[lcigprice] not found
r(111);

. di _b[_cons] + 4*_b[lcigpric] + 10*_b[lincome] + 10*_b[educ] + 40*_b[age] + 40^2*_b[agesq] + _b[restau
> rn] + _b[white]
.46246239

. logit smoke lcigpric lincome educ age agesq i.restaurn i.white

Iteration 0:   log likelihood = -537.50555  
Iteration 1:   log likelihood = -511.16905  
Iteration 2:   log likelihood = -510.83655  
Iteration 3:   log likelihood = -510.83607  
Iteration 4:   log likelihood = -510.83607  

Logistic regression                             Number of obs     =        807
                                                LR chi2(7)        =      53.34
                                                Prob > chi2       =     0.0000
Log likelihood = -510.83607                     Pseudo R2         =     0.0496

------------------------------------------------------------------------------
       smoke |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lcigpric |  -.3437251   .9075772    -0.38   0.705    -2.122544    1.435094
     lincome |   .0442479   .1158391     0.38   0.702    -.1827925    .2712884
        educ |  -.1299286   .0273708    -4.75   0.000    -.1835743   -.0762828
         age |   .1029774   .0280173     3.68   0.000     .0480645    .1578902
       agesq |  -.0013546   .0003182    -4.26   0.000    -.0019783    -.000731
  1.restaurn |  -.4597601   .1826826    -2.52   0.012    -.8178114   -.1017087
     1.white |   -.116197   .2332791    -0.50   0.618    -.5734155    .3410216
       _cons |    .756091   3.812504     0.20   0.843    -6.716279    8.228461
------------------------------------------------------------------------------

. logistic smoke lcigpric lincome educ age agesq i.restaurn i.white 

Logistic regression                             Number of obs     =        807
                                                LR chi2(7)        =      53.34
                                                Prob > chi2       =     0.0000
Log likelihood = -510.83607                     Pseudo R2         =     0.0496

------------------------------------------------------------------------------
       smoke | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lcigpric |   .7091239   .6435847    -0.38   0.705     .1197267    4.200038
     lincome |   1.045241   .1210798     0.38   0.702     .8329409    1.311653
        educ |   .8781582   .0240359    -4.75   0.000       .83229    .9265541
         age |   1.108466   .0310562     3.68   0.000     1.049238    1.171038
       agesq |   .9986463   .0003178    -4.26   0.000     .9980237    .9992693
  1.restaurn |   .6314351   .1153522    -2.52   0.012     .4413966    .9032926
     1.white |   .8902998   .2076883    -0.50   0.618     .5635972    1.406384
       _cons |   2.129934   8.120382     0.20   0.843      .001211    3746.066
------------------------------------------------------------------------------

. predict fitted, xb

. gen logit_pr = invlogit(fitted)

. tabstat logit_pr, by(restaurn) stat(mean) 

Summary for variables: logit_pr
     by categories of: restaurn (=1 if rest. smk. restrictions)

restaurn |      mean
---------+----------
       0 |  .4095395
       1 |  .3065327
---------+----------
   Total |  .3841388
--------------------

. margins restaurn

Predictive margins                              Number of obs     =        807
Model VCE    : OIM

Expression   : Pr(smoke), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    restaurn |
          0  |   .4086605   .0194708    20.99   0.000     .3704984    .4468226
          1  |   .3088693   .0325383     9.49   0.000     .2450954    .3726432
------------------------------------------------------------------------------

. probit smoke lcigpric lincome educ age agesq i.restaurn i.white

Iteration 0:   log likelihood = -537.50555  
Iteration 1:   log likelihood = -510.69836  
Iteration 2:   log likelihood = -510.56459  
Iteration 3:   log likelihood = -510.56458  

Probit regression                               Number of obs     =        807
                                                LR chi2(7)        =      53.88
                                                Prob > chi2       =     0.0000
Log likelihood = -510.56458                     Pseudo R2         =     0.0501

------------------------------------------------------------------------------
       smoke |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lcigpric |  -.2100911    .557247    -0.38   0.706    -1.302275    .8820929
     lincome |   .0283483   .0708336     0.40   0.689    -.1104831    .1671796
        educ |  -.0802914   .0165802    -4.84   0.000    -.1127879   -.0477948
         age |   .0622009   .0166426     3.74   0.000     .0295819    .0948199
       agesq |  -.0008173   .0001866    -4.38   0.000     -.001183   -.0004516
  1.restaurn |  -.2878434   .1110418    -2.59   0.010    -.5054814   -.0702053
     1.white |  -.0781589   .1428082    -0.55   0.584    -.3580578    .2017399
       _cons |   .4748289   2.341169     0.20   0.839    -4.113778    5.063436
------------------------------------------------------------------------------

. tab educ 

   years of |
  schooling |      Freq.     Percent        Cum.
------------+-----------------------------------
          6 |         43        5.33        5.33
          8 |         54        6.69       12.02
         10 |        126       15.61       27.63
         12 |        259       32.09       59.73
         14 |        128       15.86       75.59
         15 |         32        3.97       79.55
         16 |         86       10.66       90.21
         18 |         79        9.79      100.00
------------+-----------------------------------
      Total |        807      100.00

. margins, at(educ= (6 8 10 12 14 15 16 18)) atmeans

Adjusted predictions                            Number of obs     =        807
Model VCE    : OIM

Expression   : Pr(smoke), predict()

1._at        : lcigpric        =    4.096032 (mean)
               lincome         =    9.687316 (mean)
               educ            =           6
               age             =    41.23792 (mean)
               agesq           =    1990.135 (mean)
               0.restaurn      =    .7534077 (mean)
               1.restaurn      =    .2465923 (mean)
               0.white         =    .1214374 (mean)
               1.white         =    .8785626 (mean)

2._at        : lcigpric        =    4.096032 (mean)
               lincome         =    9.687316 (mean)
               educ            =           8
               age             =    41.23792 (mean)
               agesq           =    1990.135 (mean)
               0.restaurn      =    .7534077 (mean)
               1.restaurn      =    .2465923 (mean)
               0.white         =    .1214374 (mean)
               1.white         =    .8785626 (mean)

3._at        : lcigpric        =    4.096032 (mean)
               lincome         =    9.687316 (mean)
               educ            =          10
               age             =    41.23792 (mean)
               agesq           =    1990.135 (mean)
               0.restaurn      =    .7534077 (mean)
               1.restaurn      =    .2465923 (mean)
               0.white         =    .1214374 (mean)
               1.white         =    .8785626 (mean)

4._at        : lcigpric        =    4.096032 (mean)
               lincome         =    9.687316 (mean)
               educ            =          12
               age             =    41.23792 (mean)
               agesq           =    1990.135 (mean)
               0.restaurn      =    .7534077 (mean)
               1.restaurn      =    .2465923 (mean)
               0.white         =    .1214374 (mean)
               1.white         =    .8785626 (mean)

5._at        : lcigpric        =    4.096032 (mean)
               lincome         =    9.687316 (mean)
               educ            =          14
               age             =    41.23792 (mean)
               agesq           =    1990.135 (mean)
               0.restaurn      =    .7534077 (mean)
               1.restaurn      =    .2465923 (mean)
               0.white         =    .1214374 (mean)
               1.white         =    .8785626 (mean)

6._at        : lcigpric        =    4.096032 (mean)
               lincome         =    9.687316 (mean)
               educ            =          15
               age             =    41.23792 (mean)
               agesq           =    1990.135 (mean)
               0.restaurn      =    .7534077 (mean)
               1.restaurn      =    .2465923 (mean)
               0.white         =    .1214374 (mean)
               1.white         =    .8785626 (mean)

7._at        : lcigpric        =    4.096032 (mean)
               lincome         =    9.687316 (mean)
               educ            =          16
               age             =    41.23792 (mean)
               agesq           =    1990.135 (mean)
               0.restaurn      =    .7534077 (mean)
               1.restaurn      =    .2465923 (mean)
               0.white         =    .1214374 (mean)
               1.white         =    .8785626 (mean)

8._at        : lcigpric        =    4.096032 (mean)
               lincome         =    9.687316 (mean)
               educ            =          18
               age             =    41.23792 (mean)
               agesq           =    1990.135 (mean)
               0.restaurn      =    .7534077 (mean)
               1.restaurn      =    .2465923 (mean)
               0.white         =    .1214374 (mean)
               1.white         =    .8785626 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .5816065   .0448591    12.97   0.000     .4936842    .6695288
          2  |   .5181146   .0340862    15.20   0.000      .451307    .5849223
          3  |    .454159   .0239027    19.00   0.000     .4073105    .5010074
          4  |   .3913727   .0178472    21.93   0.000     .3563928    .4263526
          5  |   .3313002   .0194667    17.02   0.000     .2931462    .3694541
          6  |   .3027117   .0222593    13.60   0.000     .2590843    .3463391
          7  |   .2752842   .0254256    10.83   0.000     .2254509    .3251175
          8  |   .2243778    .031291     7.17   0.000     .1630486     .285707
------------------------------------------------------------------------------

. probit smoke lcigpric lincome i.educ age agesq i.restaurn i.white 

Iteration 0:   log likelihood = -537.50555  
Iteration 1:   log likelihood = -497.72087  
Iteration 2:   log likelihood = -497.46553  
Iteration 3:   log likelihood = -497.46546  
Iteration 4:   log likelihood = -497.46546  

Probit regression                               Number of obs     =        807
                                                LR chi2(13)       =      80.08
                                                Prob > chi2       =     0.0000
Log likelihood = -497.46546                     Pseudo R2         =     0.0745

------------------------------------------------------------------------------
       smoke |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lcigpric |  -.1277847   .5698608    -0.22   0.823    -1.244691    .9891219
     lincome |   -.029754   .0720311    -0.41   0.680    -.1709323    .1114243
             |
        educ |
          8  |   .5033277   .2814475     1.79   0.074    -.0482992    1.054955
         10  |   .6563532   .2458584     2.67   0.008     .1744796    1.138227
         12  |   .2713197   .2318603     1.17   0.242    -.1831181    .7257575
         14  |   .3116251   .2477069     1.26   0.208    -.1738715    .7971218
         15  |  -.4169604   .3390002    -1.23   0.219    -1.081389    .2474678
         16  |   -.211112   .2667767    -0.79   0.429    -.7339847    .3117607
         18  |  -.4678051   .2781893    -1.68   0.093    -1.013046    .0774358
             |
         age |   .0749873    .017259     4.34   0.000     .0411602    .1088143
       agesq |  -.0009374   .0001941    -4.83   0.000    -.0013179   -.0005569
  1.restaurn |  -.2726792   .1121041    -2.43   0.015    -.4923991   -.0529593
     1.white |  -.0735338   .1446957    -0.51   0.611    -.3571321    .2100644
       _cons |  -.8026569   2.403374    -0.33   0.738    -5.513183    3.907869
------------------------------------------------------------------------------

. margins educ, atmeans

Adjusted predictions                            Number of obs     =        807
Model VCE    : OIM

Expression   : Pr(smoke), predict()
at           : lcigpric        =    4.096032 (mean)
               lincome         =    9.687316 (mean)
               6.educ          =    .0532838 (mean)
               8.educ          =    .0669145 (mean)
               10.educ         =    .1561338 (mean)
               12.educ         =    .3209418 (mean)
               14.educ         =    .1586121 (mean)
               15.educ         =     .039653 (mean)
               16.educ         =    .1065675 (mean)
               18.educ         =    .0978934 (mean)
               age             =    41.23792 (mean)
               agesq           =    1990.135 (mean)
               0.restaurn      =    .7534077 (mean)
               1.restaurn      =    .2465923 (mean)
               0.white         =    .1214374 (mean)
               1.white         =    .8785626 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |
          6  |   .3017474   .0755266     4.00   0.000      .153718    .4497767
          8  |   .4935957   .0756119     6.53   0.000     .3453992    .6417923
         10  |   .5544734   .0456184    12.15   0.000      .465063    .6438838
         12  |   .4020433   .0311754    12.90   0.000     .3409406     .463146
         14  |   .4177096   .0443718     9.41   0.000     .3307424    .5046768
         15  |   .1745486   .0671221     2.60   0.009     .0429917    .3061055
         16  |   .2325443   .0459263     5.06   0.000     .1425304    .3225581
         18  |   .1617756   .0414288     3.90   0.000     .0805767    .2429744
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  /Users/mafton/Documents/Empirical Analysis II 2018/Final output.log
  log type:  text
 closed on:  11 Aug 2018, 18:20:27
--------------------------------------------------------------------------------------------------------
