------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\dray\Downloads\midterm.log
  log type:  text
 opened on:   4 Oct 2018, 20:43:35

. use "C:\Users\dray\Downloads\saversdata.dta"
(SAVASTATA created this dataset on 15MAR2012)

. sum lsavings

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    lsavings |    499,386    4.141021     1.80147  -8.517193   8.517193

. sum lsavings if elig==0 & year == 2001

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    lsavings |     75,846    4.446852    1.770845  -8.517193   8.516393

. sum lsavings if elig==1 & year == 2001

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    lsavings |      9,570    1.856398    .3326183  -2.896792   2.302585

. sum lsavings if elig==0 & year == 2006

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    lsavings |     79,063    4.241782    1.654375  -8.517193   8.516393

. sum lsavings if elig==1 & year == 2006

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    lsavings |      7,060    1.924041     .280439  -1.013352   2.302585

. 
. regress lsavings i.elig##i.year if year==2001 | year==2006

      Source |       SS           df       MS      Number of obs   =   171,539
-------------+----------------------------------   F(3, 171535)    =  11579.04
       Model |  92312.0079         3  30770.6693   Prob > F        =    0.0000
    Residual |  455844.885   171,535  2.65744533   R-squared       =    0.1684
-------------+----------------------------------   Adj R-squared   =    0.1684
       Total |  548156.893   171,538  3.19554205   Root MSE        =    1.6302

------------------------------------------------------------------------------
    lsavings |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      1.elig |  -2.590453    .017684  -146.49   0.000    -2.625113   -2.555793
             |
        year |
       2006  |  -.2050693   .0082855   -24.75   0.000    -.2213087     -.18883
             |
   elig#year |
     1 2006  |   .2727116   .0268839    10.14   0.000     .2200198    .3254034
             |
       _cons |   4.446852   .0059192   751.25   0.000      4.43525    4.458453
------------------------------------------------------------------------------

. 
. sort elig year

. bysort elig: gen lsavings1 = lsavings[_n] - lsavings[_n-1]
(53,848 missing values generated)

. regress lsavings1 i.elig i.year i.elig##i.year, vce(cluster elig) 

Linear regression                               Number of obs     =    473,375
                                                F(0, 1)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0000
                                                Root MSE          =     2.2962

                                   (Std. Err. adjusted for 2 clusters in elig)
------------------------------------------------------------------------------
             |               Robust
   lsavings1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      1.elig |   .0027201   2.28e-14  1.2e+11   0.000     .0027201    .0027201
             |
        year |
       2002  |   .0017334   2.49e-14  6.9e+10   0.000     .0017334    .0017334
       2003  |   .0046272   3.19e-14  1.4e+11   0.000     .0046272    .0046272
       2004  |   .0034529   2.51e-14  1.4e+11   0.000     .0034529    .0034529
       2005  |   .0019556   2.60e-14  7.5e+10   0.000     .0019556    .0019556
       2006  |   .0042363   2.67e-14  1.6e+11   0.000     .0042363    .0042363
             |
   elig#year |
     1 2002  |  -.0023315   2.49e-14 -9.3e+10   0.000    -.0023315   -.0023315
     1 2003  |  -.0055236   3.19e-14 -1.7e+11   0.000    -.0055236   -.0055236
     1 2004  |  -.0029463   2.51e-14 -1.2e+11   0.000    -.0029463   -.0029463
     1 2005  |  -.0041232   2.60e-14 -1.6e+11   0.000    -.0041232   -.0041232
     1 2006  |  -.0057944   2.67e-14 -2.2e+11   0.000    -.0057944   -.0057944
             |
       _cons |  -.0020269   2.28e-14 -8.9e+10   0.000    -.0020269   -.0020269
------------------------------------------------------------------------------

. 
. use "C:\Users\dray\Downloads\IVdata.dta", clear

. 
. regress y x 

      Source |       SS           df       MS      Number of obs   =       200
-------------+----------------------------------   F(1, 198)       =   1756.69
       Model |  609.037784         1  609.037784   Prob > F        =    0.0000
    Residual |  68.6460091       198  .346697016   R-squared       =    0.8987
-------------+----------------------------------   Adj R-squared   =    0.8982
       Total |  677.683793       199   3.4054462   Root MSE        =    .58881

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   1.820864   .0434441    41.91   0.000     1.735192    1.906537
       _cons |  -.0626746    .041756    -1.50   0.135    -.1450182    .0196689
------------------------------------------------------------------------------

. estimates store ols_1

. ivregress 2sls y (x = z) 

Instrumental variables (2SLS) regression          Number of obs   =        200
                                                  Wald chi2(1)    =       7.43
                                                  Prob > chi2     =     0.0064
                                                  R-squared       =     0.7795
                                                  Root MSE        =     .86436

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   1.157732   .4247748     2.73   0.006     .3251883    1.990275
       _cons |  -.0142162   .0685499    -0.21   0.836    -.1485716    .1201392
------------------------------------------------------------------------------
Instrumented:  x
Instruments:   z

. estimates store iv

. 
. regress x z 

      Source |       SS           df       MS      Number of obs   =       200
-------------+----------------------------------   F(1, 198)       =      4.57
       Model |  4.14067491         1  4.14067491   Prob > F        =    0.0338
    Residual |  179.550845       198  .906822451   R-squared       =    0.0225
-------------+----------------------------------   Adj R-squared   =    0.0176
       Total |   183.69152       199  .923072966   Root MSE        =    .95227

------------------------------------------------------------------------------
           x |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           z |   .1346526   .0630145     2.14   0.034      .010387    .2589183
       _cons |    .082566   .0674821     1.22   0.223      -.05051     .215642
------------------------------------------------------------------------------

. test z 

 ( 1)  z = 0

       F(  1,   198) =    4.57
            Prob > F =    0.0338

. 
. hausman ols_1 iv

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     ols_1          iv         Difference          S.E.
-------------+----------------------------------------------------------------
           x |    1.820864     1.157732        .6631326               .
------------------------------------------------------------------------------
                         b = consistent under Ho and Ha; obtained from regress
        B = inconsistent under Ha, efficient under Ho; obtained from ivregress

    Test:  Ho:  difference in coefficients not systematic

                  chi2(1) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =    -2.46    chi2<0 ==> model fitted on these
                                        data fails to meet the asymptotic
                                        assumptions of the Hausman test;
                                        see suest for a generalized test

. 
. 
. 
end of do-file

. log close
      name:  <unnamed>
       log:  C:\Users\dray\Downloads\midterm.log
  log type:  text
 closed on:   4 Oct 2018, 20:44:15
------------------------------------------------------------------------------------
