------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\dray\AppData\Local\Microsoft\Windows\INetCache\problemset4.log
  log type:  text
 opened on:   8 Nov 2018, 13:22:14

. use "C:\Users\dray\Downloads\minwage.dta" 

. /*
> 1.      Run a regression of gwage232 on gmwage, gcpi. Do the sign and magnitude of 
> the estimated coefficient on gmwage make sense to you? Explain. Is it statistically significant? */
. 
. 
. regress gwage232 gmwage gcpi

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(2, 608)       =    125.80
       Model |  .015739988         2  .007869994   Prob > F        =    0.0000
    Residual |  .038037711       608  .000062562   R-squared       =    0.2927
-------------+----------------------------------   Adj R-squared   =    0.2904
       Total |  .053777699       610   .00008816   Root MSE        =    .00791

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |   .1505714   .0096574    15.59   0.000     .1316055    .1695372
        gcpi |   .2435223    .082128     2.97   0.003     .0822333    .4048112
       _cons |   .0021842   .0004213     5.18   0.000     .0013569    .0030115
------------------------------------------------------------------------------

. browse gwage232 gmwage gcpi

. 
. /*Since the minimum wage in sector 232 is already higher than the federal minimum wage, 
> it makes sense that an increase in the federal minimum wage would have less of an impact 
> on the min wage in that sector. It is statistically significant. But, the change in the 
> minimum wage in sector 232 may not be due to the federal minimum wage increase at all and 
> may be due to other covariants. 1) gcpi may be endogenous 2) because we didn't account for the
>  natural trend in sector 232 and remove that from the effect of gmwage on gwage232, we have biased 
>  the coefficient.3) we may be missing other variables that may be impacting wages like changes in union
>  contracts*/
. 
. /*
> 2.      Add lags 1 – 12 of gmwage to the equation from (1).  Do you think it is necessary to include these
>  lags to estimate the long run effect of minimum wage 
> growth on wage growth in sector 232? Explain.*/
. 
. regress gwage232 gcpi gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwag
> e_9 gmwage_10 gmwage_11 gmwage_12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(14, 584)      =     20.18
       Model |  .016919577        14  .001208541   Prob > F        =    0.0000
    Residual |  .034967639       584  .000059876   R-squared       =    0.3261
-------------+----------------------------------   Adj R-squared   =    0.3099
       Total |  .051887216       598  .000086768   Root MSE        =    .00774

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gcpi |   .2077567   .0885913     2.35   0.019     .0337602    .3817532
      gmwage |   .1493019    .009484    15.74   0.000     .1306749    .1679289
    gmwage_1 |  -.0043451   .0094838    -0.46   0.647    -.0229716    .0142814
    gmwage_2 |   .0007167   .0094661     0.08   0.940     -.017875    .0193085
    gmwage_3 |  -.0188113    .009498    -1.98   0.048    -.0374656   -.0001569
    gmwage_4 |  -.0062754   .0095646    -0.66   0.512    -.0250606    .0125098
    gmwage_5 |  -.0074584   .0096048    -0.78   0.438    -.0263226    .0114057
    gmwage_6 |   .0015449   .0095503     0.16   0.872    -.0172122    .0203021
    gmwage_7 |  -.0004578   .0095175    -0.05   0.962    -.0191505     .018235
    gmwage_8 |   .0190364   .0095234     2.00   0.046      .000332    .0377407
    gmwage_9 |   .0187524   .0095198     1.97   0.049     .0000552    .0374496
   gmwage_10 |   .0120034   .0095452     1.26   0.209    -.0067437    .0307505
   gmwage_11 |   .0156649   .0095891     1.63   0.103    -.0031685    .0344982
   gmwage_12 |   .0179264   .0095979     1.87   0.062    -.0009242    .0367769
       _cons |   .0020967   .0004278     4.90   0.000     .0012564    .0029369
------------------------------------------------------------------------------

. test gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwage_9 gmwage_10 gmw
> age_11 gmwage_12

 ( 1)  gmwage = 0
 ( 2)  gmwage_1 = 0
 ( 3)  gmwage_2 = 0
 ( 4)  gmwage_3 = 0
 ( 5)  gmwage_4 = 0
 ( 6)  gmwage_5 = 0
 ( 7)  gmwage_6 = 0
 ( 8)  gmwage_7 = 0
 ( 9)  gmwage_8 = 0
 (10)  gmwage_9 = 0
 (11)  gmwage_10 = 0
 (12)  gmwage_11 = 0
 (13)  gmwage_12 = 0

       F( 13,   584) =   21.13
            Prob > F =    0.0000

. 
. /* The shortrun propensity = .1493019 with a high Tvalue, low standard error and a significant pvalue; 
> The joint test for significance - fstatistic is only almost significant at the .05 level. 
> The Rsq and Adj Rsq both increase when we add the additional time lags,
>  so more effects on y are explained by this regression but may have biased
>  coefficients and we may be overestimating the Rsq of this regression by not 
>  proproperly accounting for the natural trend in sector 232. */
. 
. gen sub1 = gmwage_1 - gmwage
(2 missing values generated)

. gen sub2 = gmwage_2 - gmwage
(3 missing values generated)

. gen sub3 = gmwage_3 - gmwage
(4 missing values generated)

. gen sub4 = gmwage_4 - gmwage
(5 missing values generated)

. gen sub5 = gmwage_5 - gmwage
(6 missing values generated)

. gen sub6 = gmwage_6 - gmwage
(7 missing values generated)

. gen sub7 = gmwage_7 - gmwage
(8 missing values generated)

. gen sub8 = gmwage_8 - gmwage
(9 missing values generated)

. gen sub9 = gmwage_9 - gmwage
(10 missing values generated)

. gen sub10 = gmwage_10 - gmwage
(11 missing values generated)

. gen sub11 = gmwage_11 - gmwage
(12 missing values generated)

. gen sub12 = gmwage_12 - gmwage
(13 missing values generated)

. 
. regress gwage232 gcpi gmwage sub1 sub2 sub3 sub4 sub5 sub6 sub7 sub8 sub9 sub10 sub11 sub12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(14, 584)      =     20.18
       Model |  .016919577        14  .001208541   Prob > F        =    0.0000
    Residual |  .034967639       584  .000059876   R-squared       =    0.3261
-------------+----------------------------------   Adj R-squared   =    0.3099
       Total |  .051887216       598  .000086768   Root MSE        =    .00774

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gcpi |   .2077567   .0885913     2.35   0.019     .0337602    .3817532
      gmwage |    .197599   .0385492     5.13   0.000     .1218869     .273311
        sub1 |  -.0043451   .0094838    -0.46   0.647    -.0229716    .0142814
        sub2 |   .0007167   .0094661     0.08   0.940     -.017875    .0193085
        sub3 |  -.0188113    .009498    -1.98   0.048    -.0374656   -.0001569
        sub4 |  -.0062754   .0095646    -0.66   0.512    -.0250606    .0125098
        sub5 |  -.0074584   .0096048    -0.78   0.438    -.0263226    .0114057
        sub6 |   .0015449   .0095503     0.16   0.872    -.0172122    .0203021
        sub7 |  -.0004578   .0095175    -0.05   0.962    -.0191505     .018235
        sub8 |   .0190364   .0095234     2.00   0.046      .000332    .0377407
        sub9 |   .0187524   .0095198     1.97   0.049     .0000552    .0374496
       sub10 |   .0120034   .0095452     1.26   0.209    -.0067437    .0307505
       sub11 |   .0156649   .0095891     1.63   0.103    -.0031685    .0344982
       sub12 |   .0179264   .0095979     1.87   0.062    -.0009242    .0367769
       _cons |   .0020967   .0004278     4.90   0.000     .0012564    .0029369
------------------------------------------------------------------------------

. 
. /* The long run propensity is .197599  which is also the sum of the coefficients on 
> the regression of gwage232 onto the lagged variables and gmwage and gcpi and is statistically significant 
> at 
> the .01 significance level */
. 
. /* Detrended Regression*/
. gen tsq = t^2

. 
. regress gwage232 gcpi gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwag
> e_9 gmwage_10 gmwage_11 gmwage_12 t tsq

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(16, 582)      =     18.37
       Model |  .017408555        16  .001088035   Prob > F        =    0.0000
    Residual |  .034478661       582  .000059242   R-squared       =    0.3355
-------------+----------------------------------   Adj R-squared   =    0.3172
       Total |  .051887216       598  .000086768   Root MSE        =     .0077

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gcpi |   .0907912   .0977894     0.93   0.354     -.101272    .2828544
      gmwage |   .1507736   .0094518    15.95   0.000     .1322098    .1693374
    gmwage_1 |  -.0020212   .0094759    -0.21   0.831    -.0206323    .0165898
    gmwage_2 |   .0024429   .0094405     0.26   0.796    -.0160988    .0209846
    gmwage_3 |  -.0162895   .0094967    -1.72   0.087    -.0349416    .0023625
    gmwage_4 |  -.0035872   .0095741    -0.37   0.708    -.0223912    .0152167
    gmwage_5 |  -.0043729   .0096306    -0.45   0.650    -.0232877     .014542
    gmwage_6 |    .004003   .0095511     0.42   0.675    -.0147558    .0227619
    gmwage_7 |   .0013721   .0094983     0.14   0.885     -.017283    .0200271
    gmwage_8 |    .020997   .0095077     2.21   0.028     .0023235    .0396706
    gmwage_9 |   .0206125    .009501     2.17   0.030     .0019521     .039273
   gmwage_10 |   .0142992   .0095397     1.50   0.134    -.0044372    .0330356
   gmwage_11 |   .0184511   .0096012     1.92   0.055    -.0004061    .0373083
   gmwage_12 |   .0204457   .0095987     2.13   0.034     .0015934     .039298
           t |    .000024   8.36e-06     2.86   0.004     7.53e-06    .0000404
         tsq |  -3.47e-08   1.27e-08    -2.74   0.006    -5.95e-08   -9.81e-09
       _cons |  -.0007146   .0011018    -0.65   0.517    -.0028785    .0014494
------------------------------------------------------------------------------

. /* Short Run propensity =  .1507736 */
. 
. test gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwage_9 gmwage_10 gmw
> age_11 gmwage_12

 ( 1)  gmwage = 0
 ( 2)  gmwage_1 = 0
 ( 3)  gmwage_2 = 0
 ( 4)  gmwage_3 = 0
 ( 5)  gmwage_4 = 0
 ( 6)  gmwage_5 = 0
 ( 7)  gmwage_6 = 0
 ( 8)  gmwage_7 = 0
 ( 9)  gmwage_8 = 0
 (10)  gmwage_9 = 0
 (11)  gmwage_10 = 0
 (12)  gmwage_11 = 0
 (13)  gmwage_12 = 0

       F( 13,   582) =   21.72
            Prob > F =    0.0000

. test t tsq

 ( 1)  t = 0
 ( 2)  tsq = 0

       F(  2,   582) =    4.13
            Prob > F =    0.0166

. test gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwage_9 gmwage_10 gmw
> age_11 gmwage_12 t tsq

 ( 1)  gmwage = 0
 ( 2)  gmwage_1 = 0
 ( 3)  gmwage_2 = 0
 ( 4)  gmwage_3 = 0
 ( 5)  gmwage_4 = 0
 ( 6)  gmwage_5 = 0
 ( 7)  gmwage_6 = 0
 ( 8)  gmwage_7 = 0
 ( 9)  gmwage_8 = 0
 (10)  gmwage_9 = 0
 (11)  gmwage_10 = 0
 (12)  gmwage_11 = 0
 (13)  gmwage_12 = 0
 (14)  t = 0
 (15)  tsq = 0

       F( 15,   582) =   19.06
            Prob > F =    0.0000

. 
. /* Long Run Propensity*/
. regress gwage232 gcpi gmwage sub1 sub2 sub3 sub4 sub5 sub6 sub7 sub8 sub9 sub10 sub11 sub12 t tsq

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(16, 582)      =     18.37
       Model |  .017408555        16  .001088035   Prob > F        =    0.0000
    Residual |  .034478661       582  .000059242   R-squared       =    0.3355
-------------+----------------------------------   Adj R-squared   =    0.3172
       Total |  .051887216       598  .000086768   Root MSE        =     .0077

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gcpi |   .0907912   .0977894     0.93   0.354     -.101272    .2828544
      gmwage |   .2271262   .0401117     5.66   0.000     .1483449    .3059076
        sub1 |  -.0020212   .0094759    -0.21   0.831    -.0206323    .0165898
        sub2 |   .0024429   .0094405     0.26   0.796    -.0160988    .0209846
        sub3 |  -.0162895   .0094967    -1.72   0.087    -.0349416    .0023625
        sub4 |  -.0035872   .0095741    -0.37   0.708    -.0223912    .0152167
        sub5 |  -.0043729   .0096306    -0.45   0.650    -.0232877     .014542
        sub6 |    .004003   .0095511     0.42   0.675    -.0147558    .0227619
        sub7 |   .0013721   .0094983     0.14   0.885     -.017283    .0200271
        sub8 |    .020997   .0095077     2.21   0.028     .0023235    .0396706
        sub9 |   .0206125    .009501     2.17   0.030     .0019521     .039273
       sub10 |   .0142992   .0095397     1.50   0.134    -.0044372    .0330356
       sub11 |   .0184511   .0096012     1.92   0.055    -.0004061    .0373083
       sub12 |   .0204457   .0095987     2.13   0.034     .0015934     .039298
           t |    .000024   8.36e-06     2.86   0.004     7.53e-06    .0000404
         tsq |  -3.47e-08   1.27e-08    -2.74   0.006    -5.95e-08   -9.81e-09
       _cons |  -.0007146   .0011018    -0.65   0.517    -.0028785    .0014494
------------------------------------------------------------------------------

. 
. /* Obtain actual R2*/
. regress gwage232 t tsq

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(2, 608)       =      1.93
       Model |  .000338792         2  .000169396   Prob > F        =    0.1464
    Residual |  .053438907       608  .000087893   R-squared       =    0.0063
-------------+----------------------------------   Adj R-squared   =    0.0030
       Total |  .053777699       610   .00008816   Root MSE        =    .00938

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   .0000169   8.64e-06     1.96   0.051    -6.61e-08    .0000339
         tsq |  -2.64e-08   1.36e-08    -1.94   0.053    -5.32e-08    3.78e-10
       _cons |   .0017361   .0011491     1.51   0.131    -.0005205    .0039927
------------------------------------------------------------------------------

. predict yresid, resid
(1 missing value generated)

. regress gcpi t tsq

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(2, 608)       =     21.71
       Model |  .000618197         2  .000309099   Prob > F        =    0.0000
    Residual |  .008657212       608  .000014239   R-squared       =    0.0666
-------------+----------------------------------   Adj R-squared   =    0.0636
       Total |  .009275409       610  .000015206   Root MSE        =    .00377

------------------------------------------------------------------------------
        gcpi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   .0000215   3.48e-06     6.18   0.000     .0000147    .0000283
         tsq |  -2.97e-08   5.49e-09    -5.42   0.000    -4.05e-08   -1.90e-08
       _cons |   .0004251   .0004625     0.92   0.358    -.0004831    .0013334
------------------------------------------------------------------------------

. predict wresid, resid
(1 missing value generated)

. regress gmwage t tsq

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(2, 608)       =      0.47
       Model |  .001042495         2  .000521247   Prob > F        =    0.6232
    Residual |  .669765185       608  .001101587   R-squared       =    0.0016
-------------+----------------------------------   Adj R-squared   =   -0.0017
       Total |  .670807679       610  .001099685   Root MSE        =    .03319

------------------------------------------------------------------------------
      gmwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   -.000022   .0000306    -0.72   0.472    -.0000821    .0000381
         tsq |   2.58e-08   4.83e-08     0.53   0.593    -6.90e-08    1.21e-07
       _cons |     .00771   .0040679     1.90   0.059    -.0002788    .0156989
------------------------------------------------------------------------------

. predict residx_0, resid
(1 missing value generated)

. regress gmwage_1 t tsq

      Source |       SS           df       MS      Number of obs   =       610
-------------+----------------------------------   F(2, 607)       =      0.47
       Model |  .001040341         2  .000520171   Prob > F        =    0.6243
    Residual |  .669749819       607  .001103377   R-squared       =    0.0016
-------------+----------------------------------   Adj R-squared   =   -0.0017
       Total |   .67079016       609  .001101462   Root MSE        =    .03322

------------------------------------------------------------------------------
    gmwage_1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0000223   .0000308    -0.73   0.469    -.0000828    .0000381
         tsq |   2.63e-08   4.85e-08     0.54   0.588    -6.89e-08    1.22e-07
       _cons |    .007752   .0041013     1.89   0.059    -.0003026    .0158065
------------------------------------------------------------------------------

. predict residx_1, resid
(2 missing values generated)

. regress gmwage_2 t tsq

      Source |       SS           df       MS      Number of obs   =       609
-------------+----------------------------------   F(2, 606)       =      0.47
       Model |  .001038511         2  .000519256   Prob > F        =    0.6253
    Residual |  .669734072       606  .001105172   R-squared       =    0.0015
-------------+----------------------------------   Adj R-squared   =   -0.0017
       Total |  .670772584       608  .001103244   Root MSE        =    .03324

------------------------------------------------------------------------------
    gmwage_2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0000226    .000031    -0.73   0.465    -.0000835    .0000382
         tsq |   2.68e-08   4.87e-08     0.55   0.582    -6.89e-08    1.23e-07
       _cons |   .0077948   .0041351     1.89   0.060    -.0003261    .0159156
------------------------------------------------------------------------------

. predict residx2, resid
(3 missing values generated)

. regress gmwage_3 t tsq

      Source |       SS           df       MS      Number of obs   =       608
-------------+----------------------------------   F(2, 605)       =      0.47
       Model |  .001037013         2  .000518507   Prob > F        =    0.6262
    Residual |  .669717936       605  .001106972   R-squared       =    0.0015
-------------+----------------------------------   Adj R-squared   =   -0.0018
       Total |   .67075495       607  .001105033   Root MSE        =    .03327

------------------------------------------------------------------------------
    gmwage_3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   -.000023   .0000312    -0.74   0.462    -.0000842    .0000383
         tsq |   2.74e-08   4.90e-08     0.56   0.577    -6.88e-08    1.24e-07
       _cons |   .0078384   .0041692     1.88   0.061    -.0003494    .0160262
------------------------------------------------------------------------------

. predict residx3, resid
(4 missing values generated)

. regress gmwage_4 t tsq

      Source |       SS           df       MS      Number of obs   =       607
-------------+----------------------------------   F(2, 604)       =      0.52
       Model |  .001140963         2  .000570481   Prob > F        =    0.5953
    Residual |  .663729181       604  .001098889   R-squared       =    0.0017
-------------+----------------------------------   Adj R-squared   =   -0.0016
       Total |  .664870144       606  .001097145   Root MSE        =    .03315

------------------------------------------------------------------------------
    gmwage_4 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0000179   .0000312    -0.57   0.568    -.0000792    .0000435
         tsq |   1.70e-08   4.90e-08     0.35   0.729    -7.92e-08    1.13e-07
       _cons |   .0074513   .0041848     1.78   0.075    -.0007672    .0156697
------------------------------------------------------------------------------

. predict residx4, resid
(5 missing values generated)

. regress gmwage_5 t tsq

      Source |       SS           df       MS      Number of obs   =       606
-------------+----------------------------------   F(2, 603)       =      0.51
       Model |  .001132776         2  .000566388   Prob > F        =    0.5980
    Residual |  .663720723       603  .001100698   R-squared       =    0.0017
-------------+----------------------------------   Adj R-squared   =   -0.0016
       Total |  .664853499       605  .001098931   Root MSE        =    .03318

------------------------------------------------------------------------------
    gmwage_5 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0000181   .0000314    -0.58   0.565    -.0000798    .0000436
         tsq |   1.74e-08   4.92e-08     0.35   0.724    -7.93e-08    1.14e-07
       _cons |   .0074848   .0042194     1.77   0.077    -.0008017    .0157713
------------------------------------------------------------------------------

. predict residx5, resid
(6 missing values generated)

. regress gmwage_6 t tsq

      Source |       SS           df       MS      Number of obs   =       605
-------------+----------------------------------   F(2, 602)       =      0.51
       Model |  .001124769         2  .000562385   Prob > F        =    0.6007
    Residual |  .663712029       602  .001102512   R-squared       =    0.0017
-------------+----------------------------------   Adj R-squared   =   -0.0016
       Total |  .664836798       604  .001100723   Root MSE        =     .0332

------------------------------------------------------------------------------
    gmwage_6 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0000183   .0000316    -0.58   0.563    -.0000805    .0000438
         tsq |   1.78e-08   4.95e-08     0.36   0.719    -7.94e-08    1.15e-07
       _cons |    .007519   .0042544     1.77   0.078    -.0008362    .0158741
------------------------------------------------------------------------------

. predict residx6, resid
(7 missing values generated)

. regress gmwage_7 t tsq

      Source |       SS           df       MS      Number of obs   =       604
-------------+----------------------------------   F(2, 601)       =      0.51
       Model |  .001116949         2  .000558475   Prob > F        =    0.6033
    Residual |  .663703094       601  .001104331   R-squared       =    0.0017
-------------+----------------------------------   Adj R-squared   =   -0.0016
       Total |  .664820043       603  .001102521   Root MSE        =    .03323

------------------------------------------------------------------------------
    gmwage_7 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0000186   .0000318    -0.58   0.560    -.0000811     .000044
         tsq |   1.82e-08   4.97e-08     0.37   0.714    -7.95e-08    1.16e-07
       _cons |   .0075538   .0042897     1.76   0.079    -.0008707    .0159784
------------------------------------------------------------------------------

. predict residx7, resid
(8 missing values generated)

. regress gmwage_8 t tsq

      Source |       SS           df       MS      Number of obs   =       603
-------------+----------------------------------   F(2, 600)       =      0.50
       Model |  .001109321         2   .00055466   Prob > F        =    0.6059
    Residual |  .663693911       600  .001106157   R-squared       =    0.0017
-------------+----------------------------------   Adj R-squared   =   -0.0017
       Total |  .664803232       602  .001104324   Root MSE        =    .03326

------------------------------------------------------------------------------
    gmwage_8 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0000188    .000032    -0.59   0.557    -.0000817    .0000441
         tsq |   1.86e-08   5.00e-08     0.37   0.710    -7.95e-08    1.17e-07
       _cons |   .0075894   .0043253     1.75   0.080    -.0009051     .016084
------------------------------------------------------------------------------

. predict residx8, resid
(9 missing values generated)

. regress gmwage_9 t tsq

      Source |       SS           df       MS      Number of obs   =       602
-------------+----------------------------------   F(2, 599)       =      0.50
       Model |   .00110189         2  .000550945   Prob > F        =    0.6085
    Residual |  .663684474       599  .001107987   R-squared       =    0.0017
-------------+----------------------------------   Adj R-squared   =   -0.0017
       Total |  .664786365       601  .001106134   Root MSE        =    .03329

------------------------------------------------------------------------------
    gmwage_9 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0000191   .0000322    -0.59   0.555    -.0000824    .0000443
         tsq |   1.90e-08   5.02e-08     0.38   0.705    -7.96e-08    1.18e-07
       _cons |   .0076257   .0043613     1.75   0.081    -.0009395     .016191
------------------------------------------------------------------------------

. predict residx9, resid
(10 missing values generated)

. regress gmwage_10 t tsq

      Source |       SS           df       MS      Number of obs   =       601
-------------+----------------------------------   F(2, 598)       =      0.49
       Model |  .001094664         2  .000547332   Prob > F        =    0.6109
    Residual |  .663674778       598  .001109824   R-squared       =    0.0016
-------------+----------------------------------   Adj R-squared   =   -0.0017
       Total |  .664769441       600  .001107949   Root MSE        =    .03331

------------------------------------------------------------------------------
   gmwage_10 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0000193   .0000325    -0.60   0.552    -.0000831    .0000444
         tsq |   1.95e-08   5.05e-08     0.39   0.700    -7.97e-08    1.19e-07
       _cons |   .0076628   .0043976     1.74   0.082    -.0009739    .0162994
------------------------------------------------------------------------------

. predict residx10, resid
(11 missing values generated)

. regress gmwage_11 t tsq

      Source |       SS           df       MS      Number of obs   =       600
-------------+----------------------------------   F(2, 597)       =      0.49
       Model |  .001087646         2  .000543823   Prob > F        =    0.6134
    Residual |  .663664816       597  .001111666   R-squared       =    0.0016
-------------+----------------------------------   Adj R-squared   =   -0.0017
       Total |  .664752462       599   .00110977   Root MSE        =    .03334

------------------------------------------------------------------------------
   gmwage_11 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0000196   .0000327    -0.60   0.549    -.0000837    .0000446
         tsq |   1.99e-08   5.07e-08     0.39   0.695    -7.97e-08    1.20e-07
       _cons |   .0077006   .0044343     1.74   0.083    -.0010082    .0164093
------------------------------------------------------------------------------

. predict residx11, resid
(12 missing values generated)

. regress gmwage_12 t tsq

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(2, 596)       =      0.49
       Model |  .001080844         2  .000540422   Prob > F        =    0.6157
    Residual |  .663654581       596  .001113514   R-squared       =    0.0016
-------------+----------------------------------   Adj R-squared   =   -0.0017
       Total |  .664735426       598  .001111598   Root MSE        =    .03337

------------------------------------------------------------------------------
   gmwage_12 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -.0000198   .0000329    -0.60   0.546    -.0000844    .0000447
         tsq |   2.03e-08   5.10e-08     0.40   0.690    -7.98e-08    1.20e-07
       _cons |   .0077391   .0044714     1.73   0.084    -.0010424    .0165207
------------------------------------------------------------------------------

. predict residx12, resid
(13 missing values generated)

. regress yresid wresid residx_0 residx_1 residx2 residx3 residx4 residx5 residx6 residx7 residx8 residx9 re
> sidx10 residx11 residx12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(14, 584)      =     20.52
       Model |  .016967247        14  .001211946   Prob > F        =    0.0000
    Residual |  .034500311       584  .000059076   R-squared       =    0.3297
-------------+----------------------------------   Adj R-squared   =    0.3136
       Total |  .051467557       598  .000086066   Root MSE        =    .00769

------------------------------------------------------------------------------
      yresid |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      wresid |   .0993384   .0966264     1.03   0.304    -.0904392    .2891159
    residx_0 |   .1506661   .0094369    15.97   0.000     .1321317    .1692005
    residx_1 |  -.0021817   .0094589    -0.23   0.818    -.0207592    .0163959
     residx2 |   .0023317   .0094255     0.25   0.805    -.0161804    .0208438
     residx3 |   -.016454   .0094796    -1.74   0.083    -.0350722    .0021642
     residx4 |  -.0037676    .009556    -0.39   0.694    -.0225359    .0150007
     residx5 |  -.0045768   .0096112    -0.48   0.634    -.0234535    .0142999
     residx6 |   .0038496   .0095344     0.40   0.687    -.0148762    .0225754
     residx7 |   .0012691   .0094834     0.13   0.894    -.0173567     .019895
     residx8 |   .0208891   .0094927     2.20   0.028     .0022452    .0395331
     residx9 |   .0205165   .0094864     2.16   0.031     .0018849    .0391481
    residx10 |   .0141759   .0095241     1.49   0.137    -.0045299    .0328816
    residx11 |   .0182966   .0095844     1.91   0.057    -.0005274    .0371206
    residx12 |   .0203153   .0095828     2.12   0.034     .0014943    .0391363
       _cons |  -.0000649   .0003144    -0.21   0.836    -.0006825    .0005527
------------------------------------------------------------------------------

. 
. /*      Run the regression of gemp232 on gmwage, gcpi. Does minimum wage growth appear to have a contempor
> aneous effect on gemp232? */
. 
. /*Employment Regression*/
. 
. regress gemp232 gmwage gcpi

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(2, 608)       =      0.00
       Model |  2.6313e-06         2  1.3156e-06   Prob > F        =    0.9962
    Residual |  .211822784       608  .000348393   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0033
       Total |  .211825415       610  .000347255   Root MSE        =    .01867

------------------------------------------------------------------------------
     gemp232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |  -.0018752   .0227897    -0.08   0.934    -.0466312    .0428808
        gcpi |  -.0054697   .1938073    -0.03   0.977    -.3860828    .3751433
       _cons |  -.0004429   .0009941    -0.45   0.656    -.0023953    .0015094
------------------------------------------------------------------------------

. /*The minimum wage does not seem to have a statistically sign 
> effect on employment contemporaneously since the coefficients are small in 
> magnitude and the pvalues are insignificant and the adj r2 is actually
> negative *//*
> 
> 4.      Add lags 1-12 to the employment growth equation in (3). Does growth in the minimum wage have a sta
> tistically significant effect on employment growth, either in the short or long run? Explain. 
> 
> */
. regress gemp232 gcpi gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwage
> _9 gmwage_10 gmwage_11 gmwage_12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(14, 584)      =      0.94
       Model |  .004563835        14  .000325988   Prob > F        =    0.5098
    Residual |   .20150455       584  .000345042   R-squared       =    0.0221
-------------+----------------------------------   Adj R-squared   =   -0.0013
       Total |  .206068385       598  .000344596   Root MSE        =    .01858

------------------------------------------------------------------------------
     gemp232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gcpi |  -.1143189   .2126672    -0.54   0.591    -.5320047    .3033669
      gmwage |  -.0042524   .0227668    -0.19   0.852    -.0489672    .0404625
    gmwage_1 |   .0131872   .0227662     0.58   0.563    -.0315265    .0579009
    gmwage_2 |  -.0310154   .0227237    -1.36   0.173    -.0756456    .0136148
    gmwage_3 |  -.0056972   .0228003    -0.25   0.803    -.0504778    .0390833
    gmwage_4 |  -.0013479   .0229603    -0.06   0.953    -.0464426    .0437468
    gmwage_5 |   .0023392   .0230567     0.10   0.919     -.042945    .0476233
    gmwage_6 |   .0454017   .0229259     1.98   0.048     .0003744     .090429
    gmwage_7 |   .0275713   .0228472     1.21   0.228    -.0173015    .0724441
    gmwage_8 |  -.0173222   .0228614    -0.76   0.449    -.0622228    .0275785
    gmwage_9 |   -.024838   .0228527    -1.09   0.278    -.0697214    .0200455
   gmwage_10 |  -.0230005   .0229137    -1.00   0.316    -.0680038    .0220028
   gmwage_11 |   .0102054   .0230191     0.44   0.658    -.0350049    .0554156
   gmwage_12 |   .0345125   .0230401     1.50   0.135     -.010739     .079764
       _cons |  -.0002012    .001027    -0.20   0.845    -.0022182    .0018158
------------------------------------------------------------------------------

. 
. /*The short run propensity is not significant and equal to -.0042524  */
. 
. test gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwage_9 gmwage_10 gmw
> age_11 gmwage_12

 ( 1)  gmwage = 0
 ( 2)  gmwage_1 = 0
 ( 3)  gmwage_2 = 0
 ( 4)  gmwage_3 = 0
 ( 5)  gmwage_4 = 0
 ( 6)  gmwage_5 = 0
 ( 7)  gmwage_6 = 0
 ( 8)  gmwage_7 = 0
 ( 9)  gmwage_8 = 0
 (10)  gmwage_9 = 0
 (11)  gmwage_10 = 0
 (12)  gmwage_11 = 0
 (13)  gmwage_12 = 0

       F( 13,   584) =    1.01
            Prob > F =    0.4387

. /*the effect of the lagged growth in the minimum wage on gemp232 are not 
> jointly or individually significant. */
. 
. estimates store gmwage

. coefplot gmwage

. /*The coefplot doesn't show any large differences in magnitude between the 
> coefficients*/
. regress gemp232 gcpi gmwage sub1 sub2 sub3 sub4 sub5 sub6 sub7 sub8 sub9 sub10 sub11 sub12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(14, 584)      =      0.94
       Model |  .004563835        14  .000325988   Prob > F        =    0.5098
    Residual |   .20150455       584  .000345042   R-squared       =    0.0221
-------------+----------------------------------   Adj R-squared   =   -0.0013
       Total |  .206068385       598  .000344596   Root MSE        =    .01858

------------------------------------------------------------------------------
     gemp232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gcpi |  -.1143189   .2126672    -0.54   0.591    -.5320047    .3033669
      gmwage |   .0257437   .0925391     0.28   0.781    -.1560063    .2074936
        sub1 |   .0131872   .0227662     0.58   0.563    -.0315265    .0579009
        sub2 |  -.0310154   .0227237    -1.36   0.173    -.0756456    .0136148
        sub3 |  -.0056972   .0228003    -0.25   0.803    -.0504778    .0390833
        sub4 |  -.0013479   .0229603    -0.06   0.953    -.0464426    .0437468
        sub5 |   .0023392   .0230567     0.10   0.919     -.042945    .0476233
        sub6 |   .0454017   .0229259     1.98   0.048     .0003744     .090429
        sub7 |   .0275713   .0228472     1.21   0.228    -.0173015    .0724441
        sub8 |  -.0173222   .0228614    -0.76   0.449    -.0622228    .0275785
        sub9 |   -.024838   .0228527    -1.09   0.278    -.0697214    .0200455
       sub10 |  -.0230005   .0229137    -1.00   0.316    -.0680038    .0220028
       sub11 |   .0102054   .0230191     0.44   0.658    -.0350049    .0554156
       sub12 |   .0345125   .0230401     1.50   0.135     -.010739     .079764
       _cons |  -.0002012    .001027    -0.20   0.845    -.0022182    .0018158
------------------------------------------------------------------------------

. /*The long run propensity is not significant and equal to .0257437 therefore, it is unlikely
> that minimum wage changes impact employment growth in sector 232*/
. 
. /*Detrend*/
. regress gemp232 gcpi gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwage
> _9 gmwage_10 gmwage_11 gmwage_12 t tsq

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(16, 582)      =      1.21
       Model |  .006614522        16  .000413408   Prob > F        =    0.2577
    Residual |  .199453862       582  .000342704   R-squared       =    0.0321
-------------+----------------------------------   Adj R-squared   =    0.0055
       Total |  .206068385       598  .000344596   Root MSE        =    .01851

------------------------------------------------------------------------------
     gemp232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gcpi |  -.0847628   .2352004    -0.36   0.719    -.5467077    .3771822
      gmwage |  -.0054057   .0227332    -0.24   0.812    -.0500548    .0392435
    gmwage_1 |   .0117273   .0227911     0.51   0.607    -.0330356    .0564901
    gmwage_2 |  -.0323242   .0227061    -1.42   0.155    -.0769201    .0122718
    gmwage_3 |    -.00719   .0228413    -0.31   0.753    -.0520515    .0376714
    gmwage_4 |  -.0034907   .0230273    -0.15   0.880    -.0487174    .0417359
    gmwage_5 |   .0000897   .0231631     0.00   0.997    -.0454039    .0455832
    gmwage_6 |   .0433251    .022972     1.89   0.060    -.0017931    .0884433
    gmwage_7 |   .0256682    .022845     1.12   0.262    -.0192004    .0705368
    gmwage_8 |  -.0192307   .0228676    -0.84   0.401    -.0641438    .0256824
    gmwage_9 |  -.0267043   .0228516    -1.17   0.243    -.0715859    .0181773
   gmwage_10 |  -.0249613   .0229446    -1.09   0.277    -.0700255    .0201029
   gmwage_11 |   .0081467   .0230925     0.35   0.724    -.0372082    .0535015
   gmwage_12 |   .0326153   .0230865     1.41   0.158    -.0127277    .0779582
           t |   .0000117   .0000201     0.58   0.561    -.0000278    .0000512
         tsq |  -3.37e-08   3.04e-08    -1.11   0.268    -9.35e-08    2.61e-08
       _cons |   .0004514   .0026499     0.17   0.865    -.0047532     .005656
------------------------------------------------------------------------------

. regress gemp232 gcpi gmwage sub1 sub2 sub3 sub4 sub5 sub6 sub7 sub8 sub9 sub10 sub11 sub12 t tsq

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(16, 582)      =      1.21
       Model |  .006614522        16  .000413408   Prob > F        =    0.2577
    Residual |  .199453862       582  .000342704   R-squared       =    0.0321
-------------+----------------------------------   Adj R-squared   =    0.0055
       Total |  .206068385       598  .000344596   Root MSE        =    .01851

------------------------------------------------------------------------------
     gemp232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gcpi |  -.0847628   .2352004    -0.36   0.719    -.5467077    .3771822
      gmwage |   .0022652   .0964756     0.02   0.981    -.1872175    .1917479
        sub1 |   .0117273   .0227911     0.51   0.607    -.0330356    .0564901
        sub2 |  -.0323242   .0227061    -1.42   0.155    -.0769201    .0122718
        sub3 |    -.00719   .0228413    -0.31   0.753    -.0520515    .0376714
        sub4 |  -.0034907   .0230273    -0.15   0.880    -.0487174    .0417359
        sub5 |   .0000897   .0231631     0.00   0.997    -.0454039    .0455832
        sub6 |   .0433251    .022972     1.89   0.060    -.0017931    .0884433
        sub7 |   .0256682    .022845     1.12   0.262    -.0192004    .0705368
        sub8 |  -.0192307   .0228676    -0.84   0.401    -.0641438    .0256824
        sub9 |  -.0267043   .0228516    -1.17   0.243    -.0715859    .0181773
       sub10 |  -.0249613   .0229446    -1.09   0.277    -.0700255    .0201029
       sub11 |   .0081467   .0230925     0.35   0.724    -.0372082    .0535015
       sub12 |   .0326153   .0230865     1.41   0.158    -.0127277    .0779582
           t |   .0000117   .0000201     0.58   0.561    -.0000278    .0000512
         tsq |  -3.37e-08   3.04e-08    -1.11   0.268    -9.35e-08    2.61e-08
       _cons |   .0004514   .0026499     0.17   0.865    -.0047532     .005656
------------------------------------------------------------------------------

. regress gemp232 t tsq

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(2, 608)       =      3.07
       Model |   .00211858         2   .00105929   Prob > F        =    0.0471
    Residual |  .209706836       608  .000344913   R-squared       =    0.0100
-------------+----------------------------------   Adj R-squared   =    0.0067
       Total |  .211825415       610  .000347255   Root MSE        =    .01857

------------------------------------------------------------------------------
     gemp232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   .0000109   .0000171     0.64   0.524    -.0000227    .0000445
         tsq |  -3.28e-08   2.70e-08    -1.21   0.226    -8.58e-08    2.03e-08
       _cons |   .0002891   .0022762     0.13   0.899    -.0041811    .0047593
------------------------------------------------------------------------------

. predict yresidemp, resid
(1 missing value generated)

. regress yresidemp wresid residx_0 residx_1 residx2 residx3 residx4 residx5 residx6 residx7 residx8 residx9
>  residx10 residx11 residx12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(14, 584)      =      0.94
       Model |  .004487357        14  .000320526   Prob > F        =    0.5166
    Residual |  .199454812       584  .000341532   R-squared       =    0.0220
-------------+----------------------------------   Adj R-squared   =   -0.0014
       Total |  .203942169       598   .00034104   Root MSE        =    .01848

------------------------------------------------------------------------------
   yresidemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      wresid |  -.0865443   .2323307    -0.37   0.710    -.5428498    .3697611
    residx_0 |  -.0053833   .0226903    -0.24   0.813    -.0499478    .0391813
    residx_1 |   .0117607   .0227432     0.52   0.605    -.0329077    .0564291
     residx2 |   -.032301    .022663    -1.43   0.155    -.0768119    .0122099
     residx3 |  -.0071558   .0227929    -0.31   0.754    -.0519217    .0376102
     residx4 |  -.0034531   .0229767    -0.15   0.881    -.0485802    .0416739
     residx5 |   .0001322   .0231093     0.01   0.995    -.0452553    .0455196
     residx6 |   .0433571   .0229246     1.89   0.059    -.0016676    .0883818
     residx7 |   .0256896   .0228022     1.13   0.260    -.0190947     .070474
     residx8 |  -.0192083   .0228245    -0.84   0.400    -.0640363    .0256197
     residx9 |  -.0266843   .0228093    -1.17   0.243    -.0714826    .0181139
    residx10 |  -.0249356   .0229001    -1.09   0.277    -.0699121    .0200409
    residx11 |   .0081789   .0230448     0.35   0.723     -.037082    .0534397
    residx12 |   .0326425   .0230411     1.42   0.157    -.0126111     .077896
       _cons |   .0000101   .0007561     0.01   0.989    -.0014748     .001495
------------------------------------------------------------------------------

. 
. /*Detrending doesn't have much of an effect on the significance of the regression*/
. 
. /*Part II*/
. clear all 

. use "C:\Users\dray\Downloads\matching_earnings.dta"

. /*
> 1.      Estimate the first difference model controlling for AGE, EDUC, and MARR, and interpret
>  the coefficient on TREAT.*/
. sort TREAT 

. gen id = _n

. regress REDIFF TREAT

      Source |       SS           df       MS      Number of obs   =     2,675
-------------+----------------------------------   F(1, 2673)      =      8.17
       Model |   932084653         1   932084653   Prob > F        =    0.0043
    Residual |  3.0489e+11     2,673   114063301   R-squared       =    0.0030
-------------+----------------------------------   Adj R-squared   =    0.0027
       Total |  3.0582e+11     2,674   114369218   Root MSE        =     10680

------------------------------------------------------------------------------
      REDIFF |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       TREAT |   2326.505   813.8593     2.86   0.004     730.6477    3922.363
       _cons |   2490.585   214.0293    11.64   0.000     2070.905    2910.264
------------------------------------------------------------------------------

. /*effect of treatment leads to an increase in earnings. 
> and the pvalue is significant at the .01 level*/
. /*
> 2.      Now estimate your propensity score matching model using one-to-one nearest neighbor 
> matching with replacement. Don’t forget to set your random seed! */
. set seed 123456

. gen u = uniform()

. sort u

. probit TREAT AGE EDUC MARR RE75

Iteration 0:   log likelihood = -672.64954  
Iteration 1:   log likelihood =  -406.0335  
Iteration 2:   log likelihood = -298.02155  
Iteration 3:   log likelihood = -290.34686  
Iteration 4:   log likelihood = -290.23166  
Iteration 5:   log likelihood =  -290.2315  
Iteration 6:   log likelihood =  -290.2315  

Probit regression                               Number of obs     =      2,675
                                                LR chi2(4)        =     764.84
                                                Prob > chi2       =     0.0000
Log likelihood =  -290.2315                     Pseudo R2         =     0.5685

------------------------------------------------------------------------------
       TREAT |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         AGE |  -.0498931    .007052    -7.07   0.000    -.0637149   -.0360713
        EDUC |  -.1226482   .0230197    -5.33   0.000    -.1677659   -.0775305
        MARR |  -1.119318   .1224381    -9.14   0.000    -1.359292   -.8793437
        RE75 |  -.0001484   .0000133   -11.17   0.000    -.0001744   -.0001224
       _cons |   3.021714   .3787173     7.98   0.000     2.279441    3.763986
------------------------------------------------------------------------------
Note: 428 failures and 0 successes completely determined.

. predict pscorea
(option pr assumed; Pr(TREAT))

. 
. histogram pscorea, start(0.0) width(0.05) by(TREAT, col(1))

. 
. browse TREAT pscorea

. gen p1 = 1 if pscorea>.5
(2,522 missing values generated)

. replace p1 = 0 if pscorea<.5
(2,522 real changes made)

. tab TREAT p1

           |          p1
     TREAT |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,455         35 |     2,490 
         1 |        67        118 |       185 
-----------+----------------------+----------
     Total |     2,522        153 |     2,675 


. 
. psmatch2 TREAT, outcome(RE78) pscore(pscorea) n(1) common
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched | 6349.14537   21553.9213  -15204.7759   1154.61435   -13.17
                        ATT |  6383.6516   5559.26807   824.383528   1635.02107     0.50
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |         1        184 |       185 
-----------+----------------------+----------
     Total |         1      2,674 |     2,675 


. /*      Does participation in the program appear to be randomly assigned? How would you test this? */
. /*To test for random assignment, we need to construct counterfactuals of untreated outcomes
> for treated observations. The counterfactual is a weighted average of the observed untreated outcomes.
> */
. histogram pscorea, start(0.0) width(0.05) by(TREAT, col(1))

. /* We show a poor common support problem in the histogram - we can use the "common" command to
> concentrate on the overalapping populations although when we do this we 
> will possibly throw out useful information for people near the boundaries and it might
> be unclear what we are estimating.
> In the histogram it looks like some of the participants might be more likely to be in the treatment group 
> than others meaning the treatment group
> may not be completely randomly assigned.*/
. ttest RE78, by(TREAT)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,490    21553.92     311.731    15555.35    20942.64     22165.2
       1 |     185    6349.145    578.4231    7867.405    5207.951     7490.34
---------+--------------------------------------------------------------------
combined |   2,675    20502.38    302.2505    15632.52    19909.71    21095.04
---------+--------------------------------------------------------------------
    diff |            15204.78    1154.614                12940.75     17468.8
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  13.1687
Ho: diff = 0                                     degrees of freedom =     2673

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. reg RE78 TREAT

      Source |       SS           df       MS      Number of obs   =     2,675
-------------+----------------------------------   F(1, 2673)      =    173.41
       Model |  3.9811e+10         1  3.9811e+10   Prob > F        =    0.0000
    Residual |  6.1365e+11     2,673   229573201   R-squared       =    0.0609
-------------+----------------------------------   Adj R-squared   =    0.0606
       Total |  6.5346e+11     2,674   244375675   Root MSE        =     15152

------------------------------------------------------------------------------
        RE78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       TREAT |  -15204.78   1154.614   -13.17   0.000     -17468.8   -12940.75
       _cons |   21553.92   303.6414    70.98   0.000     20958.53    22149.32
------------------------------------------------------------------------------

. bysort TREAT: sum RE78

------------------------------------------------------------------------------------------------------------
-> TREAT = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        RE78 |      2,490    21553.92    15555.35          0     121174

------------------------------------------------------------------------------------------------------------
-> TREAT = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        RE78 |        185    6349.145    7867.405          0    60307.9


. /*Income is a determining factor of being in the treatment group
>  but we only really need random assignment within the treatment group*/
. 
. /*How many unique control subjects were matched to the treated? 
> How many control subjects were matched more than once? */
. tab _weight TREAT

 psmatch2: |
 weight of |
   matched |         TREAT
  controls |         0          1 |     Total
-----------+----------------------+----------
         1 |        45        184 |       229 
         2 |        16          0 |        16 
         3 |         2          0 |         2 
         4 |         4          0 |         4 
         5 |         4          0 |         4 
         6 |         2          0 |         2 
         7 |         2          0 |         2 
        10 |         1          0 |         1 
        11 |         1          0 |         1 
        18 |         1          0 |         1 
-----------+----------------------+----------
     Total |        78        184 |       262 


. 
. /*78 CONTROLS WERE MATCHED, 44 WERE MATCHED MORE THAN ONCE, AND 45 WERE 
> MATCHED ONLY ONCE.*/
. 
. /*      Repeat propensity score matching, but now with no replacement. How did the results change?*/
. 
. psmatch2 TREAT, outcome(RE78) pscore(pscorea) n(1) common noreplacement
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched | 6349.14537   21553.9213  -15204.7759   1154.61435   -13.17
                        ATT |  6383.6516   8950.55633  -2566.90474   1075.18652    -2.39
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |         1        184 |       185 
-----------+----------------------+----------
     Total |         1      2,674 |     2,675 


. tab _weight TREAT

 psmatch2: |
 weight of |
   matched |         TREAT
  controls |         0          1 |     Total
-----------+----------------------+----------
         1 |       184        184 |       368 
-----------+----------------------+----------
     Total |       184        184 |       368 


. /*no replacement has a negative ATT difference btwn treated and controls.
>  the ATT for controls increased and SE of ATT for controls decreased and 
>  184 controls were matched to 184 treated. */
.  
. /*      Repeat propensity score matching with replacement, but now use 2 matches for each treated subject.
>   How did the results change?*/
. psmatch2 TREAT, outcome(RE78) pscore(pscorea) n(2) common
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            RE78  Unmatched | 6349.14537   21553.9213  -15204.7759   1154.61435   -13.17
                        ATT |  6383.6516   5817.44812    566.20348   1431.58995     0.40
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |         1        184 |       185 
-----------+----------------------+----------
     Total |         1      2,674 |     2,675 


. 
. /*from noreplacement, the control ATT decreased and the standard error increased. 
> From 1 match, the SE decreased while the ATT increased. no replacement has a negative ATT
> difference between treated and controls. the difference is greater on use 1 match
> per treated subject rather than 2. */ 
. 
. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\dray\AppData\Local\Microsoft\Windows\INetCache\problemset4.log
  log type:  text
 closed on:   8 Nov 2018, 13:22:31
------------------------------------------------------------------------------------------------------------
