--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\faith\documents\ps1_ray.log
  log type:  text
 opened on:  17 Dec 2018, 18:26:26

. 
. /* ************************************************************************** */
. /* LOG FILE for problem set 1 *********************************************** */
. /* Debra Ray ******************************************************* */
. /* ************************************************************************** */
. 
. 
. /* ************************************************************************** */
. /* ****************************** QUESTION 1 ******************************** */
. /* ************************************************************************** */
. 
. 
. /*(a) What is the eﬀect of ﬁnancing college using scholarships instead of student 
> loans on the wages of college graduates?
> 
> i. What is the outcome variable and what is the treatment?
>         The outcome variable is wages, and the treatment variable is using scholarships
>         to finance college rather than student loans. 
> 
> ii. Deﬁne, in words, the counterfactual outcomes Y0i and Y1i.
> 
>         The counterfactual outcome for the control group, Y0i, would be the outcome, wages 
>         if the observational unit in the control group was instead treated with a scholarship 
>         to finance college. The counterfactual outcome for the treatment group, Y1i, would be 
>         the outcome, wages, given that the observational units in the treatment group were instead 
>         not treated with the scholarship and, instead, used student loans to pay for college. In other 
>         words, it would be the unobserved outcomes had the treated not been treated and the 
>         control had been treated instead. 
> 
> iii. What plausible causal channel(s) (ie, a causal mechanism) runs directly from 
> the treatment to the outcome?
> 
>         1) Students treated with a scholarship may have higher graduation rates than the 
>         control group, or may graduate faster than the control group.
> 
>         2) A scholarship would reduce debt burdens of treated students.
>         Lower debt burdens means the treated students can take short-term, lower paying jobs 
>         and internships with large companies with high networking benefits. Being able to 
>         take those jobs and internships may lead to higher pay later than the control group.
> 
> iv. What are possible sources of selection bias in the raw comparison of outcomes 
> by treatment status?
> 
>         If assignment isn't random:
> 
>         1) Merit-based scholarships are linked to student 
>         GPA in high school and SAT scores - which might be correlated with performance in
>         college and later performance in the workforce. 
> 
>         2) Likewise, need-based scholarships would select students with lower income to start with 
>         and are less priviledged. This group may have lower potential income outcomes to 
>         start with through less family networks to help find high paying jobs or less skills to 
>         compete in the job market because their parents didn't have those skills to teach them.
> 
> (b) What is the eﬀect of having health insurance on obesity?
> 
> i. What is the outcome variable and what is the treatment?
>         Health insurance is the treatment variable and the outcome variable is weight/bmi/obesity. 
> 
> ii. Deﬁne, in words, the counterfactual outcomes Y0i and Y1i.
>         The counterfactual for the control group, Y0i, is the outcome, weight/bmi/obseity, 
>         given that these observations were instead treated. The counterfactual for the treatment group, 
>         Y1i, is the outcome, weight/bmi/obesity, if the treatment group were instead not treated.
> 
> iii. What plausible causal channel(s) (ie, a causal mechanism) runs directly from 
> the treatment to the outcome?
> 
>         Treated observations may have greater access to care to treat the causes of the 
>         obesity. Sometimes, the weight gain is caused by a health condition or habits 
>         which a doctor can help treat.
> 
> iv. What are possible sources of selection bias in the raw comparison of outcomes 
> by treatment status
> 
>         Observations with higher BMIs might have different likelihoods of being in the treatment
>         or control groups given different causes of the higher BMI. Some medications cause 
>         weight gain and those observations with higher BMIs in the treatment group may be
>         more likely to have higher BMIs due to greater access to healthcare.
> 
> (c) What is the eﬀect of attending a ﬁnancial literacy class on retirement savings?
> 
> i. What is the outcome variable and what is the treatment?
> 
>         The outcome variable is retirement savings aand the financial literacy class 
>         is the treatment.
> 
> ii. Deﬁne, in words, the counterfactual outcomes Y0i and Y1i.
> 
>         The couterfactual outcome for the treated observations is the retirement savings 
>         of the treated group given that they were not treated with the financial literacy 
>         class. The counterfactual outcome for the control group is what would have happened 
>         if the control group had been treated.
> 
> iii. What plausible causal channel(s) (ie, a causal mechanism) runs directly from 
> the treatment to the outcome?
> 
>                 A financial literacy class might promote financial decisions which would
>                 increase retirement savings and decrease debt.
> 
> iv. What are possible sources of selection bias in the raw comparison of outcomes 
> by treatment status?
> 
>                 1) Observations with a greater likelihood of saving for retirement might opt to 
>                 take a financial literacy class whereas observations with less interest 
>                 in saving for retirement may not take the class.
>                 
>                 2) Observations which have a lower expected retirement savings may take the class 
>                 versus observations which have a higher expected retirement savings may not
>                 take the class because they have less of a need for it. 
> 
> */
. /* ************************************************************************** */
. /* ****************************** QUESTION 2 ******************************** */
. /* ************************************************************************** */
. 
. /*2. Selection bias (Stata exercise with short answers, 28 points): In this 
> exercise, we will work through how random assignment can address selection bias.*/
. 
. use ps1selectiondta.dta

. 
. /*(a) Suppose that this training program is strictly voluntary, and that only individuals 
> with low experience levels volunteer for the program.  Create a dummy variable for whether 
> or not an individual volunteers for the program by running the following command: */
. 
. gen volunteer = cond(experience<9,1,0)

. 
. /*Then, run a cross-tabulation to verify that the data show that only individuals 
> with less than 9 years of experience participate in the training program. */
. 
. tab experience volunteer

           |       volunteer
experience |         0          1 |     Total
-----------+----------------------+----------
         1 |         0         38 |        38 
         2 |         0        286 |       286 
         3 |         0        158 |       158 
         4 |         0        443 |       443 
         5 |         0        408 |       408 
         6 |         0        673 |       673 
         7 |         0        425 |       425 
         8 |         0        480 |       480 
         9 |       133          0 |       133 
        10 |       113          0 |       113 
        11 |       142          0 |       142 
        12 |        56          0 |        56 
        13 |       134          0 |       134 
        14 |       128          0 |       128 
        15 |        27          0 |        27 
        16 |        80          0 |        80 
        17 |         2          0 |         2 
        18 |        65          0 |        65 
        19 |        35          0 |        35 
        20 |        30          0 |        30 
        21 |        36          0 |        36 
        22 |         8          0 |         8 
        23 |         8          0 |         8 
        25 |         7          0 |         7 
        26 |        85          0 |        85 
-----------+----------------------+----------
     Total |     1,089      2,911 |     4,000 


. 
. /*Using the generate command, create a variable widgets_nonexp according to this 
> data generating process, where only those who volunteer receive training. 
> Verify that the mean of this new variable in the entire dataset is 17.86. */
. 
. gen widgets_nonexp = 10 + 2*volunteer + .75*experience + u

. 
. sum widgets_nonexp

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
widgets_no~p |      4,000    17.86169    3.124795   12.78771   30.48858

. 
. /*According to this data generating process, what is the true eﬀect of training 
> on widget-making capabilities? 
> 
>         The coefficient, 2, represents the true effect of training on widget 
>         making capabilities. The treatment, training, is determined conditional on being
>         a volunteer. Since volunteers only have less than 9 years of experience, all 
>         experience levels are not equally as likely to be in the treatment group and 
>         random selection does not balance out the selection bias between the treatment 
>         and control groups. Experience also influences the outcome variable, widgets produced. 
>         Therefore, the treatment variable is endogenous to experience. If we did not include 
>         experience in the DGP, the equation would suffer from the omitted variables bias. 
>         
>         By controlling for experience, we reduce the correlation between the error term 
>         and the treatment dummy variable and reduce bias in the coeff. on 
>         treatment. 
> */
. 
. /*What is the eﬀect of an additional year of experience? 
> 
>         Each additional year of experience adds .75 more widget making potential to an 
>         observation. 
> 
> */
. /* Therefore, you instead evaluate the impact of this program using the following 
> regression, which omits the variable for experience: reg widgets nonexp volunteer 
> */
. reg widgets_nonexp volunteer

      Source |       SS           df       MS      Number of obs   =     4,000
-------------+----------------------------------   F(1, 3998)      =   3509.58
       Model |  18253.6478         1  18253.6478   Prob > F        =    0.0000
    Residual |  20793.9507     3,998  5.20108822   R-squared       =    0.4675
-------------+----------------------------------   Adj R-squared   =    0.4673
       Total |  39047.5985     3,999   9.7643407   Root MSE        =    2.2806

------------------------------------------------------------------------------
widgets_no~p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   volunteer |   -4.79921   .0810106   -59.24   0.000    -4.958036   -4.640384
       _cons |   21.35431   .0691088   309.00   0.000     21.21882    21.48981
------------------------------------------------------------------------------

. 
. /*Please report the evaluation’s ﬁnding of the eﬀect of the training program on 
> the number widgets produced by each individual. How does your ﬁnding compare to 
> the true eﬀect from your response to (b)? How did selection bias aﬀect your ﬁnding here? 
>         
>         The coeff is now  -4.79921. Compared to b, it shows that the training has the
>         opposite effect and now reduces the number of widgets produced. Because the control group
>         has more experienced widget producers, by not controlling for 
>         experience, the coefficient on volunteer is negative indicating that the treatment 
>         group produces less widgets compared to the control group. In other words, without 
>         making the outcome conditional on experience, the regression does not accurately 
>         predict the counterfactual for the control group. 
> 
> */
. 
. /* You still have a selection problem, in that only inexperienced individuals agree 
> to participate in your experiment. Create a dummy variable for random assignment 
> into treatment or control groups for those who agree to participate by running 
> the following command: gen treatment = randomassignment if volunteer==1 */
. 
. gen treatment = randomassignment if volunteer==1
(1,089 missing values generated)

. 
. /*Use the command ttest to perform a t−test of the equality of means of a few 
> characteristics, by assignment status. */
. 
. ttest experience, by(randomassignment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,017    7.943976    .1144429    5.139747    7.719538    8.168415
       1 |   1,983    7.804337    .1105553    4.923127     7.58752    8.021154
---------+--------------------------------------------------------------------
combined |   4,000     7.87475    .0795847    5.033378     7.71872     8.03078
---------+--------------------------------------------------------------------
    diff |            .1396393    .1591797               -.1724417    .4517204
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.8772
Ho: diff = 0                                     degrees of freedom =     3998

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8098         Pr(|T| > |t|) = 0.3804          Pr(T > t) = 0.1902

. ttest volunteer, by(randomassignment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,017    .7238473    .0099576    .4472041    .7043191    .7433755
       1 |   1,983    .7317196    .0099521    .4431761    .7122019    .7512373
---------+--------------------------------------------------------------------
combined |   4,000      .72775    .0070388    .4451735      .71395      .74155
---------+--------------------------------------------------------------------
    diff |           -.0078723    .0140793               -.0354757     .019731
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.5591
Ho: diff = 0                                     degrees of freedom =     3998

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2880         Pr(|T| > |t|) = 0.5761          Pr(T > t) = 0.7120

. ttest widgets_nonexp, by(randomassignment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,017    17.90681    .0710702    3.191835    17.76743    18.04619
       1 |   1,983    17.81579    .0686089    3.055217    17.68124    17.95035
---------+--------------------------------------------------------------------
combined |   4,000    17.86169    .0494073    3.124795    17.76482    17.95856
---------+--------------------------------------------------------------------
    diff |            .0910181    .0988201               -.1027244    .2847607
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.9210
Ho: diff = 0                                     degrees of freedom =     3998

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8215         Pr(|T| > |t|) = 0.3571          Pr(T > t) = 0.1785

. ttest treatment, by (randomassignment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   1,460           0           0           0           0           0
       1 |   1,451           1           0           0           1           1
---------+--------------------------------------------------------------------
combined |   2,911    .4984541    .0092688    .5000835    .4802802    .5166281
---------+--------------------------------------------------------------------
    diff |                  -1           0                      -1          -1
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =        .
Ho: diff = 0                                     degrees of freedom =     2909

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) =      .         Pr(|T| > |t|) =      .          Pr(T > t) =      .

. 
. 
. ttest experience, by(treatment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   1,460    5.391096    .0501516    1.916289    5.292719    5.489473
       1 |   1,451    5.429359    .0492415    1.875708    5.332767    5.525951
---------+--------------------------------------------------------------------
combined |   2,911    5.410168    .0351402    1.895941    5.341266     5.47907
---------+--------------------------------------------------------------------
    diff |           -.0382632    .0702891               -.1760847    .0995583
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.5444
Ho: diff = 0                                     degrees of freedom =     2909

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2931         Pr(|T| > |t|) = 0.5862          Pr(T > t) = 0.7069

. ttest volunteer, by(treatment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   1,460           1           0           0           1           1
       1 |   1,451           1           0           0           1           1
---------+--------------------------------------------------------------------
combined |   2,911           1           0           0           1           1
---------+--------------------------------------------------------------------
    diff |                   0           0                       0           0
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =        .
Ho: diff = 0                                     degrees of freedom =     2909

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) =      .         Pr(|T| > |t|) =      .          Pr(T > t) =      .

. ttest widgets_nonexp, by(treatment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   1,460    16.54076    .0384259     1.46825    16.46538    16.61613
       1 |   1,451    16.56954    .0378032        1.44    16.49539     16.6437
---------+--------------------------------------------------------------------
combined |   2,911     16.5551    .0269501    1.454059    16.50226    16.60795
---------+--------------------------------------------------------------------
    diff |           -.0287877    .0539071               -.1344877    .0769123
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.5340
Ho: diff = 0                                     degrees of freedom =     2909

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2967         Pr(|T| > |t|) = 0.5934          Pr(T > t) = 0.7033

. 
. /*Verify that the mean of experience is the 
> same for the treatment and control groups, indicating true random assignment. 
> */
. 
. ttest experience, by(randomassignment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,017    7.943976    .1144429    5.139747    7.719538    8.168415
       1 |   1,983    7.804337    .1105553    4.923127     7.58752    8.021154
---------+--------------------------------------------------------------------
combined |   4,000     7.87475    .0795847    5.033378     7.71872     8.03078
---------+--------------------------------------------------------------------
    diff |            .1396393    .1591797               -.1724417    .4517204
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.8772
Ho: diff = 0                                     degrees of freedom =     3998

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8098         Pr(|T| > |t|) = 0.3804          Pr(T > t) = 0.1902

. 
. /*Answer: Yes, the mean is the same for treatment and control.
> 
> Verify also that the selection problem remains: that participants in the experiment 
> have lower experience than non-participants.
> 
> Answer: The ones who participate in the treatment/training have less experience than the 
> group that does not choose to participate and comply with random assignment into treatment. */
. 
. ttest randomassignment, by(treatment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   1,460           0           0           0           0           0
       1 |   1,451           1           0           0           1           1
---------+--------------------------------------------------------------------
combined |   2,911    .4984541    .0092688    .5000835    .4802802    .5166281
---------+--------------------------------------------------------------------
    diff |                  -1           0                      -1          -1
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =        .
Ho: diff = 0                                     degrees of freedom =     2909

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) =      .         Pr(|T| > |t|) =      .          Pr(T > t) =      .

.  
.  /*Again using the generate command, create a variable widgets exp according to 
>  the data generating process from part (b). Be sure to use the treatment variable, 
>  rather than the volunteer variable, to reﬂect that only the treatment group received the training. 
> */ 
. 
. gen widgets_exp = 10 + 2*treatment + .75*experience + u
(1,089 missing values generated)

. 
. 
. /*Verify that the mean of widgets exp among all experimental participants is 15.55.*/
.  sum widgets_exp

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 widgets_exp |      2,911    15.55201    1.772969   10.80306   18.99162

. 
. /*
> 
> As before, the researcher is unable to observe experience. Evaluate the impact 
> of the treatment in this experiment by running the following regression, 
> omitting the variable for experience: reg widgets exp treatment */
. 
. reg widgets_exp treatment

      Source |       SS           df       MS      Number of obs   =     2,911
-------------+----------------------------------   F(1, 2909)      =   1416.38
       Model |  2995.37554         1  2995.37554   Prob > F        =    0.0000
    Residual |  6151.97013     2,909  2.11480582   R-squared       =    0.3275
-------------+----------------------------------   Adj R-squared   =    0.3272
       Total |  9147.34566     2,910  3.14341775   Root MSE        =    1.4542

------------------------------------------------------------------------------
 widgets_exp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |   2.028788   .0539071    37.63   0.000     1.923088    2.134488
       _cons |   14.54076   .0380591   382.06   0.000     14.46613    14.61538
------------------------------------------------------------------------------

. 
. /*Please report the eﬀect of the training program on the number widgets produced by each 
> individual. Why did the experiment result in diﬀerent ﬁndings than (c)? 
> How does your ﬁnding compare to the true eﬀect from the true data generating process in (b)?
> 
> 2.028788, the coefficient on treatment is closer to the data generating process coefficient in b than c
> so the selection bias from omitting experience is now less in absolute value. The selection
> bias has turned positive now rather than being negative.
> 
> */
. 
. /*Clear the data in Stata, and re-load the dataset again. */
. clear all 

. use ps1selectiondta.dta

. 
. 
. /* Repeat the code for the analyses in question (4) parts (a) through (f), 
> but suppose the selection into participation goes in the opposite direction: 
> only those with 9 or more years of experience volunteer. */
. 
. gen volunteer = cond(experience>=9,1,0)

. tab experience volunteer

           |       volunteer
experience |         0          1 |     Total
-----------+----------------------+----------
         1 |        38          0 |        38 
         2 |       286          0 |       286 
         3 |       158          0 |       158 
         4 |       443          0 |       443 
         5 |       408          0 |       408 
         6 |       673          0 |       673 
         7 |       425          0 |       425 
         8 |       480          0 |       480 
         9 |         0        133 |       133 
        10 |         0        113 |       113 
        11 |         0        142 |       142 
        12 |         0         56 |        56 
        13 |         0        134 |       134 
        14 |         0        128 |       128 
        15 |         0         27 |        27 
        16 |         0         80 |        80 
        17 |         0          2 |         2 
        18 |         0         65 |        65 
        19 |         0         35 |        35 
        20 |         0         30 |        30 
        21 |         0         36 |        36 
        22 |         0          8 |         8 
        23 |         0          8 |         8 
        25 |         0          7 |         7 
        26 |         0         85 |        85 
-----------+----------------------+----------
     Total |     2,911      1,089 |     4,000 


. 
. gen widgets_nonexp = 10 + 2*volunteer + .75*experience + u

. 
. sum widgets_nonexp

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
widgets_no~p |      4,000    16.95069    4.532555   10.78771   32.48858

. 
. reg widgets_nonexp volunteer

      Source |       SS           df       MS      Number of obs   =     4,000
-------------+----------------------------------   F(1, 3998)      =  11797.86
       Model |  61361.7157         1  61361.7157   Prob > F        =    0.0000
    Residual |  20793.9506     3,998  5.20108819   R-squared       =    0.7469
-------------+----------------------------------   Adj R-squared   =    0.7468
       Total |  82155.6662     3,999  20.5440526   Root MSE        =    2.2806

------------------------------------------------------------------------------
widgets_no~p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   volunteer |    8.79921   .0810106   108.62   0.000     8.640384    8.958036
       _cons |    14.5551   .0422694   344.34   0.000     14.47223    14.63798
------------------------------------------------------------------------------

. 
. gen treatment = randomassignment if volunteer==1
(2,911 missing values generated)

. 
. ttest experience, by(randomassignment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,017    7.943976    .1144429    5.139747    7.719538    8.168415
       1 |   1,983    7.804337    .1105553    4.923127     7.58752    8.021154
---------+--------------------------------------------------------------------
combined |   4,000     7.87475    .0795847    5.033378     7.71872     8.03078
---------+--------------------------------------------------------------------
    diff |            .1396393    .1591797               -.1724417    .4517204
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.8772
Ho: diff = 0                                     degrees of freedom =     3998

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8098         Pr(|T| > |t|) = 0.3804          Pr(T > t) = 0.1902

. ttest volunteer, by(randomassignment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,017    .2761527    .0099576    .4472041    .2566245    .2956809
       1 |   1,983    .2682804    .0099521    .4431761    .2487627    .2877981
---------+--------------------------------------------------------------------
combined |   4,000      .27225    .0070388    .4451735      .25845      .28605
---------+--------------------------------------------------------------------
    diff |            .0078723    .0140793                -.019731    .0354757
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.5591
Ho: diff = 0                                     degrees of freedom =     3998

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7120         Pr(|T| > |t|) = 0.5761          Pr(T > t) = 0.2880

. ttest widgets_nonexp, by(randomassignment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,017    17.01142    .1027682    4.615423    16.80988    17.21297
       1 |   1,983    16.88892    .0998632    4.446995    16.69307    17.08476
---------+--------------------------------------------------------------------
combined |   4,000    16.95069     .071666    4.532555    16.81018    17.09119
---------+--------------------------------------------------------------------
    diff |            .1225074     .143342               -.1585228    .4035376
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.8547
Ho: diff = 0                                     degrees of freedom =     3998

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8036         Pr(|T| > |t|) = 0.3928          Pr(T > t) = 0.1964

. ttest treatment, by (randomassignment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     557           0           0           0           0           0
       1 |     532           1           0           0           1           1
---------+--------------------------------------------------------------------
combined |   1,089    .4885216    .0151545    .5000979    .4587863    .5182569
---------+--------------------------------------------------------------------
    diff |                  -1           0                      -1          -1
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =        .
Ho: diff = 0                                     degrees of freedom =     1087

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) =      .         Pr(|T| > |t|) =      .          Pr(T > t) =      .

. 
. 
. ttest experience, by(treatment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     557    14.63555    .2083451    4.917122    14.22631    15.04479
       1 |     532    14.28195    .2097623    4.838193    13.86989    14.69402
---------+--------------------------------------------------------------------
combined |   1,089    14.46281    .1478693    4.879687    14.17267    14.75295
---------+--------------------------------------------------------------------
    diff |            .3535927    .2957582               -.2267289    .9339143
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.1955
Ho: diff = 0                                     degrees of freedom =     1087

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8839         Pr(|T| > |t|) = 0.2321          Pr(T > t) = 0.1161

. ttest volunteer, by(treatment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     557           1           0           0           1           1
       1 |     532           1           0           0           1           1
---------+--------------------------------------------------------------------
combined |   1,089           1           0           0           1           1
---------+--------------------------------------------------------------------
    diff |                   0           0                       0           0
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =        .
Ho: diff = 0                                     degrees of freedom =     1087

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) =      .         Pr(|T| > |t|) =      .          Pr(T > t) =      .

. ttest widgets_nonexp, by(treatment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     557     23.4875    .1559039    3.679464    23.18127    23.79373
       1 |     532    23.21487    .1584658    3.655033    22.90358    23.52617
---------+--------------------------------------------------------------------
combined |   1,089    23.35431    .1111636    3.668399     23.1362    23.57243
---------+--------------------------------------------------------------------
    diff |            .2726265    .2223343               -.1636266    .7088796
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.2262
Ho: diff = 0                                     degrees of freedom =     1087

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8898         Pr(|T| > |t|) = 0.2204          Pr(T > t) = 0.1102

. 
. ttest experience, by(randomassignment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,017    7.943976    .1144429    5.139747    7.719538    8.168415
       1 |   1,983    7.804337    .1105553    4.923127     7.58752    8.021154
---------+--------------------------------------------------------------------
combined |   4,000     7.87475    .0795847    5.033378     7.71872     8.03078
---------+--------------------------------------------------------------------
    diff |            .1396393    .1591797               -.1724417    .4517204
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.8772
Ho: diff = 0                                     degrees of freedom =     3998

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8098         Pr(|T| > |t|) = 0.3804          Pr(T > t) = 0.1902

. 
. ttest randomassignment, by(treatment)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     557           0           0           0           0           0
       1 |     532           1           0           0           1           1
---------+--------------------------------------------------------------------
combined |   1,089    .4885216    .0151545    .5000979    .4587863    .5182569
---------+--------------------------------------------------------------------
    diff |                  -1           0                      -1          -1
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =        .
Ho: diff = 0                                     degrees of freedom =     1087

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) =      .         Pr(|T| > |t|) =      .          Pr(T > t) =      .

. 
. gen widgets_exp = 10 + 2*treatment + .75*experience + u
(2,911 missing values generated)

. 
. sum widgets_exp

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 widgets_exp |      1,089    22.33136    3.766272   16.75515   32.48858

. 
. reg widgets_exp treatment

      Source |       SS           df       MS      Number of obs   =     1,089
-------------+----------------------------------   F(1, 1087)      =     60.36
       Model |  811.916651         1  811.916651   Prob > F        =    0.0000
    Residual |  14621.1531     1,087  13.4509228   R-squared       =    0.0526
-------------+----------------------------------   Adj R-squared   =    0.0517
       Total |  15433.0698     1,088  14.1848068   Root MSE        =    3.6675

------------------------------------------------------------------------------
 widgets_exp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |   1.727373   .2223344     7.77   0.000      1.29112    2.163627
       _cons |    21.4875   .1553991   138.27   0.000     21.18258    21.79241
------------------------------------------------------------------------------

. 
. /*How did your results for (c) and (f) change when the selection runs in the opposite direction, and 
> why? 
> 
>         The results for c became largely positive, so the effect from treatment is overestimated.
>         The results for f are underestimated, less than 2 now although not by much - 1.7 */
. 
. 
. /*(h) Stepping back from the data and thinking conceptually about this example, 
> please describe how the treatment might spill over to workers not assigned to 
> the treatment. How would that aﬀect how you interpret the measured treatment 
> eﬀect? Also, how would spillover eﬀects inﬂuence the external validity of the 
> estimated treatment eﬀects from the experiment?
>         
>         The treatment might spill over to the workers not assigned to the treatment 
>         if the experienced workers shared their knowledge gained from the treatment 
>         to the workers in the control group. This would affect how we interpret the 
>         measured treatment effect by closing the gap between the control group's mean from 
>         nontreatment and the control group's counterfactual mean. Essentially, the control group's
>         mean conditional on nontreatment would be overestimated and this would bias
>         the coefficient on treatment - it is a non-interaction problem where the treatment units influence
>         the outcome of the control units.
>         
>         The spillover effects would influence the external validity of the estimated 
>         treatment effects from the experiment by preventing consistent measurement of the 
>         treatment effects. 
>         
>         */
.         
. /* Download the dataset ps1bm.dta from the course website.*/
. clear all

. use "C:\Users\faith\Downloads\ps1bm.dta" 

. 
. 
. /*(a) The dataset includes two dummy variables (0-1 variables) for female and computer skills. 
> Using the tab command or the tabsum command, separately tabulate these two variables 
> by black and display the percentages of each race group that is female, and the 
> percentages of each race group that has computer skills. 
> */
. 
. bysort black: tab computerskills, summarize(female)

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> black = 0

   1=resume |
   mentions |
       some |
   computer |          Summary of female
     skills |        Mean   Std. Dev.       Freq.
------------+------------------------------------
          0 |   .55793991   .49716535         466
          1 |   .81259523   .39033525       1,969
------------+------------------------------------
      Total |   .76386037    .4247962       2,435

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> black = 1

   1=resume |
   mentions |
       some |
   computer |          Summary of female
     skills |        Mean   Std. Dev.       Freq.
------------+------------------------------------
          0 |   .58660508   .49301207         433
          1 |   .81518482   .38824454       2,002
------------+------------------------------------
      Total |   .77453799   .41797206       2,435


. 
. 
. /*Perform t−tests of the quality of means of each of the two attributes, by race group.*/
. 
. ttest computerskills, by(black)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,435    .8086242    .0079736    .3934649    .7929884    .8242601
       1 |   2,435    .8221766    .0077503    .3824426    .8069788    .8373744
---------+--------------------------------------------------------------------
combined |   4,870    .8154004    .0055601    .3880122    .8045001    .8263007
---------+--------------------------------------------------------------------
    diff |           -.0135524    .0111196               -.0353518    .0082471
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.2188
Ho: diff = 0                                     degrees of freedom =     4868

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1115         Pr(|T| > |t|) = 0.2230          Pr(T > t) = 0.8885

. ttest female, by(black)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,435    .7638604    .0086086    .4247962    .7469795    .7807413
       1 |   2,435     .774538    .0084703    .4179721    .7579283    .7911477
---------+--------------------------------------------------------------------
combined |   4,870    .7691992    .0060383    .4213885    .7573613    .7810371
---------+--------------------------------------------------------------------
    diff |           -.0106776     .012077               -.0343539    .0129987
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.8841
Ho: diff = 0                                     degrees of freedom =     4868

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1883         Pr(|T| > |t|) = 0.3767          Pr(T > t) = 0.8117

. 
. /*
> 
> i. The means of female for resumes with white sounding names and for resumes with black sounding names 
>         About 76% of the white group is female and 77% of the black group is female. 
> 
> ii. The diﬀerence in the means between the two groups of resumes 
> 
>         difference =  -.0106776
> 
> iii. The t-statistic for this diﬀerence 
>         tstat =   -0.8841
> 
> iv. The p-value for the null hypothesis that the two means are equal    
>         pvalue = 0.3767 
>         
> 
> v. The means of computerskills for resumes with white sounding names and for resumes with black sounding names 
>         white mean:  .8086242 
>         black mean: .8221766   
> 
> vi. The diﬀerence in the means between the two groups of resumes
>         difference:   -.0135524 
> 
> vii. The t-statistic for this diﬀerence 
>         tstat: -1.2188
> 
> viii. The p-value for the null hypothesis that the two means are equal 
>         pvalue: 0.2230
> 
> ix. Do gender and computer skills appear to be balanced across resumes with black sounding names 
> and resumes with white sounding names? Why or why not? 
> 
>         Yes, the pvalues are not low enough for the means to be statistically different from zero.
> 
> (b) Do a similar cross-tabulation of education and number of jobs previously held
>  (jobsonresume) with black. Note that these two variable have 5 and 7 possible values, respectively.
>  Use the the tab command with the chi2 option to test if education is independent of the
>  black variable, and then do the same for jobsonresume and black. */
. 
.  tab education black, chi2

     0=not |
 reported; |
    1=HSD; |
    2=HSG; |
    3=some |
col; 4=col |         black
         + |         0          1 |     Total
-----------+----------------------+----------
         0 |        18         28 |        46 
         1 |        18         22 |        40 
         2 |       142        132 |       274 
         3 |       513        493 |     1,006 
         4 |     1,744      1,760 |     3,504 
-----------+----------------------+----------
     Total |     2,435      2,435 |     4,870 

          Pearson chi2(4) =   3.4096   Pr = 0.492

.  tab jobsonresume black, chi2 

 number of |
      jobs |
 listed on |         black
    resume |         0          1 |     Total
-----------+----------------------+----------
         1 |        54         56 |       110 
         2 |       347        357 |       704 
         3 |       726        703 |     1,429 
         4 |       800        811 |     1,611 
         5 |       258        275 |       533 
         6 |       243        221 |       464 
         7 |         7         12 |        19 
-----------+----------------------+----------
     Total |     2,435      2,435 |     4,870 

          Pearson chi2(6) =   3.5248   Pr = 0.741

. 
.  /*
> After conducting these analyses, please report the following in the comments of your do-ﬁle: 
> 
> i. The proportion of resumes with black sounding names that have some college or more education 
> (that is, the “some college” category as well as the “college degree and more” category”) */
. 
. di (493+1760)/2435
.92525667

. /*
> ii. The proportion of resumes with white-sounding names that have some college or more education */
. di (513+1744)/2435
.92689938

. /*
> 
> iii. The Pearson chi2 statistic 
> 
> 3.4096
> 
> iv. The p-value for the null hypothesis that the the education and black are independent of each other 
> 
> .492, do not reject null that education and black are independent of eachother
> 
> v. The proportion of resumes with black sounding names that have 5 or more previous jobs */
. 
. di (275+221+12)/2435
.20862423

. /*
> vi. The proportion of resumes with white-sounding names that have 5 or more previous jobs*/
. 
. di (258+243+7)/2435
.20862423

. /*
> vii. The Pearson chi2 statistic 
> 
>         3.5248
> 
> viii. The p-value for the null hypothesis that jobsonresume and black are independent of each other 
> 
>         .741, do not reject null that jobsonresume and black are independent of each other.
> 
> ix. Do the two attributes appear to be balanced across the two groups of resumes? Why or why not? 
> 
>         yes, because the pvalues are too large to reject the null that the attributes are different across the two groups.
> 
> (c) Why do we care about whether these variables on resume characteristics look similar across the 
> two groups of resumes?
> 
>         We care that these variables on resume characteristics look similar because we want to randomly assign 
>         characteristics to names so we can isolate the effect of racial names on the outcome variable, calls 
>         
>         \(d) The outcome variable of interest in this study is call. This indicates whether or not a particular 
>  resume generated a call-back for a job interview. Using tabulations and t-tests, 
>  Do you ﬁnd diﬀerences in call-back rates by race group? */
. tab call black, chi2

1=applican |
     t was |
    called |         black
      back |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,200      2,278 |     4,478 
         1 |       235        157 |       392 
-----------+----------------------+----------
     Total |     2,435      2,435 |     4,870 

          Pearson chi2(1) =  16.8791   Pr = 0.000

. ttest call, by(black)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,435    .0965092    .0059853     .295349    .0847724    .1082461
       1 |   2,435    .0644764    .0049781    .2456501    .0547145    .0742382
---------+--------------------------------------------------------------------
combined |   4,870    .0804928    .0038988    .2720826    .0728493    .0881363
---------+--------------------------------------------------------------------
    diff |            .0320329     .007785                .0167708    .0472949
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   4.1147
Ho: diff = 0                                     degrees of freedom =     4868

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. /*Run a regression of call on black along with the other covariates you have analyzed above and verify that the 
>  eﬀect of black is consistent with what you found through the t-test. 
> */
. reg call black education jobsonresume computerskills female

      Source |       SS           df       MS      Number of obs   =     4,870
-------------+----------------------------------   F(5, 4864)      =      4.50
       Model |  1.65808664         5  .331617328   Prob > F        =    0.0004
    Residual |  358.788731     4,864   .07376413   R-squared       =    0.0046
-------------+----------------------------------   Adj R-squared   =    0.0036
       Total |  360.446817     4,869  .074028921   Root MSE        =     .2716

--------------------------------------------------------------------------------
          call |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         black |  -.0318862   .0077853    -4.10   0.000    -.0471489   -.0166236
     education |  -.0020962   .0055908    -0.37   0.708    -.0130566    .0088643
  jobsonresume |    .001711    .003295     0.52   0.604    -.0047487    .0081706
computerskills |  -.0215888   .0103444    -2.09   0.037    -.0418684   -.0013091
        female |   .0136901   .0095584     1.43   0.152    -.0050486    .0324288
         _cons |   .1048295   .0243745     4.30   0.000     .0570444    .1526146
--------------------------------------------------------------------------------

. /*
> (e) What do you conclude from the results of this experiment? Suppose a councilmember 
> you are advising is considering changing the DC government’s hiring processes to omit names 
> from job applicant resumes. What does this experiment suggest about the potential consequences of such a policy?
> 
> The experiment suggests that names that sound more racially black would receive more call backs
> if their names were omitted from the resume.
> 
> 
>  While in last question we analyzed data from ﬁctitious job applicants, we will now
>  analyze data on real-life individuals. We will use data drawn from the U.S. Current
>  Population Survey (CPS), a large on-going labor market study conducted by the Bureau of 
>  Labor Statistics; our dataset will include data on 8,891 black and white individuals 
>  living in Boston and Chicago in 2001. Download the dataset ps1cps.dta from the course website.
>  
>  */
.  clear all

.  use "C:\Users\faith\Downloads\ps1cps.dta" 

.  
.  /*
> (a) The dataset includes a variable on education, which takes on four possible values, for high
>  school dropouts, high school graduates, some college, and college degree and more. Create a new
>  dummy variable called somecollege that indicates if a respondent has some college or more education
>  (that is, the “some college” category as well as the “college degree and more” category).
> */
.  gen somecollege = cond(education>=3,1,0)

. /*
>  What fraction of the full sample has at least some college education?
>  .6245642 
>  */
.  sum somecollege

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 somecollege |      8,891    .6245642    .4842625          0          1

.  
.  /*) Perform a t-test for whether or not the mean of omecollege is the same for black
>  and white respondents in the sample. */
.  
.  ttest somecollege, by(black)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   7,550    .6419868    .0055178    .4794478    .6311703    .6528032
       1 |   1,341    .5264728    .0136398     .499485    .4997151    .5532305
---------+--------------------------------------------------------------------
combined |   8,891    .6245642    .0051358    .4842625    .6144969    .6346315
---------+--------------------------------------------------------------------
    diff |             .115514     .014299                .0874847    .1435432
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   8.0785
Ho: diff = 0                                     degrees of freedom =     8889

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

.  /*
>  
>  i. What is the mean of this variable for black respondents? 
> .5264728 
>  
>  
>  ii. What is the mean of this variable for white respondents? 
>  .6419868  
>  
>  iii. What is the t-statistic and the p-value of this t-test for the hypothesis that the two means are equal?
>  
>   Pr(|T| > |t|) = 0.0000    t =   8.0785
>  
>  (c) Perform a chi2 test for whether or not education and black are independent of each other. What is the
>  chi2 statistic and the p-value of this test?*/
.  
.  tab education black, chi2

           |         black
 education |         0          1 |     Total
-----------+----------------------+----------
       HSD |       759        221 |       980 
       HSG |     1,944        414 |     2,358 
  some col |     2,017        443 |     2,460 
      col+ |     2,830        263 |     3,093 
-----------+----------------------+----------
     Total |     7,550      1,341 |     8,891 

          Pearson chi2(3) = 174.9348   Pr = 0.000

.  
.  /*   Pearson chi2(3) = 174.9348   Pr = 0.000
> 
> */
.  
. /*d) Do you ﬁnd evidence that education diﬀers for blacks and
>  whites in the CPS data? Explain. 
>  
> Yes, differences in means between the education of the two groups is statistically significant.
>  
>  (e) Calculate the t-statistic for equality of the means in the years of
>  experience (yearsexp).*/
.  ttest yearsexp, by(black)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   7,550    20.99828    .1406383    12.22017    20.72259    21.27397
       1 |   1,341     20.6428    .3398655    12.44576    19.97608    21.30953
---------+--------------------------------------------------------------------
combined |   8,891    20.94466    .1299622    12.25441    20.68991    21.19942
---------+--------------------------------------------------------------------
    diff |            .3554743    .3631457               -.3563752    1.067324
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.9789
Ho: diff = 0                                     degrees of freedom =     8889

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8362         Pr(|T| > |t|) = 0.3277          Pr(T > t) = 0.1638

.  
.  /*
>  Do you ﬁnd evidence that these variables differ sign for whites and blacks?
>  Explain. 
>  No the pvalue is too high.
>    Pr(|T| > |t|) = 0.3277  */
.  
.  /*) Discuss your results from (d) and (e). How do your conclusions for the education and experience 
>  variables diﬀer? Why do we care about whether these variables look similar by race? 
>  
>  It looks like while education is statistically different between the two groups but years of experience is not
>  statistically different. We care about whether these look similar, because if they do not, then there is selection 
>  bias in the characteristic and/or discrimination.
>  
>  (g) Calculate the t-statistic for equality of the means in whether the individual is employed (employed). */
.  
.  ttest employed, by(black)  

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   7,537    .7948786    .0046514    .4038171    .7857605    .8039967
       1 |   1,336    .7035928    .0124987    .4568437    .6790736     .728112
---------+--------------------------------------------------------------------
combined |   8,873    .7811338    .0043898     .413501    .7725288    .7897387
---------+--------------------------------------------------------------------
    diff |            .0912858     .012237                .0672984    .1152732
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   7.4598
Ho: diff = 0                                     degrees of freedom =     8871

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

.  
.  
. /*Do you ﬁnd evidence that this variables diﬀers signiﬁcantly for whites and blacks? 
>   t =   7.4598  Pr(|T| > |t|) = 0.0000  
>   
>   Yes, employment varies significantly by race. 
>   
>  (h) In light of your results for (f) and (g),what do you think you can conclude about
>  racial discrimination in employment from the CPS data? 
>  
>         Unemployment is higher for minorities over Caucasians, and minorities have a harder
>         time finding work. They also have less education on average which makes it more difficult
>         for them to find jobs. 
>         
>  
>  How does an experiment like Bertrand and Mullanaithan (2001) address some of the problems that arise from
>  using CPS data to analyze racial disparities in employment?
>  
>  You cannot tell from the CPS data if the higher unemployment is a result of the selection bias into education 
>  by the Caucasian group or if the higher unemployment is due to race because random assignment of education does 
>  not exist. We cannot isolate the effect of race on unemployment. Bertrand and Mullanaithan randomly assigned 
>  education, experience, and number of jobs on resume so that they could isolate the effect of race. 
>  

end of do-file

. log close
      name:  <unnamed>
       log:  C:\Users\faith\documents\ps1_ray.log
  log type:  text
 closed on:  17 Dec 2018, 18:26:34
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
