---------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\dray\Downloads\question.log
  log type:  text
 opened on:   3 Nov 2018, 16:28:27

. 
. use "C:\Users\dray\Downloads\minwage.dta"

. gen tsq=t^2

. regress gwage232 t tsq

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(2, 608)       =      1.93
       Model |  .000338792         2  .000169396   Prob > F        =    0.1464
    Residual |  .053438907       608  .000087893   R-squared       =    0.0063
-------------+----------------------------------   Adj R-squared   =    0.0030
       Total |  .053777699       610   .00008816   Root MSE        =    .00938

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   .0000169   8.64e-06     1.96   0.051    -6.61e-08    .0000339
         tsq |  -2.64e-08   1.36e-08    -1.94   0.053    -5.32e-08    3.78e-10
       _cons |   .0017361   .0011491     1.51   0.131    -.0005205    .0039927
------------------------------------------------------------------------------

. predict wage_dt, resid
(1 missing value generated)

. regress gmwage t tsq

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(2, 608)       =      0.47
       Model |  .001042495         2  .000521247   Prob > F        =    0.6232
    Residual |  .669765185       608  .001101587   R-squared       =    0.0016
-------------+----------------------------------   Adj R-squared   =   -0.0017
       Total |  .670807679       610  .001099685   Root MSE        =    .03319

------------------------------------------------------------------------------
      gmwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   -.000022   .0000306    -0.72   0.472    -.0000821    .0000381
         tsq |   2.58e-08   4.83e-08     0.53   0.593    -6.90e-08    1.21e-07
       _cons |     .00771   .0040679     1.90   0.059    -.0002788    .0156989
------------------------------------------------------------------------------

. predict xdt
(option xb assumed; fitted values)

. predict xdt2, resid
(1 missing value generated)

. regress gcpi t tsq

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(2, 608)       =     21.71
       Model |  .000618197         2  .000309099   Prob > F        =    0.0000
    Residual |  .008657212       608  .000014239   R-squared       =    0.0666
-------------+----------------------------------   Adj R-squared   =    0.0636
       Total |  .009275409       610  .000015206   Root MSE        =    .00377

------------------------------------------------------------------------------
        gcpi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   .0000215   3.48e-06     6.18   0.000     .0000147    .0000283
         tsq |  -2.97e-08   5.49e-09    -5.42   0.000    -4.05e-08   -1.90e-08
       _cons |   .0004251   .0004625     0.92   0.358    -.0004831    .0013334
------------------------------------------------------------------------------

. predict wdt, resid
(1 missing value generated)

. regress wage_dt xdt2 wdt

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(2, 608)       =    126.27
       Model |  .015682184         2  .007841092   Prob > F        =    0.0000
    Residual |  .037756723       608    .0000621   R-squared       =    0.2935
-------------+----------------------------------   Adj R-squared   =    0.2911
       Total |  .053438907       610  .000087605   Root MSE        =    .00788

------------------------------------------------------------------------------
     wage_dt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        xdt2 |   .1511706   .0096293    15.70   0.000     .1322599    .1700812
         wdt |   .2000724   .0846965     2.36   0.018     .0337392    .3664056
       _cons |   3.92e-12   .0003188     0.00   1.000    -.0006261    .0006261
------------------------------------------------------------------------------

. regress gwage232 gmwage gcpi

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(2, 608)       =    125.80
       Model |  .015739988         2  .007869994   Prob > F        =    0.0000
    Residual |  .038037711       608  .000062562   R-squared       =    0.2927
-------------+----------------------------------   Adj R-squared   =    0.2904
       Total |  .053777699       610   .00008816   Root MSE        =    .00791

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |   .1505714   .0096574    15.59   0.000     .1316055    .1695372
        gcpi |   .2435223    .082128     2.97   0.003     .0822333    .4048112
       _cons |   .0021842   .0004213     5.18   0.000     .0013569    .0030115
------------------------------------------------------------------------------

. regress gwage232 gmwage gcpi, robust

Linear regression                               Number of obs     =        611
                                                F(2, 608)         =      11.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2927
                                                Root MSE          =     .00791

------------------------------------------------------------------------------
             |               Robust
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |   .1505714   .0449981     3.35   0.001     .0622007     .238942
        gcpi |   .2435223   .0905791     2.69   0.007     .0656364    .4214081
       _cons |   .0021842   .0004001     5.46   0.000     .0013985    .0029699
------------------------------------------------------------------------------

. regress gwage232 gcpi gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwage_9
>  gmwage_10 gmwage_11 gmwage_12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(14, 584)      =     20.18
       Model |  .016919577        14  .001208541   Prob > F        =    0.0000
    Residual |  .034967639       584  .000059876   R-squared       =    0.3261
-------------+----------------------------------   Adj R-squared   =    0.3099
       Total |  .051887216       598  .000086768   Root MSE        =    .00774

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gcpi |   .2077567   .0885913     2.35   0.019     .0337602    .3817532
      gmwage |   .1493019    .009484    15.74   0.000     .1306749    .1679289
    gmwage_1 |  -.0043451   .0094838    -0.46   0.647    -.0229716    .0142814
    gmwage_2 |   .0007167   .0094661     0.08   0.940     -.017875    .0193085
    gmwage_3 |  -.0188113    .009498    -1.98   0.048    -.0374656   -.0001569
    gmwage_4 |  -.0062754   .0095646    -0.66   0.512    -.0250606    .0125098
    gmwage_5 |  -.0074584   .0096048    -0.78   0.438    -.0263226    .0114057
    gmwage_6 |   .0015449   .0095503     0.16   0.872    -.0172122    .0203021
    gmwage_7 |  -.0004578   .0095175    -0.05   0.962    -.0191505     .018235
    gmwage_8 |   .0190364   .0095234     2.00   0.046      .000332    .0377407
    gmwage_9 |   .0187524   .0095198     1.97   0.049     .0000552    .0374496
   gmwage_10 |   .0120034   .0095452     1.26   0.209    -.0067437    .0307505
   gmwage_11 |   .0156649   .0095891     1.63   0.103    -.0031685    .0344982
   gmwage_12 |   .0179264   .0095979     1.87   0.062    -.0009242    .0367769
       _cons |   .0020967   .0004278     4.90   0.000     .0012564    .0029369
------------------------------------------------------------------------------

. 
end of do-file

. log close
      name:  <unnamed>
       log:  C:\Users\dray\Downloads\question.log
  log type:  text
 closed on:   3 Nov 2018, 16:28:38
---------------------------------------------------------------------------------------------------------------
