----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mafton/Desktop/studystata.log
  log type:  text
 opened on:  31 Mar 2018, 14:23:33

. pwd
/Users/mafton/Desktop

. cd "/users/mafton/Desktop
/Users/mafton/Desktop

. cd 
/Users/mafton

. cd "/users/mafton/documents/school/Econ 644"
/Users/mafton/Documents/School/Econ 644

. use ceosalary.dta

. describe

Contains data from ceosalary.dta
  obs:           177                          
 vars:            17                          3 Feb 2017 11:28
 size:        11,328                          (_dta has notes)
----------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------
id              str3    %9s                   unique CEO identifier
name            str18   %18s                  CEO name
phone           double  %10.0f                phone number
gender          str1    %9s                   male or female
mstatus         long    %8.0g      maritalstatus
                                              marital status
salary          int     %9.0g                 1990 compensation, $1000s
age             byte    %9.0g                 in years
daybirth        float   %9.0g                 day of birth
monthbirth      float   %9.0g                 month of birth
college         byte    %9.0g                 =1 if attended college
grad            byte    %9.0g                 =1 if attended graduate school
comten          byte    %9.0g                 years with company
ceoten          byte    %9.0g                 years as ceo with company
sales           str5    %9s                   1990 firm sales, millions
profits         int     %9.0g                 1990 profits, millions
mktval          float   %9.0g                 market value, end 1990, mills.
profmarg        float   %9.0g                 profits as % of sales
----------------------------------------------------------------------------------
Sorted by: id

. summarize

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          id |          0
        name |          0
       phone |        177    5.41e+09    2.50e+09   1.01e+09   9.95e+09
      gender |          0
     mstatus |        177     1.99435    .5589883          1          4
-------------+---------------------------------------------------------
      salary |        177    865.8644    587.5893        100       5299
         age |        177    56.42938     8.42189         33         86
    daybirth |        172    15.75581    8.618538          1         31
  monthbirth |        175    6.497143    3.622843          1         12
     college |        177    .9717514    .1661523          0          1
-------------+---------------------------------------------------------
        grad |        177    .5310734    .5004492          0          1
      comten |        177    22.50282    12.29473          2         58
      ceoten |        177    7.954802    7.150826          0         37
       sales |          0
     profits |        177    207.8305    404.4543       -463       2700
-------------+---------------------------------------------------------
      mktval |        177    3600.316    6442.276        387      45400
    profmarg |        177     6.42011    17.86074  -203.0769   47.45763

. list name daybirth if daybirth==.

     +--------------------------+
     |          name   daybirth |
     |--------------------------|
  8. | Melvin Stuart          . |
 26. |    Kamal Cook          . |
112. |   Magee Beach          . |
125. |   Peter Hurst          . |
172. |  Colby Larsen          . |
     +--------------------------+

. gen mis = (daybirth==.)

. browse mis

. summarize mis

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         mis |        177    .0282486    .1661523          0          1

. describe mis

              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------
mis             float   %9.0g                 

. summarize mis, detail

                             mis
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 177
25%            0              0       Sum of Wgt.         177

50%            0                      Mean           .0282486
                        Largest       Std. Dev.      .1661523
75%            0              1
90%            0              1       Variance       .0276066
95%            0              1       Skewness       5.694653
99%            1              1       Kurtosis       33.42907

. count if mis=1
=exp not allowed
r(101);

. count if mis==1
  5

. display 5/177
.02824859

. display 100(5/177)
unknown function 100()
r(133);

. display 100*(5/177)
2.8248588

. recode daybirth (missing=0), generate(daybirth_mz)
(5 differences between daybirth and daybirth_mz)

. list daybirth_mz daybirth if daybirth!=daybirth_mz

     +---------------------+
     | daybir~z   daybirth |
     |---------------------|
  8. |        0          . |
 26. |        0          . |
112. |        0          . |
125. |        0          . |
172. |        0          . |
     +---------------------+

. list name daybirth_mz daybirth if daybirth!=daybirth_mz

     +-------------------------------------+
     |          name   daybir~z   daybirth |
     |-------------------------------------|
  8. | Melvin Stuart          0          . |
 26. |    Kamal Cook          0          . |
112. |   Magee Beach          0          . |
125. |   Peter Hurst          0          . |
172. |  Colby Larsen          0          . |
     +-------------------------------------+

. list name if daybirth==.

     +---------------+
     |          name |
     |---------------|
  8. | Melvin Stuart |
 26. |    Kamal Cook |
112. |   Magee Beach |
125. |   Peter Hurst |
172. |  Colby Larsen |
     +---------------+

. histogram age, width(3) frequency addlabel
(bin=18, start=33, width=3)

. ci means age

    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
         age |        177    56.42938     .633028        55.18008    57.67868

. ttest age==50

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     age |     177    56.42938     .633028     8.42189    55.18008    57.67868
------------------------------------------------------------------------------
    mean = mean(age)                                              t =  10.1565
Ho: mean = 50                                    degrees of freedom =      176

    Ha: mean < 50               Ha: mean != 50                 Ha: mean > 50
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest age==56

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     age |     177    56.42938     .633028     8.42189    55.18008    57.67868
------------------------------------------------------------------------------
    mean = mean(age)                                              t =   0.6783
Ho: mean = 56                                    degrees of freedom =      176

    Ha: mean < 56               Ha: mean != 56                 Ha: mean > 56
 Pr(T < t) = 0.7508         Pr(|T| > |t|) = 0.4985          Pr(T > t) = 0.2492

. ttest age==57

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     age |     177    56.42938     .633028     8.42189    55.18008    57.67868
------------------------------------------------------------------------------
    mean = mean(age)                                              t =  -0.9014
Ho: mean = 57                                    degrees of freedom =      176

    Ha: mean < 57               Ha: mean != 57                 Ha: mean > 57
 Pr(T < t) = 0.1843         Pr(|T| > |t|) = 0.3686          Pr(T > t) = 0.8157

. ttest age==56.42938

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     age |     177    56.42938     .633028     8.42189    55.18008    57.67868
------------------------------------------------------------------------------
    mean = mean(age)                                              t =  -0.0000
Ho: mean = 56.42938                              degrees of freedom =      176

 Ha: mean < 56.42938         Ha: mean != 56.42938          Ha: mean > 56.42938
 Pr(T < t) = 0.5000         Pr(|T| > |t|) = 1.0000          Pr(T > t) = 0.5000

. ttest age==0

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     age |     177    56.42938     .633028     8.42189    55.18008    57.67868
------------------------------------------------------------------------------
    mean = mean(age)                                              t =  89.1420
Ho: mean = 0                                     degrees of freedom =      176

    Ha: mean < 0                 Ha: mean != 0                 Ha: mean > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest age==50

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     age |     177    56.42938     .633028     8.42189    55.18008    57.67868
------------------------------------------------------------------------------
    mean = mean(age)                                              t =  10.1565
Ho: mean = 50                                    degrees of freedom =      176

    Ha: mean < 50               Ha: mean != 50                 Ha: mean > 50
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. corr college age
(obs=177)

             |  college      age
-------------+------------------
     college |   1.0000
         age |  -0.1781   1.0000


. regress college age

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      5.73
       Model |  .154052588         1  .154052588   Prob > F        =    0.0177
    Residual |  4.70470447       175  .026884026   R-squared       =    0.0317
-------------+----------------------------------   Adj R-squared   =    0.0262
       Total |  4.85875706       176  .027606574   Root MSE        =    .16396

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0035129   .0014675    -2.39   0.018    -.0064092   -.0006166
       _cons |   1.169983   .0837228    13.97   0.000     1.004747     1.33522
------------------------------------------------------------------------------

. regress college age mstatus

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =      3.54
       Model |   .18980379         2  .094901895   Prob > F        =    0.0312
    Residual |  4.66895327       174  .026833065   R-squared       =    0.0391
-------------+----------------------------------   Adj R-squared   =    0.0280
       Total |  4.85875706       176  .027606574   Root MSE        =    .16381

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0037573   .0014813    -2.54   0.012     -.006681   -.0008336
     mstatus |   .0257613   .0223182     1.15   0.250    -.0182878    .0698105
       _cons |   1.132398   .0897581    12.62   0.000     .9552427    1.309552
------------------------------------------------------------------------------

. regress ccollege c.age##c.age
variable ccollege not found
r(111);

. regress college c.age##c.age

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =      4.09
       Model |    .2183724         2    .1091862   Prob > F        =    0.0183
    Residual |  4.64038466       174  .026668877   R-squared       =    0.0449
-------------+----------------------------------   Adj R-squared   =    0.0340
       Total |  4.85875706       176  .027606574   Root MSE        =    .16331

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |      .0155   .0123297     1.26   0.210     -.008835    .0398351
             |
 c.age#c.age |  -.0001679   .0001081    -1.55   0.122    -.0003812    .0000455
             |
       _cons |    .643474   .3491328     1.84   0.067    -.0456063    1.332554
------------------------------------------------------------------------------

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of college

         chi2(1)      =   122.66
         Prob > chi2  =   0.0000

. regress college age

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      5.73
       Model |  .154052588         1  .154052588   Prob > F        =    0.0177
    Residual |  4.70470447       175  .026884026   R-squared       =    0.0317
-------------+----------------------------------   Adj R-squared   =    0.0262
       Total |  4.85875706       176  .027606574   Root MSE        =    .16396

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0035129   .0014675    -2.39   0.018    -.0064092   -.0006166
       _cons |   1.169983   .0837228    13.97   0.000     1.004747     1.33522
------------------------------------------------------------------------------

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of college

         chi2(1)      =    84.56
         Prob > chi2  =   0.0000

. regress college age, vce(robust)

Linear regression                               Number of obs     =        177
                                                F(1, 175)         =       2.84
                                                Prob > F          =     0.0938
                                                R-squared         =     0.0317
                                                Root MSE          =     .16396

------------------------------------------------------------------------------
             |               Robust
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0035129    .002085    -1.68   0.094    -.0076279     .000602
       _cons |   1.169983   .1095404    10.68   0.000     .9537931    1.386174
------------------------------------------------------------------------------

. regress college age c.age##c.age
note: age omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =      4.09
       Model |    .2183724         2    .1091862   Prob > F        =    0.0183
    Residual |  4.64038466       174  .026668877   R-squared       =    0.0449
-------------+----------------------------------   Adj R-squared   =    0.0340
       Total |  4.85875706       176  .027606574   Root MSE        =    .16331

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |      .0155   .0123297     1.26   0.210     -.008835    .0398351
         age |          0  (omitted)
             |
 c.age#c.age |  -.0001679   .0001081    -1.55   0.122    -.0003812    .0000455
             |
       _cons |    .643474   .3491328     1.84   0.067    -.0456063    1.332554
------------------------------------------------------------------------------

. regress college c.age##c.age, vce(robust)

Linear regression                               Number of obs     =        177
                                                F(2, 174)         =       2.01
                                                Prob > F          =     0.1373
                                                R-squared         =     0.0449
                                                Root MSE          =     .16331

------------------------------------------------------------------------------
             |               Robust
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |      .0155    .018393     0.84   0.401     -.020802    .0518021
             |
 c.age#c.age |  -.0001679   .0001785    -0.94   0.348    -.0005202    .0001845
             |
       _cons |    .643474    .462564     1.39   0.166    -.2694846    1.556433
------------------------------------------------------------------------------

. clear all

. regress college c.age##c.age, vce(robust)
no variables defined
r(111);

. use ceosalary.dta

. regress college c.age##c.age, vce(robust)

Linear regression                               Number of obs     =        177
                                                F(2, 174)         =       2.01
                                                Prob > F          =     0.1373
                                                R-squared         =     0.0449
                                                Root MSE          =     .16331

------------------------------------------------------------------------------
             |               Robust
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |      .0155    .018393     0.84   0.401     -.020802    .0518021
             |
 c.age#c.age |  -.0001679   .0001785    -0.94   0.348    -.0005202    .0001845
             |
       _cons |    .643474    .462564     1.39   0.166    -.2694846    1.556433
------------------------------------------------------------------------------

. do "/var/folders/ks/zj678rv15j14wrl6l0lwz9dw0000gn/T//SD50722.000000"

. describe

Contains data from ceosalary.dta
  obs:           177                          
 vars:            17                          3 Feb 2017 11:28
 size:        11,328                          (_dta has notes)
----------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------
id              str3    %9s                   unique CEO identifier
name            str18   %18s                  CEO name
phone           double  %10.0f                phone number
gender          str1    %9s                   male or female
mstatus         long    %8.0g      maritalstatus
                                              marital status
salary          int     %9.0g                 1990 compensation, $1000s
age             byte    %9.0g                 in years
daybirth        float   %9.0g                 day of birth
monthbirth      float   %9.0g                 month of birth
college         byte    %9.0g                 =1 if attended college
grad            byte    %9.0g                 =1 if attended graduate school
comten          byte    %9.0g                 years with company
ceoten          byte    %9.0g                 years as ceo with company
sales           str5    %9s                   1990 firm sales, millions
profits         int     %9.0g                 1990 profits, millions
mktval          float   %9.0g                 market value, end 1990, mills.
profmarg        float   %9.0g                 profits as % of sales
----------------------------------------------------------------------------------
Sorted by: id

. /*id, unique ceo identifier*/
. 
. /* (7) Obtain summary statistics for all the variables in the dataset. Which 
> variables in the dataset are string? */
. 
. summarize 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          id |          0
        name |          0
       phone |        177    5.41e+09    2.50e+09   1.01e+09   9.95e+09
      gender |          0
     mstatus |        177     1.99435    .5589883          1          4
-------------+---------------------------------------------------------
      salary |        177    865.8644    587.5893        100       5299
         age |        177    56.42938     8.42189         33         86
    daybirth |        172    15.75581    8.618538          1         31
  monthbirth |        175    6.497143    3.622843          1         12
     college |        177    .9717514    .1661523          0          1
-------------+---------------------------------------------------------
        grad |        177    .5310734    .5004492          0          1
      comten |        177    22.50282    12.29473          2         58
      ceoten |        177    7.954802    7.150826          0         37
       sales |          0
     profits |        177    207.8305    404.4543       -463       2700
-------------+---------------------------------------------------------
      mktval |        177    3600.316    6442.276        387      45400
    profmarg |        177     6.42011    17.86074  -203.0769   47.45763

. /* id, name, gender, sales */
. /* (8) List the CEO names that have missing records for the variable daybirth. *
> /
. list daybirth name if daybirth==.

     +--------------------------+
     | daybirth            name |
     |--------------------------|
  8. |        .   Melvin Stuart |
 26. |        .      Kamal Cook |
112. |        .     Magee Beach |
125. |        .     Peter Hurst |
172. |        .    Colby Larsen |
     +--------------------------+

. 
. 
. /* (9) Create a dummy (indicator) variable named mis which takes the value 1 if
> daybirth is missing, zero otherwise. */
. generate mis = (daybirth==.)

. 
. /* (10) Compute the mean and std. dev. of the variable mis. What percentage of 
> the CEOs in the sample have missing records for daybirth? */
. summarize mis 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         mis |        177    .0282486    .1661523          0          1

. display 100*(5/177)
2.8248588

. 
. /* (11) Create a new variable named daybirth_mz that replaces the missing values
> in datebirth with zeros. */
. recode daybirth (missing = 0), generate(daybirth_mz)
(5 differences between daybirth and daybirth_mz)

. 
. /* (12) List daybirth and daybirth_mz for the observations that have different 
> values for these two variables. */
. list daybirth_mz daybirth if daybirth!=daybirth_mz

     +---------------------+
     | daybir~z   daybirth |
     |---------------------|
  8. |        0          . |
 26. |        0          . |
112. |        0          . |
125. |        0          . |
172. |        0          . |
     +---------------------+

. 
. 
. /* (13) Plot a histogram of the variable age. Use a bin width of 3, plot 
> frequencies, and add height labels to the histogram bars. Later please pdf-print
>  this graph and attach it with your answers. */
. 
. histogram age, width(3) frequency addlabel
(bin=18, start=33, width=3)

. /* (14) Compute a 95% confidence interval for the variable age. Can you claim 
> with 95% confidence that the population mean age is 50? */
. ci means age 

    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
         age |        177    56.42938     .633028        55.18008    57.67868

. ttest age ==50

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     age |     177    56.42938     .633028     8.42189    55.18008    57.67868
------------------------------------------------------------------------------
    mean = mean(age)                                              t =  10.1565
Ho: mean = 50                                    degrees of freedom =      176

    Ha: mean < 50               Ha: mean != 50                 Ha: mean > 50
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. /*No, outside the confidence interval*/
. 
. /* (15) Compute the correlation between college and age. */
. corr college age
(obs=177)

             |  college      age
-------------+------------------
     college |   1.0000
         age |  -0.1781   1.0000


. 
. /* (16) Estimate a regression of college on age by OLS. Interpret the coefficien
> t
>  on age. Is this coefficient statistically significant at the 5% level? */
.  regress college age 

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      5.73
       Model |  .154052588         1  .154052588   Prob > F        =    0.0177
    Residual |  4.70470447       175  .026884026   R-squared       =    0.0317
-------------+----------------------------------   Adj R-squared   =    0.0262
       Total |  4.85875706       176  .027606574   Root MSE        =    .16396

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0035129   .0014675    -2.39   0.018    -.0064092   -.0006166
       _cons |   1.169983   .0837228    13.97   0.000     1.004747     1.33522
------------------------------------------------------------------------------

. /*yes, p = .018*/
. /* (17) Run a Breuch-Pagan test of heteroskedasticity. Does the test detect 
> heteroskedasticity? */
. regress college c.age##c.age

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =      4.09
       Model |    .2183724         2    .1091862   Prob > F        =    0.0183
    Residual |  4.64038466       174  .026668877   R-squared       =    0.0449
-------------+----------------------------------   Adj R-squared   =    0.0340
       Total |  4.85875706       176  .027606574   Root MSE        =    .16331

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |      .0155   .0123297     1.26   0.210     -.008835    .0398351
             |
 c.age#c.age |  -.0001679   .0001081    -1.55   0.122    -.0003812    .0000455
             |
       _cons |    .643474   .3491328     1.84   0.067    -.0456063    1.332554
------------------------------------------------------------------------------

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of college

         chi2(1)      =   122.66
         Prob > chi2  =   0.0000

. /*yes, p <.01*/
. /* (18) Estimate a regression of college on age by Robust-OLS. Does the standard
> error of the age coefficient go up or down? */
. regress college age, vce(robust)

Linear regression                               Number of obs     =        177
                                                F(1, 175)         =       2.84
                                                Prob > F          =     0.0938
                                                R-squared         =     0.0317
                                                Root MSE          =     .16396

------------------------------------------------------------------------------
             |               Robust
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0035129    .002085    -1.68   0.094    -.0076279     .000602
       _cons |   1.169983   .1095404    10.68   0.000     .9537931    1.386174
------------------------------------------------------------------------------

. /* goes up*/
. /* (19) Estimate a regression of college on age by WLS using weights equal to
> 1/(age*(100-age)). Does the age coefficient go up or down? */
.  regress college age [aweight=1/(age*(100-age))]
(sum of wgt is   7.4590e-02)

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      6.39
       Model |  .187262287         1  .187262287   Prob > F        =    0.0124
    Residual |  5.13165586       175  .029323748   R-squared       =    0.0352
-------------+----------------------------------   Adj R-squared   =    0.0297
       Total |  5.31891815       176  .030221126   Root MSE        =    .17124

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   -.003665   .0014503    -2.53   0.012    -.0065274   -.0008027
       _cons |   1.177699   .0835873    14.09   0.000      1.01273    1.342668
------------------------------------------------------------------------------

.  /*down*/
. /* (20) Estimate a regression of college on age and daybirth by OLS. Did the 
> adjusted-R-squared go up or down? Would you keep daybirth in the model? */
. regress college age daybirth

      Source |       SS           df       MS      Number of obs   =       172
-------------+----------------------------------   F(2, 169)       =      2.82
       Model |  .156659294         2  .078329647   Prob > F        =    0.0626
    Residual |  4.69799187       169  .027798768   R-squared       =    0.0323
-------------+----------------------------------   Adj R-squared   =    0.0208
       Total |  4.85465116       171  .028389773   Root MSE        =    .16673

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0035342   .0015087    -2.34   0.020    -.0065124   -.0005559
    daybirth |  -.0003193   .0014832    -0.22   0.830    -.0032473    .0026087
       _cons |    1.17552   .0876295    13.41   0.000      1.00253    1.348509
------------------------------------------------------------------------------

. 
end of do-file

. regress college age [aweight=1/(age*(100*age))]
(sum of wgt is   5.9767e-04)

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      4.31
       Model |  .086544022         1  .086544022   Prob > F        =    0.0393
    Residual |  3.51100888       175  .020062908   R-squared       =    0.0241
-------------+----------------------------------   Adj R-squared   =    0.0185
       Total |   3.5975529       176  .020440642   Root MSE        =    .14164

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0025624   .0012337    -2.08   0.039    -.0049973   -.0001275
       _cons |   1.116925     .06714    16.64   0.000     .9844163    1.249433
------------------------------------------------------------------------------

. regress college c.age##c.age [aweight=1/(age*(100*age))]
(sum of wgt is   5.9767e-04)

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =      3.35
       Model |  .133276936         2  .066638468   Prob > F        =    0.0375
    Residual |  3.46427597       174  .019909632   R-squared       =    0.0370
-------------+----------------------------------   Adj R-squared   =    0.0260
       Total |   3.5975529       176  .020440642   Root MSE        =     .1411

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0139783    .010866     1.29   0.200    -.0074679    .0354245
             |
 c.age#c.age |  -.0001541   .0001006    -1.53   0.127    -.0003527    .0000444
             |
       _cons |   .6846596   .2899628     2.36   0.019     .1123624    1.256957
------------------------------------------------------------------------------

. rvpplot age

. rvp plot ceoten
command rvp is unrecognized
r(199);

. rvpplot ceoten
ceoten is not in the model
r(398);

. rvpplot c.age##c.age
factor variables and time-series operators not allowed
r(101);

. rvpplot age^2
^ invalid name
r(198);

. gen agesq= age^2

. regress salary age agesq

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =      1.28
       Model |  881834.856         2  440917.428   Prob > F        =    0.2803
    Residual |  59884129.9       174  344161.666   R-squared       =    0.0145
-------------+----------------------------------   Adj R-squared   =    0.0032
       Total |  60765964.7       176  345261.163   Root MSE        =    586.65

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   28.28196   44.29268     0.64   0.524    -59.13813    115.7021
       agesq |  -.1786295   .3883109    -0.46   0.646    -.9450353    .5877763
       _cons |  -148.6655   1254.208    -0.12   0.906    -2624.085    2326.754
------------------------------------------------------------------------------

. rvpplot agesq

. twoway (scatter salary agesq)

. regress salary age agesq

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =      1.28
       Model |  881834.856         2  440917.428   Prob > F        =    0.2803
    Residual |  59884129.9       174  344161.666   R-squared       =    0.0145
-------------+----------------------------------   Adj R-squared   =    0.0032
       Total |  60765964.7       176  345261.163   Root MSE        =    586.65

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   28.28196   44.29268     0.64   0.524    -59.13813    115.7021
       agesq |  -.1786295   .3883109    -0.46   0.646    -.9450353    .5877763
       _cons |  -148.6655   1254.208    -0.12   0.906    -2624.085    2326.754
------------------------------------------------------------------------------

. predict fit
(option xb assumed; fitted values)

. scatter salary fit

. scatter agesq fit

. scatter fit agesq

. scatter salary age

. scatter salary age ceoten

. do "/var/folders/ks/zj678rv15j14wrl6l0lwz9dw0000gn/T//SD50722.000000"

. regress college age

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      5.73
       Model |  .154052588         1  .154052588   Prob > F        =    0.0177
    Residual |  4.70470447       175  .026884026   R-squared       =    0.0317
-------------+----------------------------------   Adj R-squared   =    0.0262
       Total |  4.85875706       176  .027606574   Root MSE        =    .16396

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0035129   .0014675    -2.39   0.018    -.0064092   -.0006166
       _cons |   1.169983   .0837228    13.97   0.000     1.004747     1.33522
------------------------------------------------------------------------------

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of college

         chi2(1)      =    84.56
         Prob > chi2  =   0.0000

. 
end of do-file

. regress college age, vce(robust)

Linear regression                               Number of obs     =        177
                                                F(1, 175)         =       2.84
                                                Prob > F          =     0.0938
                                                R-squared         =     0.0317
                                                Root MSE          =     .16396

------------------------------------------------------------------------------
             |               Robust
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0035129    .002085    -1.68   0.094    -.0076279     .000602
       _cons |   1.169983   .1095404    10.68   0.000     .9537931    1.386174
------------------------------------------------------------------------------

. regress college age [aweight 1/(age*(100-age))]
invalid syntax
r(198);

. regress college age [aweight =1/(age*(100-age))]
(sum of wgt is   7.4590e-02)

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      6.39
       Model |  .187262287         1  .187262287   Prob > F        =    0.0124
    Residual |  5.13165586       175  .029323748   R-squared       =    0.0352
-------------+----------------------------------   Adj R-squared   =    0.0297
       Total |  5.31891815       176  .030221126   Root MSE        =    .17124

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   -.003665   .0014503    -2.53   0.012    -.0065274   -.0008027
       _cons |   1.177699   .0835873    14.09   0.000      1.01273    1.342668
------------------------------------------------------------------------------

. regress college age daybirth

      Source |       SS           df       MS      Number of obs   =       172
-------------+----------------------------------   F(2, 169)       =      2.82
       Model |  .156659294         2  .078329647   Prob > F        =    0.0626
    Residual |  4.69799187       169  .027798768   R-squared       =    0.0323
-------------+----------------------------------   Adj R-squared   =    0.0208
       Total |  4.85465116       171  .028389773   Root MSE        =    .16673

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0035342   .0015087    -2.34   0.020    -.0065124   -.0005559
    daybirth |  -.0003193   .0014832    -0.22   0.830    -.0032473    .0026087
       _cons |    1.17552   .0876295    13.41   0.000      1.00253    1.348509
------------------------------------------------------------------------------

. browse mis daybirth_mz

. browse daybirth

. regress college age daybirth_mz

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =      2.90
       Model |  .156621352         2  .078310676   Prob > F        =    0.0578
    Residual |  4.70213571       174  .027023768   R-squared       =    0.0322
-------------+----------------------------------   Adj R-squared   =    0.0211
       Total |  4.85875706       176  .027606574   Root MSE        =    .16439

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0034787   .0014755    -2.36   0.020    -.0063909   -.0005665
 daybirth_mz |   -.000431   .0013979    -0.31   0.758      -.00319     .002328
       _cons |   1.174649   .0852931    13.77   0.000     1.006307    1.342991
------------------------------------------------------------------------------

. regress college age mis daybirth_mz

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(3, 173)       =      1.94
       Model |  .158321859         3  .052773953   Prob > F        =    0.1246
    Residual |   4.7004352       173  .027170146   R-squared       =    0.0326
-------------+----------------------------------   Adj R-squared   =    0.0158
       Total |  4.85875706       176  .027606574   Root MSE        =    .16483

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0034776   .0014795    -2.35   0.020    -.0063978   -.0005574
         mis |   .0195762     .07825     0.25   0.803    -.1348715    .1740238
 daybirth_mz |  -.0003233   .0014663    -0.22   0.826    -.0032174    .0025708
       _cons |   1.172386   .0860006    13.63   0.000     1.002641    1.342132
------------------------------------------------------------------------------

. regress college age monthbirth

      Source |       SS           df       MS      Number of obs   =       175
-------------+----------------------------------   F(2, 172)       =      4.45
       Model |  .239148796         2  .119574398   Prob > F        =    0.0130
    Residual |  4.61799406       172  .026848803   R-squared       =    0.0492
-------------+----------------------------------   Adj R-squared   =    0.0382
       Total |  4.85714286       174  .027914614   Root MSE        =    .16386

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0033116   .0014816    -2.24   0.027     -.006236   -.0003872
  monthbirth |   .0060887   .0034427     1.77   0.079    -.0007067    .0128842
       _cons |   1.118816   .0893606    12.52   0.000      .942431      1.2952
------------------------------------------------------------------------------

. estat ovtest

Ramsey RESET test using powers of the fitted values of college
       Ho:  model has no omitted variables
                 F(3, 169) =      1.65
                  Prob > F =      0.1794

. gen female = (gender==
too few ')' or ']'
r(132);

. gen female = (gender==F)
F not found
r(111);

. gen female = (gender=="F")

. label variable female "1 if female, 0 if male"

. regress college age monthbirth female

      Source |       SS           df       MS      Number of obs   =       175
-------------+----------------------------------   F(3, 171)       =      5.43
       Model |  .422309296         3  .140769765   Prob > F        =    0.0014
    Residual |  4.43483356       171  .025934699   R-squared       =    0.0869
-------------+----------------------------------   Adj R-squared   =    0.0709
       Total |  4.85714286       174  .027914614   Root MSE        =    .16104

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0034377   .0014569    -2.36   0.019    -.0063136   -.0005619
  monthbirth |    .005172   .0034011     1.52   0.130    -.0015417    .0118856
      female |  -.1199009   .0451177    -2.66   0.009    -.2089603   -.0308415
       _cons |   1.141483   .0882394    12.94   0.000     .9673041    1.315662
------------------------------------------------------------------------------

. estat ovtest

Ramsey RESET test using powers of the fitted values of college
       Ho:  model has no omitted variables
                 F(3, 168) =      3.93
                  Prob > F =      0.0097

. regress college age female

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =      7.00
       Model |  .361800524         2  .180900262   Prob > F        =    0.0012
    Residual |  4.49695654       174  .025844578   R-squared       =    0.0745
-------------+----------------------------------   Adj R-squared   =    0.0638
       Total |  4.85875706       176  .027606574   Root MSE        =    .16076

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0036046   .0014392    -2.50   0.013    -.0064452    -.000764
      female |  -.1269716    .044784    -2.84   0.005    -.2153615   -.0385818
       _cons |   1.185199   .0822635    14.41   0.000     1.022836    1.347561
------------------------------------------------------------------------------

. estat ovtest

Ramsey RESET test using powers of the fitted values of college
       Ho:  model has no omitted variables
                 F(3, 171) =      1.49
                  Prob > F =      0.2184

. regress college age monthbirth female

      Source |       SS           df       MS      Number of obs   =       175
-------------+----------------------------------   F(3, 171)       =      5.43
       Model |  .422309296         3  .140769765   Prob > F        =    0.0014
    Residual |  4.43483356       171  .025934699   R-squared       =    0.0869
-------------+----------------------------------   Adj R-squared   =    0.0709
       Total |  4.85714286       174  .027914614   Root MSE        =    .16104

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0034377   .0014569    -2.36   0.019    -.0063136   -.0005619
  monthbirth |    .005172   .0034011     1.52   0.130    -.0015417    .0118856
      female |  -.1199009   .0451177    -2.66   0.009    -.2089603   -.0308415
       _cons |   1.141483   .0882394    12.94   0.000     .9673041    1.315662
------------------------------------------------------------------------------

. predict college_hat
(option xb assumed; fitted values)
(2 missing values generated)

. list college_hat college age monthbirth female if college_hat==.

     +----------------------------------------------+
     | colleg~t   college   age   monthb~h   female |
     |----------------------------------------------|
  8. |        .         1    63          .        0 |
112. |        .         1    46          .        0 |
     +----------------------------------------------+

. twoway (scatter college_hat age)

. scatter college_hat age

. test (age+monthbirth=0)

 ( 1)  age + monthbirth = 0

       F(  1,   171) =    0.21
            Prob > F =    0.6506

. regress college age monthbirth female, beta

      Source |       SS           df       MS      Number of obs   =       175
-------------+----------------------------------   F(3, 171)       =      5.43
       Model |  .422309296         3  .140769765   Prob > F        =    0.0014
    Residual |  4.43483356       171  .025934699   R-squared       =    0.0869
-------------+----------------------------------   Adj R-squared   =    0.0709
       Total |  4.85714286       174  .027914614   Root MSE        =    .16104

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|                     Beta
-------------+----------------------------------------------------------------
         age |  -.0034377   .0014569    -2.36   0.019                -.1732157
  monthbirth |    .005172   .0034011     1.52   0.130                 .1121473
      female |  -.1199009   .0451177    -2.66   0.009                -.1952495
       _cons |   1.141483   .0882394    12.94   0.000                        .
------------------------------------------------------------------------------

. regress college age monthbirth female c.monthbirth#female

      Source |       SS           df       MS      Number of obs   =       175
-------------+----------------------------------   F(4, 170)       =      4.54
       Model |  .469111622         4  .117277905   Prob > F        =    0.0016
    Residual |  4.38803124       170  .025811948   R-squared       =    0.0966
-------------+----------------------------------   Adj R-squared   =    0.0753
       Total |  4.85714286       174  .027914614   Root MSE        =    .16066

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0034132   .0014536    -2.35   0.020    -.0062826   -.0005439
  monthbirth |   .0039437   .0035136     1.12   0.263    -.0029921    .0108795
      female |  -.2167163   .0848257    -2.55   0.012    -.3841637   -.0492689
             |
      female#|
c.monthbirth |
          1  |   .0180138   .0133777     1.35   0.180     -.008394    .0444217
             |
       _cons |   1.148208   .0881719    13.02   0.000     .9741549     1.32226
------------------------------------------------------------------------------

. regress college age c.monthbirth##female

      Source |       SS           df       MS      Number of obs   =       175
-------------+----------------------------------   F(4, 170)       =      4.54
       Model |  .469111622         4  .117277905   Prob > F        =    0.0016
    Residual |  4.38803124       170  .025811948   R-squared       =    0.0966
-------------+----------------------------------   Adj R-squared   =    0.0753
       Total |  4.85714286       174  .027914614   Root MSE        =    .16066

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0034132   .0014536    -2.35   0.020    -.0062826   -.0005439
  monthbirth |   .0039437   .0035136     1.12   0.263    -.0029921    .0108795
    1.female |  -.2167163   .0848257    -2.55   0.012    -.3841637   -.0492689
             |
      female#|
c.monthbirth |
          1  |   .0180138   .0133777     1.35   0.180     -.008394    .0444217
             |
       _cons |   1.148208   .0881719    13.02   0.000     .9741549     1.32226
------------------------------------------------------------------------------

. do "/var/folders/ks/zj678rv15j14wrl6l0lwz9dw0000gn/T//SD50722.000000"

. regress college age c.monthbirth##i.female

      Source |       SS           df       MS      Number of obs   =       175
-------------+----------------------------------   F(4, 170)       =      4.54
       Model |  .469111622         4  .117277905   Prob > F        =    0.0016
    Residual |  4.38803124       170  .025811948   R-squared       =    0.0966
-------------+----------------------------------   Adj R-squared   =    0.0753
       Total |  4.85714286       174  .027914614   Root MSE        =    .16066

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0034132   .0014536    -2.35   0.020    -.0062826   -.0005439
  monthbirth |   .0039437   .0035136     1.12   0.263    -.0029921    .0108795
    1.female |  -.2167163   .0848257    -2.55   0.012    -.3841637   -.0492689
             |
      female#|
c.monthbirth |
          1  |   .0180138   .0133777     1.35   0.180     -.008394    .0444217
             |
       _cons |   1.148208   .0881719    13.02   0.000     .9741549     1.32226
------------------------------------------------------------------------------

. 
end of do-file

. destring sales, replace
sales: all characters numeric; replaced as long

. save ceosalarynew2.dta
file ceosalarynew2.dta saved

. export delimited using ceosalarynew.txt, delimiter (" ") replace
(note: file ceosalarynew.txt not found)
file ceosalarynew.txt saved

. notes : updated version of the datafile ceosalary.dta

. notes list _dta

_dta:
  1.  Sample of 177 CEOs of large corporations in 1990. The original purpose of
      the dataset was to estimate the factors that influence executive
      compensation.
  2.  updated version of the datafile ceosalary.dta

. log close
      name:  <unnamed>
       log:  /Users/mafton/Desktop/studystata.log
  log type:  text
 closed on:  31 Mar 2018, 15:46:12
----------------------------------------------------------------------------------
