----------------------------------------
      name:  <unnamed>
       log:  C:\Users\rayde\Desktop\unin
> sured_bootstrap3.log
  log type:  text
 opened on:   8 Aug 2019, 20:56:17

. 
. load
loaded LM_program.do
loaded stderr_prog.do

. 
. use "C:\Users\rayde\Downloads\h196dat\
> cleaned_data.dta", clear

. 
. **************************************
> **************************************
> ****
. * Set Global Variables
. **************************************
> **************************************
> ****
. 
. global depvar = "unin"

. global model1 = "AGE13X HRWAG13X ACTDT
> Y13 RACETHX"

. global model2 = "AGE13X HRWAG13X ACTDT
> Y13 RACETHX EMPST13"

. global model3 = "AGE13X ACTDTY13 RACET
> HX EMPST13"

. 
. global cooksd = "if cooksd < 4/_N"

. 
. **************************************
> **************************************
> ****
. **************************************
> **************************************
> ****
. *
. * Bootstrap
. *
. **************************************
> **************************************
> ****
. **************************************
> **************************************
> ****
. bsample 3946, strata(${depvar})

. 
. set seed 12345

. 
. local list = "regress logit probit"

. 
. cap drop *_uhat* *_yhat*

. 
. foreach x in `list' {
  2. 
. bootstrap, rep(50) mse: `x' ${depvar} 
> ${model1}
  3. estimates store `x'_1
  4. predict `x'_uhat1, stdp
  5. predict `x'_yhat1
  6. 
. bootstrap, rep(50) mse: `x' ${depvar} 
> ${model2}
  7. estimates store `x'_2
  8. predict `x'_uhat2, stdp
  9. predict `x'_yhat2
 10. 
. bootstrap, rep(50) mse: `x' ${depvar} 
> ${model3}
 11. estimates store `x'_3
 12. predict `x'_uhat3, stdp
 13. predict `x'_yhat3
 14. di "===============================
> ======================================
> ======"
 15. }
(running regress on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4
>  ---+--- 5 
........................................
> ..........    50

Linear regression                       
>         Number of obs                 
>                           =      7,892
                                        
>         Replications                  
>                           =         50
                                        
>         Wald chi2(4)                  
>                           =     842.50
                                        
>         Prob > chi2                   
>                           =     0.0000
                                        
>         R-squared                     
>                           =     0.1405
                                        
>         Adj R-squared                 
>                           =     0.1400
                                        
>         Root MSE                      
>                           =     0.4637

----------------------------------------
> --------------------------------------
             |   Observed   Bstrap *
        unin |      Coef.   Std. Err.   
>    z                                  
>         P>|z|                         
>                   [95% Con            
>                           f. Interval]
-------------+--------------------------
> --------------------------------------
      AGE13X |   .0011477   .0002758    
>  4.16                                 
>         0.000                         
>                   .0006072            
>                               .0016882
    HRWAG13X |   -.008325   .0004166   -
> 19.98                                 
>         0.000                         
>                  -.0091415            
>                              -.0075085
    ACTDTY13 |  -.2182948   .0110349   -
> 19.78                                 
>         0.000                         
>                  -.2399229            
>                              -.1966668
     RACETHX |  -.0514958   .0051298   -
> 10.04                                 
>         0.000                         
>                    -.06155            
>                              -.0414415
       _cons |    1.15783   .0247628    
> 46.76                                 
>         0.000                         
>                   1.109296            
>                               1.206365
----------------------------------------
> --------------------------------------
(option xb assumed; fitted values)
(running regress on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4
>  ---+--- 5 
..................................................    50

Linear regression                               Number of obs     =      7,892
                                                Replications      =         50
                                                Wald chi2(5)      =     794.42
                                                Prob > chi2       =     0.0000
                                                R-squared         =     0.1491
                                                Adj R-squared     =     0.1486
                                                Root MSE          =     0.4614

------------------------------------------------------------------------------
             |   Observed   Bstrap *
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0021572   .0003427     6.29   0.000     .0014855     .002829
    HRWAG13X |  -.0087759   .0004024   -21.81   0.000    -.0095645   -.0079872
    ACTDTY13 |  -.2223816    .011089   -20.05   0.000    -.2441157   -.2006476
     RACETHX |  -.0523574   .0051815   -10.10   0.000     -.062513   -.0422017
     EMPST13 |  -.0200779   .0023361    -8.59   0.000    -.0246565   -.0154993
       _cons |    1.16014    .028983    40.03   0.000     1.103335    1.216946
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(running regress on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Linear regression                               Number of obs     =      7,892
                                                Replications      =         50
                                                Wald chi2(4)      =     461.06
                                                Prob > chi2       =     0.0000
                                                R-squared         =     0.1040
                                                Adj R-squared     =     0.1035
                                                Root MSE          =     0.4734

------------------------------------------------------------------------------
             |   Observed   Bstrap *
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |    .000789    .000297     2.66   0.008     .0002068    .0013712
    ACTDTY13 |  -.1837356   .0110159   -16.68   0.000    -.2053263   -.1621449
     RACETHX |  -.0506313   .0053048    -9.54   0.000    -.0610285    -.040234
     EMPST13 |  -.0147126   .0023347    -6.30   0.000    -.0192884   -.0101368
       _cons |   1.052536   .0273825    38.44   0.000     .9988676    1.106205
------------------------------------------------------------------------------
(option xb assumed; fitted values)
===========================================================================
(running logit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Logistic regression                             Number of obs     =      7,892
                                                Replications      =         50
                                                Wald chi2(4)      =     900.96
                                                Prob > chi2       =     0.0000
Log likelihood = -4819.1625                     Pseudo R2         =     0.1190

------------------------------------------------------------------------------
             |   Observed   Bstrap *
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0060638   .0013532     4.48   0.000     .0034116    .0087159
    HRWAG13X |  -.0449912   .0023402   -19.23   0.000    -.0495779   -.0404045
    ACTDTY13 |   -1.14184   .0436763   -26.14   0.000    -1.227444   -1.056236
     RACETHX |  -.2392406   .0245201    -9.76   0.000    -.2872991    -.191182
       _cons |   3.360466   .1128904    29.77   0.000     3.139205    3.581727
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))
(running logit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Logistic regression                             Number of obs     =      7,892
                                                Replications      =         50
                                                Wald chi2(5)      =     837.52
                                                Prob > chi2       =     0.0000
Log likelihood = -4759.6491                     Pseudo R2         =     0.1299

------------------------------------------------------------------------------
             |   Observed   Bstrap *
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0129216   .0014686     8.80   0.000     .0100431    .0158001
    HRWAG13X |  -.0498148   .0026481   -18.81   0.000     -.055005   -.0446246
    ACTDTY13 |  -1.220215    .045793   -26.65   0.000    -1.309968   -1.130463
     RACETHX |   -.243123   .0261058    -9.31   0.000    -.2942893   -.1919567
     EMPST13 |  -.1298485   .0087914   -14.77   0.000    -.1470794   -.1126176
       _cons |    3.50746   .1307728    26.82   0.000      3.25115     3.76377
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))
(running logit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Logistic regression                             Number of obs     =      7,892
                                                Replications      =         50
                                                Wald chi2(4)      =     781.67
                                                Prob > chi2       =     0.0000
Log likelihood = -5005.3939                     Pseudo R2         =     0.0850

------------------------------------------------------------------------------
             |   Observed   Bstrap *
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0038088   .0014812     2.57   0.010     .0009057    .0067118
    ACTDTY13 |  -.9091205   .0361326   -25.16   0.000     -.979939    -.838302
     RACETHX |  -.2193944   .0240521    -9.12   0.000    -.2665358   -.1722531
     EMPST13 |  -.0779394   .0103402    -7.54   0.000    -.0982059   -.0576729
       _cons |   2.658319   .1078206    24.66   0.000     2.446995    2.869644
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))
===========================================================================
(running probit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Probit regression                               Number of obs     =      7,892
                                                Replications      =         50
                                                Wald chi2(4)      =    1111.87
                                                Prob > chi2       =     0.0000
Log likelihood = -4833.6039                     Pseudo R2         =     0.1164

------------------------------------------------------------------------------
             |   Observed   Bstrap *
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0036704   .0008969     4.09   0.000     .0019125    .0054282
    HRWAG13X |  -.0258585   .0012655   -20.43   0.000    -.0283388   -.0233782
    ACTDTY13 |  -.6730292   .0241819   -27.83   0.000    -.7204248   -.6256336
     RACETHX |  -.1417392   .0129667   -10.93   0.000    -.1671534    -.116325
       _cons |   1.982361   .0623525    31.79   0.000     1.860152    2.104569
------------------------------------------------------------------------------
Note: 0 failures and 6 successes completely determined.
(option pr assumed; Pr(unin))
(running probit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Probit regression                               Number of obs     =      7,892
                                                Replications      =         50
                                                Wald chi2(5)      =     752.32
                                                Prob > chi2       =     0.0000
Log likelihood = -4774.3903                     Pseudo R2         =     0.1272

------------------------------------------------------------------------------
             |   Observed   Bstrap *
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0077013    .000992     7.76   0.000      .005757    .0096457
    HRWAG13X |  -.0284073   .0015694   -18.10   0.000    -.0314832   -.0253313
    ACTDTY13 |  -.7139996   .0285106   -25.04   0.000    -.7698794   -.6581197
     RACETHX |  -.1433399    .015775    -9.09   0.000    -.1742583   -.1124215
     EMPST13 |  -.0770525   .0078089    -9.87   0.000    -.0923576   -.0617473
       _cons |   2.054214   .0821178    25.02   0.000     1.893266    2.215162
------------------------------------------------------------------------------
Note: 0 failures and 6 successes completely determined.
(option pr assumed; Pr(unin))
(running probit on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Probit regression                               Number of obs     =      7,892
                                                Replications      =         50
                                                Wald chi2(4)      =     929.78
                                                Prob > chi2       =     0.0000
Log likelihood = -5006.5773                     Pseudo R2         =     0.0848

------------------------------------------------------------------------------
             |   Observed   Bstrap *
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0025363   .0008998     2.82   0.005     .0007728    .0042998
    ACTDTY13 |  -.5546073    .019943   -27.81   0.000    -.5936948   -.5155197
     RACETHX |  -.1326505   .0150016    -8.84   0.000     -.162053    -.103248
     EMPST13 |  -.0489703    .006513    -7.52   0.000    -.0617356   -.0362051
       _cons |    1.61884   .0592811    27.31   0.000     1.502651    1.735029
------------------------------------------------------------------------------
Note: 0 failures and 4 successes completely determined.
(option pr assumed; Pr(unin))
===========================================================================

. 
. local list = "regress logit probit"

. 
. forval x = 1/3 {
  2. 
.         stderr regress_uhat`x' logit_uhat`x' probit_uhat`x' 
  3.         matrix define stderr`x' = (regress_uhat`x', logit_uhat`x' ,probit_uhat`x' )
  4. 
. }
stderr of regress_uhat1 = .01308806
stderr of logit_uhat1 = .05862867
stderr of probit_uhat1 = .03703213
stderr of regress_uhat2 = .01469671
stderr of logit_uhat2 = .05750123
stderr of probit_uhat2 = .04006967
stderr of regress_uhat3 = .01376936
stderr of logit_uhat3 = .06014223
stderr of probit_uhat3 = .03375917

. 
. matrix stderr = stderr1\stderr2\stderr3

. matrix rownames stderr = stderr1 stderr2 stderr3

. matrix colnames stderr =  REGRESS LOGIT PROBIT

. 
. putexcel set "output.csv", sheet(bootstrapped) modify

. putexcel A1 = matrix(stderr), names nformat(number_d2)
file output.csv saved

. 
. capture {

Probit model for unin

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |      2934          1854  |       4788
     -     |      1012          2092  |       3104
-----------+--------------------------+-----------
   Total   |      3946          3946  |       7892

Classified + if predicted Pr(D) >= .5
True D defined as unin != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   74.35%
Specificity                     Pr( -|~D)   53.02%
Positive predictive value       Pr( D| +)   61.28%
Negative predictive value       Pr(~D| -)   67.40%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   46.98%
False - rate for true D         Pr( -| D)   25.65%
False + rate for classified +   Pr(~D| +)   38.72%
False - rate for classified -   Pr( D| -)   32.60%
--------------------------------------------------
Correctly classified                        63.68%
--------------------------------------------------

Probit model for unin, goodness-of-fit test

       number of observations =      7892
 number of covariate patterns =       631
            Pearson chi2(626) =      3104.24
                  Prob > chi2 =         0.0000

Probit model for unin, goodness-of-fit test

  (Table collapsed on quantiles of estimated probabilities)

       number of observations =      7892
             number of groups =        10
      Hosmer-Lemeshow chi2(8) =       237.53
                  Prob > chi2 =         0.0000

Probit model for unin, goodness-of-fit test

  (Table collapsed on quantiles of estimated probabilities)
  +--------------------------------------------------------+
  | Group |   Prob | Obs_1 | Exp_1 | Obs_0 | Exp_0 | Total |
  |-------+--------+-------+-------+-------+-------+-------|
  |     1 | 0.1990 |   138 | 145.7 |   687 | 679.3 |   825 |
  |     2 | 0.3572 |   214 | 199.4 |   546 | 560.6 |   760 |
  |     3 | 0.4508 |   292 | 318.3 |   491 | 464.7 |   783 |
  |     4 | 0.5038 |   406 | 371.4 |   384 | 418.6 |   790 |
  |     5 | 0.5616 |   469 | 425.8 |   320 | 363.2 |   789 |
  |-------+--------+-------+-------+-------+-------+-------|
  |     6 | 0.5972 |   481 | 461.9 |   317 | 336.1 |   798 |
  |     7 | 0.6138 |   413 | 490.5 |   396 | 318.5 |   809 |
  |     8 | 0.6330 |   350 | 498.0 |   448 | 300.0 |   798 |
  |     9 | 0.6634 |   581 | 527.1 |   226 | 279.9 |   807 |
  |    10 | 1.0000 |   602 | 513.9 |   131 | 219.1 |   733 |
  +--------------------------------------------------------+

       number of observations =      7892
             number of groups =        10
      Hosmer-Lemeshow chi2(8) =       237.53
                  Prob > chi2 =         0.0000

. 
. foreach x in `list' {
  2. estimates table `x'_1 `x'_2 `x'_3, ///
>   stats(N ll r2_p mrse) b(%7.3f) stfmt(%8.2f)
  3.   
. sum `x'_yhat1 `x'_yhat2 `x'_yhat3 ${depvar}
  4. sum `x'_uhat1 `x'_uhat2 `x'_uhat3
  5. }

-----------------------------------------------
    Variable | regre~_1   regre~_2   regre~_3  
-------------+---------------------------------
      AGE13X |    0.001      0.002      0.001  
    HRWAG13X |   -0.008     -0.009             
    ACTDTY13 |   -0.218     -0.222     -0.184  
     RACETHX |   -0.051     -0.052     -0.051  
     EMPST13 |              -0.020     -0.015  
       _cons |    1.158      1.160      1.053  
-------------+---------------------------------
           N |     7892       7892       7892  
          ll | -5130.68   -5090.61   -5294.71  
        r2_p |                                 
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
regress_yh~1 |      7,892          .5    .1874032  -.3837273   2.830181
regress_yh~2 |      7,892          .5    .1931088  -.3914137   3.062785
regress_yh~3 |      7,892          .5    .1612387   .0537162   2.567774
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
regress_uh~1 |      7,892    .0118173    .0045904   .0064803    .114352
regress_uh~2 |      7,892    .0132222     .004826   .0077229   .1246589
regress_uh~3 |      7,892    .0123554    .0049742   .0070747   .1226341

-----------------------------------------------
    Variable | logit_1    logit_2    logit_3   
-------------+---------------------------------
      AGE13X |    0.006      0.013      0.004  
    HRWAG13X |   -0.045     -0.050             
    ACTDTY13 |   -1.142     -1.220     -0.909  
     RACETHX |   -0.239     -0.243     -0.219  
     EMPST13 |              -0.130     -0.078  
       _cons |    3.360      3.507      2.658  
-------------+---------------------------------
           N |     7892       7892       7892  
          ll | -4819.16   -4759.65   -5005.39  
        r2_p |     0.12       0.13       0.08  
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 logit_yhat1 |      7,892          .5    .1964729   .0089229   .9999948
 logit_yhat2 |      7,892          .5    .2036105   .0070731   .9999993
 logit_yhat3 |      7,892          .5    .1670197    .103906   .9999651
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 logit_uhat1 |      7,892    .0584717    .0240671   .0301273   .4558524
 logit_uhat2 |      7,892    .0604426    .0261867   .0270219   .5136128
 logit_uhat3 |      7,892    .0545938     .022144   .0311496   .3997451

-----------------------------------------------
    Variable | probit_1   probit_2   probit_3  
-------------+---------------------------------
      AGE13X |    0.004      0.008      0.003  
    HRWAG13X |   -0.026     -0.028             
    ACTDTY13 |   -0.673     -0.714     -0.555  
     RACETHX |   -0.142     -0.143     -0.133  
     EMPST13 |              -0.077     -0.049  
       _cons |    1.982      2.054      1.619  
-------------+---------------------------------
           N |     7892       7892       7892  
          ll | -4833.60   -4774.39   -5006.58  
        r2_p |     0.12       0.13       0.08  
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
probit_yhat1 |      7,892    .5014338    .1904952   .0032166          1
probit_yhat2 |      7,892    .5015787    .1978466   .0022893          1
probit_yhat3 |      7,892    .5007737    .1663704   .0961157          1
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
probit_uhat1 |      7,892    .0311563    .0130905   .0132318   .2499959
probit_uhat2 |      7,892    .0382189    .0170533   .0158253   .3303247
probit_uhat3 |      7,892    .0317731    .0118697   .0174291   .2264606

. 
. 
. 
. local list = "regress logit probit"

. 
. forval y = 1/3 {
  2. foreach x in `list' {
  3.         
.                 estimates restore `x'_`y'
  4.                 
.                 noisily di "============================================================"
  5.                 noisily di "Model `x'_`y' " e(cmdline)
  6.                 noisily di "============================================================"
  7. 
.                 count if `x'_yhat`y' > .95 & ${depvar}==1 & e(sample)
  8.                 scalar x = r(N)
  9.                 count if ${depvar}==1 & e(sample)
 10.                 scalar y = r(N)
 11.                 scalar z1 = x/y
 12.                 noisily di "Correct Success Prediction Rate: " z1
 13.                 noisily di "predicted =" x ", Actual = " y
 14. 
.                 noisily di "  "
 15. 
.                 count if `x'_yhat`y'<.05 & ${depvar}==0 & e(sample)
 16.                 scalar x = r(N)
 17.                 count if ${depvar}==0 & e(sample) 
 18.                 scalar y = r(N)
 19.                 scalar z2 = x/y
 20.                 noisily di "Correct Failure Prediction Rate: " z2
 21.                 noisily di "predicted =" x ", Actual = " y
 22. 
.                 noisily di " "
 23.                 
.                 count if `x'_yhat`y'> .95 & ${depvar}==0 & e(sample)
 24.                 scalar x = r(N)
 25.                 count if ${depvar}==1 & e(sample)
 26.                 scalar y = r(N)
 27.                 scalar z3 = x/y
 28.                 noisily di "Incorrect Success Prediction Rate: " z3
 29.                 noisily di "predicted =" x ", Actual = " y
 30. 
.                 noisily di " "
 31.                 
.                 count if `x'_yhat`y'<.05 & ${depvar}==1 & e(sample)
 32.                 scalar x = r(N)
 33.                 count if ${depvar}==0 & e(sample)
 34.                 scalar y = r(N)
 35.                 scalar z4 = x/y
 36.                 noisily di "Incorrect Failure Prediction Rate: " z4
 37.                 noisily di "predicted =" x ", Actual = " y
 38.                 matrix define prediction`x'`y' = (z1, z2, z3, z4)
 39. 
. di "==========================================================================="
 40. }
 41. }
(results regress_1 are active now)
============================================================
Model regress_1 bootstrap , rep(50) mse: regress unin AGE13X HRWAG13X ACTDTY13 RACETHX
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  82
  3,946
Correct Failure Prediction Rate: .02078054
predicted =82, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  23
  3,946
Incorrect Failure Prediction Rate: .00582869
predicted =23, Actual = 3946
===========================================================================
(results logit_1 are active now)
============================================================
Model logit_1 bootstrap , rep(50) mse: logit unin AGE13X HRWAG13X ACTDTY13 RACETHX
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  38
  3,946
Correct Failure Prediction Rate: .00963001
predicted =38, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results probit_1 are active now)
============================================================
Model probit_1 bootstrap , rep(50) mse: probit unin AGE13X HRWAG13X ACTDTY13 RACETHX
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  44
  3,946
Correct Failure Prediction Rate: .01115053
predicted =44, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results regress_2 are active now)
============================================================
Model regress_2 bootstrap , rep(50) mse: regress unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13
============================================================
  12
  3,946
Correct Success Prediction Rate: .00304105
predicted =12, Actual = 3946
  
  69
  3,946
Correct Failure Prediction Rate: .01748606
predicted =69, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  23
  3,946
Incorrect Failure Prediction Rate: .00582869
predicted =23, Actual = 3946
===========================================================================
(results logit_2 are active now)
============================================================
Model logit_2 bootstrap , rep(50) mse: logit unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  44
  3,946
Correct Failure Prediction Rate: .01115053
predicted =44, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results probit_2 are active now)
============================================================
Model probit_2 bootstrap , rep(50) mse: probit unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  44
  3,946
Correct Failure Prediction Rate: .01115053
predicted =44, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results regress_3 are active now)
============================================================
Model regress_3 bootstrap , rep(50) mse: regress unin AGE13X ACTDTY13 RACETHX EMPST13
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  0
  3,946
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3946
===========================================================================
(results logit_3 are active now)
============================================================
Model logit_3 bootstrap , rep(50) mse: logit unin AGE13X ACTDTY13 RACETHX EMPST13
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  0
  3,946
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3946
===========================================================================
(results probit_3 are active now)
============================================================
Model probit_3 bootstrap , rep(50) mse: probit unin AGE13X ACTDTY13 RACETHX EMPST13
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  0
  3,946
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3946
===========================================================================

. 
. 
. 
. 
. forval y = 1/3 {
  2.         matrix accuracy`y' = (predictionregress`y' \ predictionlogit`y' \ predictionprobit`y')
  3.         
.         matrix colnames accuracy`y' = correct_success correct_failure   inaccurate_success inaccurate_failure
  4.         
.         matrix rownames accuracy`x'`y' = REGRESS LOGIT PROBIT
  5.         
. 
.         putexcel set "prediction.csv", sheet(bootstrapped`y') modify
  6.         putexcel A1 = matrix(accuracy`x'`y'), names nformat(number_d2)
  7. 
. }
file prediction.csv saved
file prediction.csv saved
file prediction.csv saved

. 
. 
. ********************************************************************************
. ********************************************************************************
. *
. * COOKSD REGRESSION 
. *
. ********************************************************************************
. ********************************************************************************
. 
. local list = "regress logit probit"

. 
. cap drop *_uhat* *_yhat*

. 
. foreach x in `list' {
  2. 
. `x' ${depvar} ${model1} ${cooksd}
  3. estimates store `x'_1
  4. predict `x'_uhat1, stdp
  5. predict `x'_yhat1 
  6. 
. `x' ${depvar} ${model2} ${cooksd}
  7. estimates store `x'_2
  8. predict `x'_uhat2, stdp
  9. predict `x'_yhat2 
 10. 
. `x' ${depvar} ${model3} ${cooksd}
 11. estimates store `x'_3
 12. predict `x'_uhat3, stdp
 13. predict `x'_yhat3 
 14. di "==========================================================================="
 15. }

      Source |       SS           df       MS      Number of obs   =     3,814
-------------+----------------------------------   F(4, 3809)      =    181.76
       Model |  152.040985         4  38.0102463   Prob > F        =    0.0000
    Residual |  796.537935     3,809  .209119962   R-squared       =    0.1603
-------------+----------------------------------   Adj R-squared   =    0.1594
       Total |   948.57892     3,813  .248774959   Root MSE        =     .4573

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0016568   .0006205     2.67   0.008     .0004402    .0028734
    HRWAG13X |  -.0101073   .0005359   -18.86   0.000    -.0111579   -.0090566
    ACTDTY13 |   .2229743   .3236546     0.69   0.491    -.4115786    .8575272
     RACETHX |   -.149417   .0082165   -18.18   0.000    -.1655262   -.1333077
       _cons |   .4379652   .6482937     0.68   0.499    -.8330711    1.709001
------------------------------------------------------------------------------
(option xb assumed; fitted values)

      Source |       SS           df       MS      Number of obs   =     3,814
-------------+----------------------------------   F(5, 3808)      =    152.88
       Model |  158.580166         5  31.7160332   Prob > F        =    0.0000
    Residual |  789.998754     3,808  .207457656   R-squared       =    0.1672
-------------+----------------------------------   Adj R-squared   =    0.1661
       Total |   948.57892     3,813  .248774959   Root MSE        =    .45548

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0019431   .0006202     3.13   0.002     .0007272     .003159
    HRWAG13X |  -.0126841    .000704   -18.02   0.000    -.0140643    -.011304
    ACTDTY13 |   .2286705   .3223672     0.71   0.478    -.4033585    .8606995
     RACETHX |  -.1434599   .0082523   -17.38   0.000    -.1596393   -.1272805
     EMPST13 |   -.039016   .0069494    -5.61   0.000    -.0526408   -.0253911
       _cons |   .5130826   .6458505     0.79   0.427    -.7531636    1.779329
------------------------------------------------------------------------------
(option xb assumed; fitted values)

      Source |       SS           df       MS      Number of obs   =     3,814
-------------+----------------------------------   F(4, 3809)      =    101.32
       Model |  91.2265457         4  22.8066364   Prob > F        =    0.0000
    Residual |  857.352374     3,809  .225085948   R-squared       =    0.0962
-------------+----------------------------------   Adj R-squared   =    0.0952
       Total |   948.57892     3,813  .248774959   Root MSE        =    .47443

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |  -.0003784   .0006319    -0.60   0.549    -.0016173    .0008605
    ACTDTY13 |   .3183655   .3357442     0.95   0.343    -.3398903    .9766212
     RACETHX |  -.1611177    .008535   -18.88   0.000    -.1778512   -.1443841
     EMPST13 |   .0426259   .0054884     7.77   0.000     .0318654    .0533864
       _cons |   .1374965   .6723806     0.20   0.838    -1.180764    1.455757
------------------------------------------------------------------------------
(option xb assumed; fitted values)
===========================================================================

note: ACTDTY13 != 2 predicts failure perfectly
      ACTDTY13 dropped and 2 obs not used

Iteration 0:   log likelihood = -2632.2767  
Iteration 1:   log likelihood = -2290.8974  
Iteration 2:   log likelihood = -2287.1627  
Iteration 3:   log likelihood =  -2287.158  
Iteration 4:   log likelihood =  -2287.158  

Logistic regression                             Number of obs     =      3,812
                                                LR chi2(3)        =     690.24
                                                Prob > chi2       =     0.0000
Log likelihood =  -2287.158                     Pseudo R2         =     0.1311

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0076972   .0029681     2.59   0.010     .0018798    .0135146
    HRWAG13X |    -.05589   .0033075   -16.90   0.000    -.0623725   -.0494075
    ACTDTY13 |          0  (omitted)
     RACETHX |  -.7159497   .0421006   -17.01   0.000    -.7984655    -.633434
       _cons |   1.886983   .1382294    13.65   0.000     1.616059    2.157908
------------------------------------------------------------------------------
(2675 missing values generated)
(option pr assumed; Pr(unin))
(2,675 missing values generated)

note: ACTDTY13 != 2 predicts failure perfectly
      ACTDTY13 dropped and 2 obs not used

Iteration 0:   log likelihood = -2632.2767  
Iteration 1:   log likelihood = -2258.1531  
Iteration 2:   log likelihood = -2243.9568  
Iteration 3:   log likelihood = -2243.7992  
Iteration 4:   log likelihood = -2243.7992  

Logistic regression                             Number of obs     =      3,812
                                                LR chi2(4)        =     776.96
                                                Prob > chi2       =     0.0000
Log likelihood = -2243.7992                     Pseudo R2         =     0.1476

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0105161   .0029903     3.52   0.000     .0046552    .0163771
    HRWAG13X |  -.0951502   .0060792   -15.65   0.000    -.1070652   -.0832351
    ACTDTY13 |          0  (omitted)
     RACETHX |  -.6806711   .0421153   -16.16   0.000    -.7632156   -.5981266
     EMPST13 |  -.3779039   .0421636    -8.96   0.000     -.460543   -.2952647
       _cons |   2.876988   .1824544    15.77   0.000     2.519384    3.234592
------------------------------------------------------------------------------
(2675 missing values generated)
(option pr assumed; Pr(unin))
(2,675 missing values generated)

note: ACTDTY13 != 2 predicts failure perfectly
      ACTDTY13 dropped and 2 obs not used

Iteration 0:   log likelihood = -2632.2767  
Iteration 1:   log likelihood = -2441.2391  
Iteration 2:   log likelihood = -2441.1746  
Iteration 3:   log likelihood = -2441.1746  

Logistic regression                             Number of obs     =      3,812
                                                LR chi2(3)        =     382.20
                                                Prob > chi2       =     0.0000
Log likelihood = -2441.1746                     Pseudo R2         =     0.0726

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |  -.0018225   .0028096    -0.65   0.517    -.0073292    .0036842
    ACTDTY13 |          0  (omitted)
     RACETHX |  -.7149345   .0414666   -17.24   0.000    -.7962075   -.6336614
     EMPST13 |   .1906268   .0248768     7.66   0.000     .1418692    .2393843
       _cons |   1.206543   .1389903     8.68   0.000     .9341267    1.478959
------------------------------------------------------------------------------
(2675 missing values generated)
(option pr assumed; Pr(unin))
(2,675 missing values generated)
===========================================================================

note: ACTDTY13 != 2 predicts failure perfectly
      ACTDTY13 dropped and 2 obs not used

Iteration 0:   log likelihood = -2632.2767  
Iteration 1:   log likelihood =  -2290.872  
Iteration 2:   log likelihood = -2285.6404  
Iteration 3:   log likelihood = -2285.6379  
Iteration 4:   log likelihood = -2285.6379  

Probit regression                               Number of obs     =      3,812
                                                LR chi2(3)        =     693.28
                                                Prob > chi2       =     0.0000
Log likelihood = -2285.6379                     Pseudo R2         =     0.1317

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0042858   .0017759     2.41   0.016      .000805    .0077666
    HRWAG13X |  -.0338438   .0019456   -17.40   0.000    -.0376571   -.0300305
    ACTDTY13 |          0  (omitted)
     RACETHX |  -.4413421   .0254419   -17.35   0.000    -.4912072   -.3914769
       _cons |   1.170049    .083314    14.04   0.000     1.006757    1.333342
------------------------------------------------------------------------------
(2675 missing values generated)
(option pr assumed; Pr(unin))
(2,675 missing values generated)

note: ACTDTY13 != 2 predicts failure perfectly
      ACTDTY13 dropped and 2 obs not used

Iteration 0:   log likelihood = -2632.2767  
Iteration 1:   log likelihood = -2257.8634  
Iteration 2:   log likelihood = -2244.2119  
Iteration 3:   log likelihood =  -2244.114  
Iteration 4:   log likelihood =  -2244.114  

Probit regression                               Number of obs     =      3,812
                                                LR chi2(4)        =     776.33
                                                Prob > chi2       =     0.0000
Log likelihood =  -2244.114                     Pseudo R2         =     0.1475

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0059857   .0017932     3.34   0.001     .0024711    .0095003
    HRWAG13X |  -.0554086   .0033575   -16.50   0.000    -.0619892    -.048828
    ACTDTY13 |          0  (omitted)
     RACETHX |  -.4225802   .0255881   -16.51   0.000    -.4727319   -.3724284
     EMPST13 |  -.2161941   .0242928    -8.90   0.000    -.2638071   -.1685812
       _cons |   1.730214     .10631    16.28   0.000      1.52185    1.938578
------------------------------------------------------------------------------
(2675 missing values generated)
(option pr assumed; Pr(unin))
(2,675 missing values generated)

note: ACTDTY13 != 2 predicts failure perfectly
      ACTDTY13 dropped and 2 obs not used

Iteration 0:   log likelihood = -2632.2767  
Iteration 1:   log likelihood = -2439.8873  
Iteration 2:   log likelihood =  -2439.762  
Iteration 3:   log likelihood =  -2439.762  

Probit regression                               Number of obs     =      3,812
                                                LR chi2(3)        =     385.03
                                                Prob > chi2       =     0.0000
Log likelihood =  -2439.762                     Pseudo R2         =     0.0731

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |  -.0011887   .0017173    -0.69   0.489    -.0045545    .0021772
    ACTDTY13 |          0  (omitted)
     RACETHX |  -.4453685   .0250726   -17.76   0.000      -.49451   -.3962271
     EMPST13 |   .1153564   .0151133     7.63   0.000     .0857349    .1449779
       _cons |   .7614306   .0854088     8.92   0.000     .5940324    .9288288
------------------------------------------------------------------------------
(2675 missing values generated)
(option pr assumed; Pr(unin))
(2,675 missing values generated)
===========================================================================

. 
. 
. local list = "regress logit probit"

. 
. forval x = 1/3 {
  2. 
.         stderr regress_uhat`x' logit_uhat`x' probit_uhat`x' 
  3.         matrix define stderr`x' = (regress_uhat`x', logit_uhat`x' ,probit_uhat`x' )
  4. 
. }
stderr of regress_uhat1 = .32450143
stderr of logit_uhat1 = 0
stderr of probit_uhat1 = 0
stderr of regress_uhat2 = .32425359
stderr of logit_uhat2 = 0
stderr of probit_uhat2 = 0
stderr of regress_uhat3 = .33746767
stderr of logit_uhat3 = 0
stderr of probit_uhat3 = 0

. 
. matrix stderr = stderr1\stderr2\stderr3

. matrix rownames stderr = stderr1 stderr2 stderr

. matrix colnames stderr =  REGRESS LOGIT PROBIT

. 
. putexcel set "output.csv", sheet(COOKSD) modify

. putexcel A1 = matrix(stderr), names nformat(number_d2)
file output.csv saved

. 
. capture {

Probit model for unin

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |      1300           570  |       1870
     -     |       744          1198  |       1942
-----------+--------------------------+-----------
   Total   |      2044          1768  |       3812

Classified + if predicted Pr(D) >= .5
True D defined as unin != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   63.60%
Specificity                     Pr( -|~D)   67.76%
Positive predictive value       Pr( D| +)   69.52%
Negative predictive value       Pr(~D| -)   61.69%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   32.24%
False - rate for true D         Pr( -| D)   36.40%
False + rate for classified +   Pr(~D| +)   30.48%
False - rate for classified -   Pr( D| -)   38.31%
--------------------------------------------------
Correctly classified                        65.53%
--------------------------------------------------

Probit model for unin, goodness-of-fit test

       number of observations =      3812
 number of covariate patterns =       293
            Pearson chi2(289) =      1469.42
                  Prob > chi2 =         0.0000

Probit model for unin, goodness-of-fit test

  (Table collapsed on quantiles of estimated probabilities)

       number of observations =      3812
             number of groups =        10
      Hosmer-Lemeshow chi2(8) =       338.25
                  Prob > chi2 =         0.0000

Probit model for unin, goodness-of-fit test

  (Table collapsed on quantiles of estimated probabilities)
  +--------------------------------------------------------+
  | Group |   Prob | Obs_1 | Exp_1 | Obs_0 | Exp_0 | Total |
  |-------+--------+-------+-------+-------+-------+-------|
  |     1 | 0.3061 |   105 |  92.1 |   277 | 289.9 |   382 |
  |     2 | 0.4446 |   279 | 146.6 |   116 | 248.4 |   395 |
  |     3 | 0.4712 |   138 | 183.2 |   257 | 211.8 |   395 |
  |     4 | 0.4783 |   105 | 176.4 |   266 | 194.6 |   371 |
  |     5 | 0.4854 |   112 | 175.4 |   252 | 188.6 |   364 |
  |-------+--------+-------+-------+-------+-------+-------|
  |     6 | 0.6193 |   205 | 234.9 |   187 | 157.1 |   392 |
  |     7 | 0.6495 |   262 | 258.6 |   141 | 144.4 |   403 |
  |     8 | 0.6543 |   249 | 228.2 |   101 | 121.8 |   350 |
  |     9 | 0.7644 |   283 | 257.0 |    96 | 122.0 |   379 |
  |    10 | 0.7759 |   306 | 293.6 |    75 |  87.4 |   381 |
  +--------------------------------------------------------+

       number of observations =      3812
             number of groups =        10
      Hosmer-Lemeshow chi2(8) =       338.25
                  Prob > chi2 =         0.0000

. 
. foreach x in `list' {
  2. estimates table `x'_1 `x'_2 `x'_3, ///
>   stats(N ll r2_p mrse) b(%7.3f) stfmt(%8.2f)
  3.   
. sum `x'_yhat1 `x'_yhat2 `x'_yhat3
  4. sum `x'_uhat1 `x'_uhat2 `x'_uhat3
  5. 
. }

-----------------------------------------------
    Variable | regre~_1   regre~_2   regre~_3  
-------------+---------------------------------
      AGE13X |    0.002      0.002     -0.000  
    HRWAG13X |   -0.010     -0.013             
    ACTDTY13 |    0.223      0.229      0.318  
     RACETHX |   -0.149     -0.143     -0.161  
     EMPST13 |              -0.039      0.043  
       _cons |    0.438      0.513      0.137  
-------------+---------------------------------
           N |     3814       3814       3814  
          ll | -2425.17   -2409.45   -2565.47  
        r2_p |                                 
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
regress_yh~1 |      7,892    .6901163    .2900435  -1.604733   1.375789
regress_yh~2 |      7,892    .7379484    .3138772  -1.531902   1.669838
regress_yh~3 |      7,892    .6414667     .326887  -3.122107   1.397642

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
regress_uh~1 |      7,892    .1765616    .2554351   .0074518   3.236553
regress_uh~2 |      7,892    .1793806    .2527211   .0090608   3.224452
regress_uh~3 |      7,892    .1844746    .2644732   .0091384   3.356825

--------------------------------------------------
    Variable |  logit_1     logit_2     logit_3   
-------------+------------------------------------
      AGE13X |     0.008       0.011      -0.002  
    HRWAG13X |    -0.056      -0.095              
    ACTDTY13 | (omitted)   (omitted)   (omitted)  
     RACETHX |    -0.716      -0.681      -0.715  
     EMPST13 |                -0.378       0.191  
       _cons |     1.887       2.877       1.207  
-------------+------------------------------------
           N |      3812        3812        3812  
          ll |  -2287.16    -2243.80    -2441.17  
        r2_p |      0.13        0.15        0.07  
        mrse |                                    
--------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 logit_yhat1 |      5,217    .5590367    .2096957   .0047529   .8906494
 logit_yhat2 |      5,217     .595978    .2455229   .0004101   .9981524
 logit_yhat3 |      5,217    .4985202    .1814506   .0153354   .7729343

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 logit_uhat1 |      7,892    .0503536     .042273          0   .2695838
 logit_uhat2 |      7,892    .0754202    .0945481          0   .5439278
 logit_uhat3 |      7,892    .0513848    .0527704          0   .3233389

--------------------------------------------------
    Variable | probit_1    probit_2    probit_3   
-------------+------------------------------------
      AGE13X |     0.004       0.006      -0.001  
    HRWAG13X |    -0.034      -0.055              
    ACTDTY13 | (omitted)   (omitted)   (omitted)  
     RACETHX |    -0.441      -0.423      -0.445  
     EMPST13 |                -0.216       0.115  
       _cons |     1.170       1.730       0.761  
-------------+------------------------------------
           N |      3812        3812        3812  
          ll |  -2285.64    -2244.11    -2439.76  
        r2_p |      0.13        0.15        0.07  
        mrse |                                    
--------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
probit_yhat1 |      5,217    .5572977    .2108379   .0005566   .8977833
probit_yhat2 |      5,217    .5945418    .2457271   2.16e-06   .9998689
probit_yhat3 |      5,217    .4984714    .1837975   .0053135   .7759147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
probit_uhat1 |      7,892    .0301549    .0252761          0    .157985
probit_uhat2 |      7,892    .0440265    .0540191          0   .3144178
probit_uhat3 |      7,892     .031325    .0320376          0   .1939406

. 
. local list = "regress logit probit"

. 
. forval y = 1/3 {
  2. foreach x in `list' {
  3.         
.                 estimates restore `x'_`y'
  4.                 
.                 noisily di "============================================================"
  5.                 noisily di "Model `x'_`y' " e(cmdline)
  6.                 noisily di "============================================================"
  7. 
.                 count if `x'_yhat`y' > .95 & ${depvar}==1 & e(sample)
  8.                 scalar x = r(N)
  9.                 count if ${depvar}==1 & e(sample)
 10.                 scalar y = r(N)
 11.                 scalar z1 = x/y
 12.                 noisily di "Correct Success Prediction Rate: " z1
 13.                 noisily di "predicted =" x ", Actual = " y
 14. 
.                 noisily di "  "
 15. 
.                 count if `x'_yhat`y'<.05 & ${depvar}==0 & e(sample)
 16.                 scalar x = r(N)
 17.                 count if ${depvar}==0 & e(sample) 
 18.                 scalar y = r(N)
 19.                 scalar z2 = x/y
 20.                 noisily di "Correct Failure Prediction Rate: " z2
 21.                 noisily di "predicted =" x ", Actual = " y
 22. 
.                 noisily di " "
 23.                 
.                 count if `x'_yhat`y'> .95 & ${depvar}==0 & e(sample)
 24.                 scalar x = r(N)
 25.                 count if ${depvar}==1 & e(sample)
 26.                 scalar y = r(N)
 27.                 scalar z3 = x/y
 28.                 noisily di "Incorrect Success Prediction Rate: " z3
 29.                 noisily di "predicted =" x ", Actual = " y
 30. 
.                 noisily di " "
 31.                 
.                 count if `x'_yhat`y'<.05 & ${depvar}==1 & e(sample)
 32.                 scalar x = r(N)
 33.                 count if ${depvar}==0 & e(sample)
 34.                 scalar y = r(N)
 35.                 scalar z4 = x/y
 36.                 noisily di "Incorrect Failure Prediction Rate: " z4
 37.                 noisily di "predicted =" x ", Actual = " y
 38.                 matrix define prediction`x'`y' = (z1, z2, z3, z4)
 39. 
. di "==========================================================================="
 40. }
 41. }
(results regress_1 are active now)
============================================================
Model regress_1 regress unin AGE13X HRWAG13X ACTDTY13 RACETHX if cooksd < 4/_N
============================================================
  0
  2,044
Correct Success Prediction Rate: 0
predicted =0, Actual = 2044
  
  84
  1,770
Correct Failure Prediction Rate: .04745763
predicted =84, Actual = 1770
 
  0
  2,044
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 2044
 
  0
  1,770
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 1770
===========================================================================
(results logit_1 are active now)
============================================================
Model logit_1 logit unin AGE13X HRWAG13X ACTDTY13 RACETHX if cooksd < 4/_N
============================================================
  0
  2,044
Correct Success Prediction Rate: 0
predicted =0, Actual = 2044
  
  51
  1,768
Correct Failure Prediction Rate: .02884615
predicted =51, Actual = 1768
 
  0
  2,044
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 2044
 
  0
  1,768
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 1768
===========================================================================
(results probit_1 are active now)
============================================================
Model probit_1 probit unin AGE13X HRWAG13X ACTDTY13 RACETHX if cooksd < 4/_N
============================================================
  0
  2,044
Correct Success Prediction Rate: 0
predicted =0, Actual = 2044
  
  76
  1,768
Correct Failure Prediction Rate: .04298643
predicted =76, Actual = 1768
 
  0
  2,044
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 2044
 
  0
  1,768
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 1768
===========================================================================
(results regress_2 are active now)
============================================================
Model regress_2 regress unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 if cooksd < 4/_N
============================================================
  0
  2,044
Correct Success Prediction Rate: 0
predicted =0, Actual = 2044
  
  88
  1,770
Correct Failure Prediction Rate: .04971751
predicted =88, Actual = 1770
 
  0
  2,044
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 2044
 
  0
  1,770
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 1770
===========================================================================
(results logit_2 are active now)
============================================================
Model logit_2 logit unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 if cooksd < 4/_N
============================================================
  0
  2,044
Correct Success Prediction Rate: 0
predicted =0, Actual = 2044
  
  117
  1,768
Correct Failure Prediction Rate: .06617647
predicted =117, Actual = 1768
 
  0
  2,044
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 2044
 
  2
  1,768
Incorrect Failure Prediction Rate: .00113122
predicted =2, Actual = 1768
===========================================================================
(results probit_2 are active now)
============================================================
Model probit_2 probit unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 if cooksd < 4/_N
============================================================
  0
  2,044
Correct Success Prediction Rate: 0
predicted =0, Actual = 2044
  
  130
  1,768
Correct Failure Prediction Rate: .07352941
predicted =130, Actual = 1768
 
  0
  2,044
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 2044
 
  2
  1,768
Incorrect Failure Prediction Rate: .00113122
predicted =2, Actual = 1768
===========================================================================
(results regress_3 are active now)
============================================================
Model regress_3 regress unin AGE13X ACTDTY13 RACETHX EMPST13 if cooksd < 4/_N
============================================================
  0
  2,044
Correct Success Prediction Rate: 0
predicted =0, Actual = 2044
  
  21
  1,770
Correct Failure Prediction Rate: .01186441
predicted =21, Actual = 1770
 
  0
  2,044
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 2044
 
  0
  1,770
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 1770
===========================================================================
(results logit_3 are active now)
============================================================
Model logit_3 logit unin AGE13X ACTDTY13 RACETHX EMPST13 if cooksd < 4/_N
============================================================
  0
  2,044
Correct Success Prediction Rate: 0
predicted =0, Actual = 2044
  
  0
  1,768
Correct Failure Prediction Rate: 0
predicted =0, Actual = 1768
 
  0
  2,044
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 2044
 
  0
  1,768
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 1768
===========================================================================
(results probit_3 are active now)
============================================================
Model probit_3 probit unin AGE13X ACTDTY13 RACETHX EMPST13 if cooksd < 4/_N
============================================================
  0
  2,044
Correct Success Prediction Rate: 0
predicted =0, Actual = 2044
  
  0
  1,768
Correct Failure Prediction Rate: 0
predicted =0, Actual = 1768
 
  0
  2,044
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 2044
 
  0
  1,768
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 1768
===========================================================================

. 
. 
. 
. 
. forval y = 1/3 {
  2.         matrix accuracy`y' = (predictionregress`y' \ predictionlogit`y' \ predictionprobit`y')
  3.         
.         matrix colnames accuracy`y' = correct_success correct_failure   inaccurate_success inaccurate_failure
  4.         matrix rownames accuracy`x'`y' = REGRESS LOGIT PROBIT
  5.         putexcel set "prediction.csv", sheet(COOKSD`y') modify
  6.         putexcel A1 = matrix(accuracy`x'`y'), names nformat(number_d2)
  7. 
. }
file prediction.csv saved
file prediction.csv saved
file prediction.csv saved

. 
. 
. ********************************************************************************
. ********************************************************************************
. *
. * Weighted, Clustered with household id
. *
. ********************************************************************************
. ********************************************************************************
. 
. global option = "[pweight=WGTRU13], vce(cluster DUID)"

. local list = "regress logit probit"

. 
. cap drop *_uhat* *_yhat*

. 
. foreach x in `list' {
  2. 
. `x' ${depvar} ${model1} ${option}
  3. estimates store `x'_1
  4. predict `x'_uhat1, stdp
  5. predict `x'_yhat1 
  6. 
. `x' ${depvar} ${model2} ${option}
  7. estimates store `x'_2
  8. predict `x'_uhat2, stdp
  9. predict `x'_yhat2 
 10. 
. `x' ${depvar} ${model3} ${option}
 11. estimates store `x'_3
 12. predict `x'_uhat3, stdp
 13. predict `x'_yhat3 
 14. 
. di "==========================================================================="
 15. }
(sum of wgt is 77,660,508.464896)

Linear regression                               Number of obs     =      7,739
                                                F(4, 1951)        =      11.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1224
                                                Root MSE          =     .46839

                               (Std. Err. adjusted for 1,952 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0015305    .000898     1.70   0.088    -.0002307    .0032917
    HRWAG13X |  -.0083931   .0013003    -6.45   0.000    -.0109432    -.005843
    ACTDTY13 |   -.195385   .0433065    -4.51   0.000    -.2803168   -.1104532
     RACETHX |  -.0304136   .0185042    -1.64   0.100    -.0667037    .0058765
       _cons |   1.027126   .1066574     9.63   0.000      .817952    1.236301
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(sum of wgt is 77,660,508.464896)

Linear regression                               Number of obs     =      7,739
                                                F(5, 1951)        =       9.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1306
                                                Root MSE          =     .46622

                               (Std. Err. adjusted for 1,952 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0023518   .0010382     2.27   0.024     .0003156     .004388
    HRWAG13X |  -.0086803   .0013721    -6.33   0.000    -.0113712   -.0059895
    ACTDTY13 |  -.1946403   .0472775    -4.12   0.000    -.2873599   -.1019206
     RACETHX |  -.0324633   .0183277    -1.77   0.077    -.0684073    .0034808
     EMPST13 |  -.0188633   .0063483    -2.97   0.003    -.0313135   -.0064131
       _cons |   1.023528   .1145062     8.94   0.000     .7989604    1.248095
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(sum of wgt is 77,660,508.464896)

Linear regression                               Number of obs     =      7,739
                                                F(4, 1951)        =       7.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0832
                                                Root MSE          =     .47873

                               (Std. Err. adjusted for 1,952 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0011659   .0009092     1.28   0.200    -.0006173     .002949
    ACTDTY13 |  -.1618783   .0345421    -4.69   0.000    -.2296215   -.0941351
     RACETHX |  -.0289091    .018397    -1.57   0.116     -.064989    .0071708
     EMPST13 |  -.0152574   .0061768    -2.47   0.014    -.0273712   -.0031436
       _cons |   .9177963   .0872731    10.52   0.000     .7466379    1.088955
------------------------------------------------------------------------------
(option xb assumed; fitted values)
===========================================================================

Iteration 0:   log pseudolikelihood =  -53800738  
Iteration 1:   log pseudolikelihood =  -47746941  
Iteration 2:   log pseudolikelihood =  -47711712  
Iteration 3:   log pseudolikelihood =  -47711681  
Iteration 4:   log pseudolikelihood =  -47711681  

Logistic regression                             Number of obs     =      7,739
                                                Wald chi2(4)      =     101.27
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -47711681               Pseudo R2         =     0.1132

                               (Std. Err. adjusted for 1,952 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0086679   .0038551     2.25   0.025     .0011121    .0162237
    HRWAG13X |  -.0462242   .0068837    -6.72   0.000     -.059716   -.0327325
    ACTDTY13 |  -1.163061   .1190175    -9.77   0.000    -1.396331   -.9297909
     RACETHX |  -.1450593   .0869666    -1.67   0.095    -.3155106    .0253921
       _cons |   3.059284   .3572513     8.56   0.000     2.359084    3.759483
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood =  -53800738  
Iteration 1:   log pseudolikelihood =  -47103050  
Iteration 2:   log pseudolikelihood =  -46976919  
Iteration 3:   log pseudolikelihood =  -46976621  
Iteration 4:   log pseudolikelihood =  -46976621  

Logistic regression                             Number of obs     =      7,739
                                                Wald chi2(5)      =     112.06
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -46976621               Pseudo R2         =     0.1268

                               (Std. Err. adjusted for 1,952 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0155769   .0041061     3.79   0.000     .0075291    .0236248
    HRWAG13X |  -.0511703   .0072222    -7.09   0.000    -.0653256    -.037015
    ACTDTY13 |  -1.248981   .1255852    -9.95   0.000    -1.495124   -1.002839
     RACETHX |  -.1578871   .0877874    -1.80   0.072    -.3299473    .0141731
     EMPST13 |  -.1435866      .0278    -5.16   0.000    -.1980736   -.0890996
       _cons |   3.255967   .3742899     8.70   0.000     2.522373    3.989562
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood =  -53800738  
Iteration 1:   log pseudolikelihood =  -49762134  
Iteration 2:   log pseudolikelihood =  -49746705  
Iteration 3:   log pseudolikelihood =  -49746703  

Logistic regression                             Number of obs     =      7,739
                                                Wald chi2(4)      =      94.73
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -49746703               Pseudo R2         =     0.0754

                               (Std. Err. adjusted for 1,952 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0064567   .0038073     1.70   0.090    -.0010055    .0139188
    ACTDTY13 |  -.9141013   .1000076    -9.14   0.000    -1.110113   -.7180899
     RACETHX |  -.1254343   .0811974    -1.54   0.122    -.2845782    .0337096
     EMPST13 |  -.0902931   .0246818    -3.66   0.000    -.1386684   -.0419177
       _cons |   2.295198   .3056537     7.51   0.000     1.696128    2.894269
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))
===========================================================================

Iteration 0:   log pseudolikelihood =  -53800738  
Iteration 1:   log pseudolikelihood =  -47909774  
Iteration 2:   log pseudolikelihood =  -47878433  
Iteration 3:   log pseudolikelihood =  -47878426  
Iteration 4:   log pseudolikelihood =  -47878426  

Probit regression                               Number of obs     =      7,739
                                                Wald chi2(4)      =     103.76
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -47878426               Pseudo R2         =     0.1101

                               (Std. Err. adjusted for 1,952 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0053224    .002332     2.28   0.022     .0007518    .0098929
    HRWAG13X |  -.0265109   .0040978    -6.47   0.000    -.0345425   -.0184793
    ACTDTY13 |   -.682678   .0689464    -9.90   0.000    -.8178105   -.5475455
     RACETHX |  -.0836695   .0515637    -1.62   0.105    -.1847326    .0173935
       _cons |   1.785637    .206095     8.66   0.000     1.381698    2.189576
------------------------------------------------------------------------------
Note: 0 failures and 4 successes completely determined.
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood =  -53800738  
Iteration 1:   log pseudolikelihood =  -47235149  
Iteration 2:   log pseudolikelihood =  -47148697  
Iteration 3:   log pseudolikelihood =  -47148561  
Iteration 4:   log pseudolikelihood =  -47148561  

Probit regression                               Number of obs     =      7,739
                                                Wald chi2(5)      =     124.03
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -47148561               Pseudo R2         =     0.1236

                               (Std. Err. adjusted for 1,952 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0093859   .0024569     3.82   0.000     .0045704    .0142013
    HRWAG13X |  -.0290291   .0042236    -6.87   0.000    -.0373072    -.020751
    ACTDTY13 |   -.726027   .0709501   -10.23   0.000    -.8650866   -.5869674
     RACETHX |   -.090115   .0516137    -1.75   0.081     -.191276    .0110459
     EMPST13 |  -.0850902   .0160827    -5.29   0.000    -.1166117   -.0535687
       _cons |   1.879856   .2116199     8.88   0.000     1.465089    2.294623
------------------------------------------------------------------------------
Note: 0 failures and 4 successes completely determined.
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood =  -53800738  
Iteration 1:   log pseudolikelihood =  -49765884  
Iteration 2:   log pseudolikelihood =  -49748678  
Iteration 3:   log pseudolikelihood =  -49748678  

Probit regression                               Number of obs     =      7,739
                                                Wald chi2(4)      =     102.79
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -49748678               Pseudo R2         =     0.0753

                               (Std. Err. adjusted for 1,952 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0042223   .0023417     1.80   0.071    -.0003672    .0088119
    ACTDTY13 |  -.5585324    .059147    -9.44   0.000    -.6744584   -.4426064
     RACETHX |  -.0747157   .0493408    -1.51   0.130    -.1714219    .0219904
     EMPST13 |  -.0570733   .0154505    -3.69   0.000    -.0873558   -.0267909
       _cons |   1.394732    .181132     7.70   0.000      1.03972    1.749744
------------------------------------------------------------------------------
Note: 0 failures and 4 successes completely determined.
(option pr assumed; Pr(unin))
===========================================================================

. 
. 
. local list = "regress logit probit"

. 
. forval x = 1/3 {
  2. 
.         stderr regress_uhat`x' logit_uhat`x' probit_uhat`x' 
  3.         matrix define stderr`x' = (regress_uhat`x', logit_uhat`x' ,probit_uhat`x' )
  4. 
. }
stderr of regress_uhat1 = .04726072
stderr of logit_uhat1 = .17852642
stderr of probit_uhat1 = .10869432
stderr of regress_uhat2 = .04735422
stderr of logit_uhat2 = .17566115
stderr of probit_uhat2 = .10775948
stderr of regress_uhat3 = .04404653
stderr of logit_uhat3 = .17404586
stderr of probit_uhat3 = .10773281

. 
. matrix stderr = stderr1\stderr2\stderr3

. matrix rownames stderr = stderr1 stderr2 stderr

. matrix colnames stderr =  REGRESS LOGIT PROBIT

. 
. putexcel set "output.csv", sheet(WGTCLUS) modify

. putexcel A1 = matrix(stderr), names nformat(number_d2)
file output.csv saved

. 
. 
. capture {
pweights not allowed

. 
. foreach x in `list' {
  2.         estimates table `x'_1 `x'_2 `x'_3 , ///
>           stats(N ll r2_p mrse) b(%7.3f) stfmt(%8.2f)
  3.           
.         sum `x'_yhat1 `x'_yhat2 `x'_yhat3 ${depvar}
  4.         
.         sum `x'_uhat1 `x'_uhat2 `x'_uhat3 ${depvar}
  5. }

-----------------------------------------------
    Variable | regre~_1   regre~_2   regre~_3  
-------------+---------------------------------
      AGE13X |    0.002      0.002      0.001  
    HRWAG13X |   -0.008     -0.009             
    ACTDTY13 |   -0.195     -0.195     -0.162  
     RACETHX |   -0.030     -0.032     -0.029  
     EMPST13 |              -0.019     -0.015  
       _cons |    1.027      1.024      0.918  
-------------+---------------------------------
           N |     7739       7739       7739  
          ll | -5108.92   -5072.59   -5277.91  
        r2_p |                                 
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
regress_yh~1 |      7,892    .4838262    .1660499  -.3413364   2.565322
regress_yh~2 |      7,892    .4830194    .1690484  -.3378004   2.736506
regress_yh~3 |      7,892    .4779653    .1365077   .1358252   2.313307
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
regress_uh~1 |      7,892    .0418579    .0164322    .023334   .4522228
regress_uh~2 |      7,892    .0446675    .0198462   .0234688   .5318009
regress_uh~3 |      7,892      .03882    .0149943   .0233594   .3832099
        unin |      7,892          .5    .5000317          0          1

-----------------------------------------------
    Variable | logit_1    logit_2    logit_3   
-------------+---------------------------------
      AGE13X |    0.009      0.016      0.006  
    HRWAG13X |   -0.046     -0.051             
    ACTDTY13 |   -1.163     -1.249     -0.914  
     RACETHX |   -0.145     -0.158     -0.125  
     EMPST13 |              -0.144     -0.090  
       _cons |    3.059      3.256      2.295  
-------------+---------------------------------
           N |     7739       7739       7739  
          ll | -4.8e+07   -4.7e+07   -5.0e+07  
        r2_p |     0.11       0.13       0.08  
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 logit_yhat1 |      7,892     .484111    .1935782   .0086307   .9999954
 logit_yhat2 |      7,892    .4830581    .2019217   .0066629   .9999995
 logit_yhat3 |      7,892     .476725    .1601317   .1239338   .9999659
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 logit_uhat1 |      7,892    .1666039    .0649732   .0822112   1.242198
 logit_uhat2 |      7,892    .1799297    .0736249    .083249   1.398009
 logit_uhat3 |      7,892    .1518131    .0572122    .081591   1.073757
        unin |      7,892          .5    .5000317          0          1

-----------------------------------------------
    Variable | probit_1   probit_2   probit_3  
-------------+---------------------------------
      AGE13X |    0.005      0.009      0.004  
    HRWAG13X |   -0.027     -0.029             
    ACTDTY13 |   -0.683     -0.726     -0.559  
     RACETHX |   -0.084     -0.090     -0.075  
     EMPST13 |              -0.085     -0.057  
       _cons |    1.786      1.880      1.395  
-------------+---------------------------------
           N |     7739       7739       7739  
          ll | -4.8e+07   -4.7e+07   -5.0e+07  
        r2_p |     0.11       0.12       0.08  
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
probit_yhat1 |      7,892    .4852449     .186575   .0031427          1
probit_yhat2 |      7,892    .4842755    .1952108   .0021958          1
probit_yhat3 |      7,892    .4771839    .1599672   .1182646          1
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
probit_uhat1 |      7,892    .0995281    .0377062   .0504984   .7196042
probit_uhat2 |      7,892    .1063663    .0413329   .0506637   .7785695
probit_uhat3 |      7,892    .0922881    .0337793   .0506703   .6366574
        unin |      7,892          .5    .5000317          0          1

. 
. local list = "regress logit probit"

. 
. forval y = 1/3 {
  2. foreach x in `list' {
  3.         
.                 estimates restore `x'_`y'
  4.                 
.                 noisily di "============================================================"
  5.                 noisily di "Model `x'_`y' " e(cmdline)
  6.                 noisily di "============================================================"
  7. 
.                 count if `x'_yhat`y' > .95 & ${depvar}==1 & e(sample)
  8.                 scalar x = r(N)
  9.                 count if ${depvar}==1 & e(sample)
 10.                 scalar y = r(N)
 11.                 scalar z1 = x/y
 12.                 noisily di "Correct Success Prediction Rate: " z1
 13.                 noisily di "predicted =" x ", Actual = " y
 14. 
.                 noisily di "  "
 15. 
.                 count if `x'_yhat`y'<.05 & ${depvar}==0 & e(sample)
 16.                 scalar x = r(N)
 17.                 count if ${depvar}==0 & e(sample) 
 18.                 scalar y = r(N)
 19.                 scalar z2 = x/y
 20.                 noisily di "Correct Failure Prediction Rate: " z2
 21.                 noisily di "predicted =" x ", Actual = " y
 22. 
.                 noisily di " "
 23.                 
.                 count if `x'_yhat`y'> .95 & ${depvar}==0 & e(sample)
 24.                 scalar x = r(N)
 25.                 count if ${depvar}==1 & e(sample)
 26.                 scalar y = r(N)
 27.                 scalar z3 = x/y
 28.                 noisily di "Incorrect Success Prediction Rate: " z3
 29.                 noisily di "predicted =" x ", Actual = " y
 30. 
.                 noisily di " "
 31.                 
.                 count if `x'_yhat`y'<.05 & ${depvar}==1 & e(sample)
 32.                 scalar x = r(N)
 33.                 count if ${depvar}==0 & e(sample)
 34.                 scalar y = r(N)
 35.                 scalar z4 = x/y
 36.                 noisily di "Incorrect Failure Prediction Rate: " z4
 37.                 noisily di "predicted =" x ", Actual = " y
 38.                 matrix define prediction`x'`y' = (z1, z2, z3, z4)
 39. 
. di "==========================================================================="
 40. }
 41. }
(results regress_1 are active now)
============================================================
Model regress_1 regress unin AGE13X HRWAG13X ACTDTY13 RACETHX [pweight=WGTRU13], vce(cluster DUID)
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  58
  3,882
Correct Failure Prediction Rate: .01494075
predicted =58, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  14
  3,882
Incorrect Failure Prediction Rate: .00360639
predicted =14, Actual = 3882
===========================================================================
(results logit_1 are active now)
============================================================
Model logit_1 logit unin AGE13X HRWAG13X ACTDTY13 RACETHX [pweight=WGTRU13], vce(cluster DUID)
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  41
  3,882
Correct Failure Prediction Rate: .01056157
predicted =41, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  13
  3,882
Incorrect Failure Prediction Rate: .00334879
predicted =13, Actual = 3882
===========================================================================
(results probit_1 are active now)
============================================================
Model probit_1 probit unin AGE13X HRWAG13X ACTDTY13 RACETHX [pweight=WGTRU13], vce(cluster DUID)
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  41
  3,882
Correct Failure Prediction Rate: .01056157
predicted =41, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  13
  3,882
Incorrect Failure Prediction Rate: .00334879
predicted =13, Actual = 3882
===========================================================================
(results regress_2 are active now)
============================================================
Model regress_2 regress unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 [pweight=WGTRU13], vce(cluster DUID)
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  57
  3,882
Correct Failure Prediction Rate: .01468315
predicted =57, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  14
  3,882
Incorrect Failure Prediction Rate: .00360639
predicted =14, Actual = 3882
===========================================================================
(results logit_2 are active now)
============================================================
Model logit_2 logit unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 [pweight=WGTRU13], vce(cluster DUID)
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  44
  3,882
Correct Failure Prediction Rate: .01133436
predicted =44, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  13
  3,882
Incorrect Failure Prediction Rate: .00334879
predicted =13, Actual = 3882
===========================================================================
(results probit_2 are active now)
============================================================
Model probit_2 probit unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 [pweight=WGTRU13], vce(cluster DUID)
============================================================
  7
  3,857
Correct Success Prediction Rate: .00181488
predicted =7, Actual = 3857
  
  46
  3,882
Correct Failure Prediction Rate: .01184956
predicted =46, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  13
  3,882
Incorrect Failure Prediction Rate: .00334879
predicted =13, Actual = 3882
===========================================================================
(results regress_3 are active now)
============================================================
Model regress_3 regress unin AGE13X ACTDTY13 RACETHX EMPST13 [pweight=WGTRU13], vce(cluster DUID)
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  0
  3,882
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  0
  3,882
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3882
===========================================================================
(results logit_3 are active now)
============================================================
Model logit_3 logit unin AGE13X ACTDTY13 RACETHX EMPST13 [pweight=WGTRU13], vce(cluster DUID)
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  0
  3,882
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  0
  3,882
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3882
===========================================================================
(results probit_3 are active now)
============================================================
Model probit_3 probit unin AGE13X ACTDTY13 RACETHX EMPST13 [pweight=WGTRU13], vce(cluster DUID)
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  0
  3,882
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  0
  3,882
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3882
===========================================================================

. 
. 
. 
. 
. forval y = 1/3 {
  2.         matrix accuracy`y' = (predictionregress`y' \ predictionlogit`y' \ predictionprobit`y')  
  3.         matrix colnames accuracy`y' = correct_success correct_failure   inaccurate_success inaccurate_failure
  4.         matrix rownames accuracy`x'`y' = REGRESS LOGIT PROBIT
  5.         putexcel set "prediction.csv", sheet(WGTCLUS`y') modify
  6.         putexcel A1 = matrix(accuracy`x'`y'), names nformat(number_d2)
  7. 
. }
file prediction.csv saved
file prediction.csv saved
file prediction.csv saved

. 
. 
. ********************************************************************************
. ********************************************************************************
. *
. * WEIGHTED ONLY
. * 
. ********************************************************************************
. ********************************************************************************
. 
. cap drop *uhat* *_yhat*

. global option = "[pweight=WGTRU13]"

. 
. local list = "regress logit probit"

. 
. foreach x in `list' {
  2. 
. `x' ${depvar} ${model1} ${option}
  3. estimates store `x'_1
  4. predict `x'_uhat1, stdp
  5. predict `x'_yhat1 
  6. 
. `x' ${depvar} ${model2} ${option}
  7. estimates store `x'_2
  8. predict `x'_uhat2, stdp
  9. predict `x'_yhat2 
 10. 
. `x' ${depvar} ${model3} ${option}
 11. estimates store `x'_3
 12. predict `x'_uhat3, stdp
 13. predict `x'_yhat3 
 14. di "==========================================================================="
 15. }
(sum of wgt is 77,660,508.464896)

Linear regression                               Number of obs     =      7,739
                                                F(4, 7734)        =      57.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1224
                                                Root MSE          =     .46839

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0015305   .0004052     3.78   0.000     .0007363    .0023248
    HRWAG13X |  -.0083931   .0006033   -13.91   0.000    -.0095756   -.0072105
    ACTDTY13 |   -.195385    .021646    -9.03   0.000     -.237817    -.152953
     RACETHX |  -.0304136   .0066381    -4.58   0.000    -.0434262    -.017401
       _cons |   1.027126   .0504093    20.38   0.000     .9283106    1.125942
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(sum of wgt is 77,660,508.464896)

Linear regression                               Number of obs     =      7,739
                                                F(5, 7733)        =      43.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1306
                                                Root MSE          =     .46622

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0023518   .0004886     4.81   0.000     .0013941    .0033095
    HRWAG13X |  -.0086803   .0006448   -13.46   0.000    -.0099444   -.0074163
    ACTDTY13 |  -.1946403   .0236997    -8.21   0.000     -.241098   -.1481825
     RACETHX |  -.0324633   .0066051    -4.91   0.000    -.0454111   -.0195154
     EMPST13 |  -.0188633     .00295    -6.39   0.000    -.0246461   -.0130806
       _cons |   1.023528   .0544688    18.79   0.000     .9167541    1.130301
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(sum of wgt is 77,660,508.464896)

Linear regression                               Number of obs     =      7,739
                                                F(4, 7734)        =      32.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0832
                                                Root MSE          =     .47873

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0011659   .0004113     2.83   0.005     .0003596    .0019721
    ACTDTY13 |  -.1618783   .0172639    -9.38   0.000    -.1957201   -.1280365
     RACETHX |  -.0289091   .0067017    -4.31   0.000    -.0420462    -.015772
     EMPST13 |  -.0152574   .0027578    -5.53   0.000    -.0206635   -.0098513
       _cons |   .9177963   .0403424    22.75   0.000     .8387143    .9968783
------------------------------------------------------------------------------
(option xb assumed; fitted values)
===========================================================================

Iteration 0:   log pseudolikelihood =  -53800738  
Iteration 1:   log pseudolikelihood =  -47746941  
Iteration 2:   log pseudolikelihood =  -47711712  
Iteration 3:   log pseudolikelihood =  -47711681  
Iteration 4:   log pseudolikelihood =  -47711681  

Logistic regression                             Number of obs     =      7,739
                                                Wald chi2(4)      =     570.85
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -47711681               Pseudo R2         =     0.1132

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0086679   .0015979     5.42   0.000      .005536    .0117998
    HRWAG13X |  -.0462242   .0030709   -15.05   0.000    -.0522431   -.0402054
    ACTDTY13 |  -1.163061   .0501268   -23.20   0.000    -1.261308   -1.064814
     RACETHX |  -.1450593   .0308538    -4.70   0.000    -.2055317   -.0845869
       _cons |   3.059284   .1456889    21.00   0.000     2.773739    3.344828
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood =  -53800738  
Iteration 1:   log pseudolikelihood =  -47103050  
Iteration 2:   log pseudolikelihood =  -46976919  
Iteration 3:   log pseudolikelihood =  -46976621  
Iteration 4:   log pseudolikelihood =  -46976621  

Logistic regression                             Number of obs     =      7,739
                                                Wald chi2(5)      =     609.04
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -46976621               Pseudo R2         =     0.1268

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0155769   .0017699     8.80   0.000      .012108    .0190459
    HRWAG13X |  -.0511703   .0032859   -15.57   0.000    -.0576106     -.04473
    ACTDTY13 |  -1.248981   .0528869   -23.62   0.000    -1.352638   -1.145325
     RACETHX |  -.1578871    .031301    -5.04   0.000    -.2192358   -.0965383
     EMPST13 |  -.1435866   .0129271   -11.11   0.000    -.1689233   -.1182499
       _cons |   3.255967   .1525425    21.34   0.000     2.956989    3.554945
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood =  -53800738  
Iteration 1:   log pseudolikelihood =  -49762134  
Iteration 2:   log pseudolikelihood =  -49746705  
Iteration 3:   log pseudolikelihood =  -49746703  

Logistic regression                             Number of obs     =      7,739
                                                Wald chi2(4)      =     530.60
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -49746703               Pseudo R2         =     0.0754

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0064567   .0016205     3.98   0.000     .0032805    .0096329
    ACTDTY13 |  -.9141013   .0428349   -21.34   0.000    -.9980562   -.8301463
     RACETHX |  -.1254343   .0295013    -4.25   0.000    -.1832557   -.0676129
     EMPST13 |  -.0902931   .0108646    -8.31   0.000    -.1115874   -.0689988
       _cons |   2.295198     .12588    18.23   0.000     2.048478    2.541919
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))
===========================================================================

Iteration 0:   log pseudolikelihood =  -53800738  
Iteration 1:   log pseudolikelihood =  -47909774  
Iteration 2:   log pseudolikelihood =  -47878433  
Iteration 3:   log pseudolikelihood =  -47878426  
Iteration 4:   log pseudolikelihood =  -47878426  

Probit regression                               Number of obs     =      7,739
                                                Wald chi2(4)      =     585.93
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -47878426               Pseudo R2         =     0.1101

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0053224   .0009693     5.49   0.000     .0034226    .0072221
    HRWAG13X |  -.0265109   .0018463   -14.36   0.000    -.0301296   -.0228922
    ACTDTY13 |   -.682678   .0291049   -23.46   0.000    -.7397225   -.6256334
     RACETHX |  -.0836695   .0184489    -4.54   0.000    -.1198288   -.0475103
       _cons |   1.785637   .0845703    21.11   0.000     1.619882    1.951391
------------------------------------------------------------------------------
Note: 0 failures and 4 successes completely determined.
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood =  -53800738  
Iteration 1:   log pseudolikelihood =  -47235149  
Iteration 2:   log pseudolikelihood =  -47148697  
Iteration 3:   log pseudolikelihood =  -47148561  
Iteration 4:   log pseudolikelihood =  -47148561  

Probit regression                               Number of obs     =      7,739
                                                Wald chi2(5)      =     661.29
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -47148561               Pseudo R2         =     0.1236

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0093859    .001062     8.84   0.000     .0073044    .0114674
    HRWAG13X |  -.0290291   .0019433   -14.94   0.000    -.0328379   -.0252203
    ACTDTY13 |   -.726027   .0300353   -24.17   0.000    -.7848951   -.6671589
     RACETHX |   -.090115   .0186109    -4.84   0.000    -.1265917   -.0536383
     EMPST13 |  -.0850902   .0075551   -11.26   0.000    -.0998979   -.0702826
       _cons |   1.879856   .0870445    21.60   0.000     1.709252     2.05046
------------------------------------------------------------------------------
Note: 0 failures and 4 successes completely determined.
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood =  -53800738  
Iteration 1:   log pseudolikelihood =  -49765884  
Iteration 2:   log pseudolikelihood =  -49748678  
Iteration 3:   log pseudolikelihood =  -49748678  

Probit regression                               Number of obs     =      7,739
                                                Wald chi2(4)      =     574.36
                                                Prob > chi2       =     0.0000
Log pseudolikelihood =  -49748678               Pseudo R2         =     0.0753

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0042223   .0009959     4.24   0.000     .0022704    .0061742
    ACTDTY13 |  -.5585324   .0253589   -22.03   0.000    -.6082349   -.5088299
     RACETHX |  -.0747157   .0179848    -4.15   0.000    -.1099653   -.0394661
     EMPST13 |  -.0570733   .0068047    -8.39   0.000    -.0704103   -.0437363
       _cons |   1.394732   .0746206    18.69   0.000     1.248478    1.540985
------------------------------------------------------------------------------
Note: 0 failures and 4 successes completely determined.
(option pr assumed; Pr(unin))
===========================================================================

. 
. local list = "regress logit probit"

. 
. forval x = 1/3 {
  2. 
.         stderr regress_uhat`x' logit_uhat`x' probit_uhat`x' 
  3.         matrix define stderr`x' = (regress_uhat`x', logit_uhat`x' ,probit_uhat`x' )
  4. 
. }
stderr of regress_uhat1 = .02215538
stderr of logit_uhat1 = .07280424
stderr of probit_uhat1 = .04449131
stderr of regress_uhat2 = .02231462
stderr of logit_uhat2 = .07184773
stderr of probit_uhat2 = .04424062
stderr of regress_uhat3 = .02008281
stderr of logit_uhat3 = .07118943
stderr of probit_uhat3 = .04408602

. 
. matrix stderr = stderr1\stderr2\stderr3

. matrix rownames stderr = stderr1 stderr2 stderr

. matrix colnames stderr =  REGRESS LOGIT PROBIT

. 
. putexcel set "output.csv", sheet(WEIGHTED) modify

. putexcel A1 = matrix(stderr), names nformat(number_d2)
file output.csv saved

. 
.  
. capture {
pweights not allowed

. 
. local list = "regress logit probit"

. foreach x in `list' {
  2.         estimates table `x'_1 `x'_2 `x'_3, ///
>           stats(N ll r2_p mrse) b(%7.3f) stfmt(%8.2f)
  3.           
.         sum `x'_yhat1 `x'_yhat2 `x'_yhat3 ${depvar}
  4.         
.         sum `x'_uhat1 `x'_uhat2 `x'_uhat3 
  5.         di "==========================================================================="
  6. }

-----------------------------------------------
    Variable | regre~_1   regre~_2   regre~_3  
-------------+---------------------------------
      AGE13X |    0.002      0.002      0.001  
    HRWAG13X |   -0.008     -0.009             
    ACTDTY13 |   -0.195     -0.195     -0.162  
     RACETHX |   -0.030     -0.032     -0.029  
     EMPST13 |              -0.019     -0.015  
       _cons |    1.027      1.024      0.918  
-------------+---------------------------------
           N |     7739       7739       7739  
          ll | -5108.92   -5072.59   -5277.91  
        r2_p |                                 
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
regress_yh~1 |      7,892    .4838262    .1660499  -.3413364   2.565322
regress_yh~2 |      7,892    .4830194    .1690484  -.3378004   2.736506
regress_yh~3 |      7,892    .4779653    .1365077   .1358252   2.313307
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
regress_uh~1 |      7,892    .0187888    .0080045   .0099307   .2252676
regress_uh~2 |      7,892    .0201725    .0098595   .0098293   .2657091
regress_uh~3 |      7,892     .017046    .0071292   .0098007   .1905658
===========================================================================

-----------------------------------------------
    Variable | logit_1    logit_2    logit_3   
-------------+---------------------------------
      AGE13X |    0.009      0.016      0.006  
    HRWAG13X |   -0.046     -0.051             
    ACTDTY13 |   -1.163     -1.249     -0.914  
     RACETHX |   -0.145     -0.158     -0.125  
     EMPST13 |              -0.144     -0.090  
       _cons |    3.059      3.256      2.295  
-------------+---------------------------------
           N |     7739       7739       7739  
          ll | -4.8e+07   -4.7e+07   -5.0e+07  
        r2_p |     0.11       0.13       0.08  
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 logit_yhat1 |      7,892     .484111    .1935782   .0086307   .9999954
 logit_yhat2 |      7,892    .4830581    .2019217   .0066629   .9999995
 logit_yhat3 |      7,892     .476725    .1601317   .1239338   .9999659
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 logit_uhat1 |      7,892    .0682808    .0270103   .0338312   .5237454
 logit_uhat2 |      7,892    .0747055    .0319406   .0343592    .596547
 logit_uhat3 |      7,892    .0618558    .0232568   .0336001   .4577004
===========================================================================

-----------------------------------------------
    Variable | probit_1   probit_2   probit_3  
-------------+---------------------------------
      AGE13X |    0.005      0.009      0.004  
    HRWAG13X |   -0.027     -0.029             
    ACTDTY13 |   -0.683     -0.726     -0.559  
     RACETHX |   -0.084     -0.090     -0.075  
     EMPST13 |              -0.085     -0.057  
       _cons |    1.786      1.880      1.395  
-------------+---------------------------------
           N |     7739       7739       7739  
          ll | -4.8e+07   -4.7e+07   -5.0e+07  
        r2_p |     0.11       0.12       0.08  
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
probit_yhat1 |      7,892    .4852449     .186575   .0031427          1
probit_yhat2 |      7,892    .4842755    .1952108   .0021958          1
probit_yhat3 |      7,892    .4771839    .1599672   .1182646          1
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
probit_uhat1 |      7,892    .0409026    .0157774   .0207707   .3038804
probit_uhat2 |      7,892    .0443673    .0181313   .0210091   .3346244
probit_uhat3 |      7,892    .0376157    .0137199    .020861   .2719247
===========================================================================

. 
. 
. 
. local list = "regress logit probit"

. 
. forval y = 1/3 {
  2. foreach x in `list' {
  3.         
.                 estimates restore `x'_`y'
  4.                 
.                 noisily di "============================================================"
  5.                 noisily di "Model `x'_`y' " e(cmdline)
  6.                 noisily di "============================================================"
  7. 
.                 count if `x'_yhat`y' > .95 & ${depvar}==1 & e(sample)
  8.                 scalar x = r(N)
  9.                 count if ${depvar}==1 & e(sample)
 10.                 scalar y = r(N)
 11.                 scalar z1 = x/y
 12.                 noisily di "Correct Success Prediction Rate: " z1
 13.                 noisily di "predicted =" x ", Actual = " y
 14. 
.                 noisily di "  "
 15. 
.                 count if `x'_yhat`y'<.05 & ${depvar}==0 & e(sample)
 16.                 scalar x = r(N)
 17.                 count if ${depvar}==0 & e(sample) 
 18.                 scalar y = r(N)
 19.                 scalar z2 = x/y
 20.                 noisily di "Correct Failure Prediction Rate: " z2
 21.                 noisily di "predicted =" x ", Actual = " y
 22. 
.                 noisily di " "
 23.                 
.                 count if `x'_yhat`y'> .95 & ${depvar}==0 & e(sample)
 24.                 scalar x = r(N)
 25.                 count if ${depvar}==1 & e(sample)
 26.                 scalar y = r(N)
 27.                 scalar z3 = x/y
 28.                 noisily di "Incorrect Success Prediction Rate: " z3
 29.                 noisily di "predicted =" x ", Actual = " y
 30. 
.                 noisily di " "
 31.                 
.                 count if `x'_yhat`y'<.05 & ${depvar}==1 & e(sample)
 32.                 scalar x = r(N)
 33.                 count if ${depvar}==0 & e(sample)
 34.                 scalar y = r(N)
 35.                 scalar z4 = x/y
 36.                 noisily di "Incorrect Failure Prediction Rate: " z4
 37.                 noisily di "predicted =" x ", Actual = " y
 38.                 matrix define prediction`x'`y' = (z1, z2, z3, z4)
 39. 
. di "==========================================================================="
 40. }
 41. }
(results regress_1 are active now)
============================================================
Model regress_1 regress unin AGE13X HRWAG13X ACTDTY13 RACETHX [pweight=WGTRU13]
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  58
  3,882
Correct Failure Prediction Rate: .01494075
predicted =58, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  14
  3,882
Incorrect Failure Prediction Rate: .00360639
predicted =14, Actual = 3882
===========================================================================
(results logit_1 are active now)
============================================================
Model logit_1 logit unin AGE13X HRWAG13X ACTDTY13 RACETHX [pweight=WGTRU13]
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  41
  3,882
Correct Failure Prediction Rate: .01056157
predicted =41, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  13
  3,882
Incorrect Failure Prediction Rate: .00334879
predicted =13, Actual = 3882
===========================================================================
(results probit_1 are active now)
============================================================
Model probit_1 probit unin AGE13X HRWAG13X ACTDTY13 RACETHX [pweight=WGTRU13]
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  41
  3,882
Correct Failure Prediction Rate: .01056157
predicted =41, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  13
  3,882
Incorrect Failure Prediction Rate: .00334879
predicted =13, Actual = 3882
===========================================================================
(results regress_2 are active now)
============================================================
Model regress_2 regress unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 [pweight=WGTRU13]
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  57
  3,882
Correct Failure Prediction Rate: .01468315
predicted =57, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  14
  3,882
Incorrect Failure Prediction Rate: .00360639
predicted =14, Actual = 3882
===========================================================================
(results logit_2 are active now)
============================================================
Model logit_2 logit unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 [pweight=WGTRU13]
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  44
  3,882
Correct Failure Prediction Rate: .01133436
predicted =44, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  13
  3,882
Incorrect Failure Prediction Rate: .00334879
predicted =13, Actual = 3882
===========================================================================
(results probit_2 are active now)
============================================================
Model probit_2 probit unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 [pweight=WGTRU13]
============================================================
  7
  3,857
Correct Success Prediction Rate: .00181488
predicted =7, Actual = 3857
  
  46
  3,882
Correct Failure Prediction Rate: .01184956
predicted =46, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  13
  3,882
Incorrect Failure Prediction Rate: .00334879
predicted =13, Actual = 3882
===========================================================================
(results regress_3 are active now)
============================================================
Model regress_3 regress unin AGE13X ACTDTY13 RACETHX EMPST13 [pweight=WGTRU13]
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  0
  3,882
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  0
  3,882
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3882
===========================================================================
(results logit_3 are active now)
============================================================
Model logit_3 logit unin AGE13X ACTDTY13 RACETHX EMPST13 [pweight=WGTRU13]
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  0
  3,882
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  0
  3,882
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3882
===========================================================================
(results probit_3 are active now)
============================================================
Model probit_3 probit unin AGE13X ACTDTY13 RACETHX EMPST13 [pweight=WGTRU13]
============================================================
  4
  3,857
Correct Success Prediction Rate: .00103708
predicted =4, Actual = 3857
  
  0
  3,882
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3882
 
  0
  3,857
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3857
 
  0
  3,882
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3882
===========================================================================

. 
. 
. 
. 
. forval y = 1/3 {
  2.                 matrix accuracy`y' = (predictionregress`y' \ predictionlogit`y' \ predictionprobit`y')
  3.         matrix colnames accuracy`y' = correct_success correct_failure   inaccurate_success inaccurate_failure
  4.         matrix rownames accuracy`x'`y' = REGRESS LOGIT PROBIT
  5.         putexcel set "prediction.csv", sheet(WGT`y') modify
  6.         putexcel A1 = matrix(accuracy`x'`y'), names nformat(number_d2)
  7. 
. }
file prediction.csv saved
file prediction.csv saved
file prediction.csv saved

. 
. 
. 
. 
. ********************************************************************************
. ********************************************************************************
. *
. * Clustered Only
. *
. ********************************************************************************
. ********************************************************************************
. cap drop *_uhat* *_yhat*

. 
. global option = ", vce(cluster DUID)"

. 
. local list = "regress logit probit"

. 
. 
. foreach x in `list' {
  2. 
. `x' ${depvar} ${model1} ${option}
  3. estimates store `x'_1
  4. predict `x'_uhat1, stdp
  5. predict `x'_yhat1 
  6. 
. `x' ${depvar} ${model2} ${option}
  7. estimates store `x'_2
  8. predict `x'_uhat2, stdp
  9. predict `x'_yhat2 
 10. 
. `x' ${depvar} ${model3} ${option}
 11. estimates store `x'_3
 12. predict `x'_uhat3, stdp
 13. predict `x'_yhat3 
 14. di "==========================================================================="
 15. }

Linear regression                               Number of obs     =      7,892
                                                F(4, 1993)        =      32.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1405
                                                Root MSE          =      .4637

                               (Std. Err. adjusted for 1,994 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0011477   .0006943     1.65   0.099     -.000214    .0025094
    HRWAG13X |   -.008325   .0009906    -8.40   0.000    -.0102678   -.0063823
    ACTDTY13 |  -.2182948   .0247076    -8.84   0.000    -.2667502   -.1698394
     RACETHX |  -.0514958   .0137157    -3.75   0.000    -.0783943   -.0245972
       _cons |    1.15783    .063983    18.10   0.000      1.03235    1.283311
------------------------------------------------------------------------------
(option xb assumed; fitted values)

Linear regression                               Number of obs     =      7,892
                                                F(5, 1993)        =      25.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1491
                                                Root MSE          =     .46138

                               (Std. Err. adjusted for 1,994 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0021572    .000761     2.83   0.005     .0006648    .0036497
    HRWAG13X |  -.0087759   .0010122    -8.67   0.000    -.0107609   -.0067908
    ACTDTY13 |  -.2223816   .0265602    -8.37   0.000    -.2744704   -.1702929
     RACETHX |  -.0523574   .0137067    -3.82   0.000    -.0792384   -.0254763
     EMPST13 |  -.0200779   .0045464    -4.42   0.000     -.028994   -.0111618
       _cons |    1.16014    .067088    17.29   0.000      1.02857     1.29171
------------------------------------------------------------------------------
(option xb assumed; fitted values)

Linear regression                               Number of obs     =      7,892
                                                F(4, 1993)        =      27.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1040
                                                Root MSE          =     .47344

                               (Std. Err. adjusted for 1,994 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |    .000789   .0007137     1.11   0.269    -.0006107    .0021887
    ACTDTY13 |  -.1837356    .021066    -8.72   0.000    -.2250494   -.1424218
     RACETHX |  -.0506313   .0140228    -3.61   0.000    -.0781321   -.0231305
     EMPST13 |  -.0147126   .0048336    -3.04   0.002     -.024192   -.0052332
       _cons |   1.052536   .0566452    18.58   0.000     .9414464    1.163626
------------------------------------------------------------------------------
(option xb assumed; fitted values)
===========================================================================

Iteration 0:   log pseudolikelihood = -5470.3175  
Iteration 1:   log pseudolikelihood = -4822.5106  
Iteration 2:   log pseudolikelihood = -4819.1638  
Iteration 3:   log pseudolikelihood = -4819.1625  
Iteration 4:   log pseudolikelihood = -4819.1625  

Logistic regression                             Number of obs     =      7,892
                                                Wald chi2(4)      =     132.94
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -4819.1625               Pseudo R2         =     0.1190

                               (Std. Err. adjusted for 1,994 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0060638   .0030942     1.96   0.050    -7.25e-07    .0121283
    HRWAG13X |  -.0449912   .0059717    -7.53   0.000    -.0566955   -.0332869
    ACTDTY13 |   -1.14184   .1038489   -11.00   0.000     -1.34538   -.9382999
     RACETHX |  -.2392406   .0650587    -3.68   0.000    -.3667532   -.1117279
       _cons |   3.360466   .3053126    11.01   0.000     2.762064    3.958868
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood = -5470.3175  
Iteration 1:   log pseudolikelihood = -4763.1557  
Iteration 2:   log pseudolikelihood = -4759.6507  
Iteration 3:   log pseudolikelihood = -4759.6491  
Iteration 4:   log pseudolikelihood = -4759.6491  

Logistic regression                             Number of obs     =      7,892
                                                Wald chi2(5)      =     139.47
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -4759.6491               Pseudo R2         =     0.1299

                               (Std. Err. adjusted for 1,994 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0129216   .0033512     3.86   0.000     .0063534    .0194898
    HRWAG13X |  -.0498148   .0063025    -7.90   0.000    -.0621676   -.0374621
    ACTDTY13 |  -1.220215   .1098781   -11.11   0.000    -1.435572   -1.004858
     RACETHX |   -.243123   .0658501    -3.69   0.000    -.3721869   -.1140591
     EMPST13 |  -.1298485   .0249106    -5.21   0.000    -.1786724   -.0810246
       _cons |    3.50746   .3177639    11.04   0.000     2.884654    4.130265
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood = -5470.3175  
Iteration 1:   log pseudolikelihood = -5009.0558  
Iteration 2:   log pseudolikelihood = -5005.3992  
Iteration 3:   log pseudolikelihood = -5005.3939  
Iteration 4:   log pseudolikelihood = -5005.3939  

Logistic regression                             Number of obs     =      7,892
                                                Wald chi2(4)      =     121.87
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -5005.3939               Pseudo R2         =     0.0850

                               (Std. Err. adjusted for 1,994 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0038088   .0031035     1.23   0.220    -.0022741    .0098916
    ACTDTY13 |  -.9091205   .0888356   -10.23   0.000    -1.083235    -.735006
     RACETHX |  -.2193944   .0634193    -3.46   0.001    -.3436939    -.095095
     EMPST13 |  -.0779394   .0219624    -3.55   0.000    -.1209848   -.0348939
       _cons |   2.658319   .2623786    10.13   0.000     2.144067    3.172572
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))
===========================================================================

Iteration 0:   log pseudolikelihood = -5470.3175  
Iteration 1:   log pseudolikelihood = -4837.7115  
Iteration 2:   log pseudolikelihood = -4833.6047  
Iteration 3:   log pseudolikelihood = -4833.6039  
Iteration 4:   log pseudolikelihood = -4833.6039  

Probit regression                               Number of obs     =      7,892
                                                Wald chi2(4)      =     136.43
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -4833.6039               Pseudo R2         =     0.1164

                               (Std. Err. adjusted for 1,994 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0036704   .0018817     1.95   0.051    -.0000176    .0073583
    HRWAG13X |  -.0258585   .0036525    -7.08   0.000    -.0330172   -.0186998
    ACTDTY13 |  -.6730292    .060594   -11.11   0.000    -.7917912   -.5542672
     RACETHX |  -.1417392   .0390539    -3.63   0.000    -.2182834    -.065195
       _cons |   1.982361   .1775535    11.16   0.000     1.634362    2.330359
------------------------------------------------------------------------------
Note: 0 failures and 6 successes completely determined.
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood = -5470.3175  
Iteration 1:   log pseudolikelihood = -4781.8787  
Iteration 2:   log pseudolikelihood = -4774.3918  
Iteration 3:   log pseudolikelihood = -4774.3903  
Iteration 4:   log pseudolikelihood = -4774.3903  

Probit regression                               Number of obs     =      7,892
                                                Wald chi2(5)      =     151.56
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -4774.3903               Pseudo R2         =     0.1272

                               (Std. Err. adjusted for 1,994 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0077013   .0020084     3.83   0.000      .003765    .0116377
    HRWAG13X |  -.0284073   .0037856    -7.50   0.000    -.0358269   -.0209876
    ACTDTY13 |  -.7139996   .0627509   -11.38   0.000    -.8369891     -.59101
     RACETHX |  -.1433399   .0393859    -3.64   0.000    -.2205348    -.066145
     EMPST13 |  -.0770525     .01442    -5.34   0.000     -.105315   -.0487899
       _cons |   2.054214   .1822422    11.27   0.000     1.697026    2.411403
------------------------------------------------------------------------------
Note: 0 failures and 6 successes completely determined.
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood = -5470.3175  
Iteration 1:   log pseudolikelihood = -5009.0036  
Iteration 2:   log pseudolikelihood = -5006.5777  
Iteration 3:   log pseudolikelihood = -5006.5773  

Probit regression                               Number of obs     =      7,892
                                                Wald chi2(4)      =     132.57
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -5006.5773               Pseudo R2         =     0.0848

                               (Std. Err. adjusted for 1,994 clusters in DUID)
------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0025363    .001911     1.33   0.184    -.0012092    .0062819
    ACTDTY13 |  -.5546073   .0524909   -10.57   0.000    -.6574876    -.451727
     RACETHX |  -.1326505   .0386406    -3.43   0.001    -.2083847   -.0569163
     EMPST13 |  -.0489703    .013696    -3.58   0.000    -.0758139   -.0221267
       _cons |    1.61884   .1553148    10.42   0.000     1.314429    1.923252
------------------------------------------------------------------------------
Note: 0 failures and 4 successes completely determined.
(option pr assumed; Pr(unin))
===========================================================================

. 
. 
. local list = "regress logit probit"

. 
. forval x = 1/3 {
  2. 
.         stderr regress_uhat`x' logit_uhat`x' probit_uhat`x' 
  3.         matrix define stderr`x' = (regress_uhat`x', logit_uhat`x' ,probit_uhat`x' )
  4. 
. }
stderr of regress_uhat1 = .03456085
stderr of logit_uhat1 = .14351645
stderr of probit_uhat1 = .08818091
stderr of regress_uhat2 = .03478982
stderr of logit_uhat2 = .14182596
stderr of probit_uhat2 = .08752307
stderr of regress_uhat3 = .03376556
stderr of logit_uhat3 = .14065199
stderr of probit_uhat3 = .08746749

. 
. matrix stderr = stderr1\stderr2\stderr3

. matrix rownames stderr = stderr1 stderr2 stderr

. matrix colnames stderr =  REGRESS LOGIT PROBIT

. 
. putexcel set "output.csv", sheet(CLUSTERED) modify

. putexcel A1 = matrix(stderr), names nformat(number_d2)
file output.csv saved

. 
. capture {

Probit model for unin

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |      2934          1854  |       4788
     -     |      1012          2092  |       3104
-----------+--------------------------+-----------
   Total   |      3946          3946  |       7892

Classified + if predicted Pr(D) >= .5
True D defined as unin != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   74.35%
Specificity                     Pr( -|~D)   53.02%
Positive predictive value       Pr( D| +)   61.28%
Negative predictive value       Pr(~D| -)   67.40%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   46.98%
False - rate for true D         Pr( -| D)   25.65%
False + rate for classified +   Pr(~D| +)   38.72%
False - rate for classified -   Pr( D| -)   32.60%
--------------------------------------------------
Correctly classified                        63.68%
--------------------------------------------------

Probit model for unin, goodness-of-fit test

       number of observations =      7892
 number of covariate patterns =       631
            Pearson chi2(626) =      3104.24
                  Prob > chi2 =         0.0000

Probit model for unin, goodness-of-fit test

  (Table collapsed on quantiles of estimated probabilities)

       number of observations =      7892
             number of groups =        10
      Hosmer-Lemeshow chi2(8) =       237.53
                  Prob > chi2 =         0.0000

Probit model for unin, goodness-of-fit test

  (Table collapsed on quantiles of estimated probabilities)
  +--------------------------------------------------------+
  | Group |   Prob | Obs_1 | Exp_1 | Obs_0 | Exp_0 | Total |
  |-------+--------+-------+-------+-------+-------+-------|
  |     1 | 0.1990 |   138 | 145.7 |   687 | 679.3 |   825 |
  |     2 | 0.3572 |   214 | 199.4 |   546 | 560.6 |   760 |
  |     3 | 0.4508 |   292 | 318.3 |   491 | 464.7 |   783 |
  |     4 | 0.5038 |   406 | 371.4 |   384 | 418.6 |   790 |
  |     5 | 0.5616 |   469 | 425.8 |   320 | 363.2 |   789 |
  |-------+--------+-------+-------+-------+-------+-------|
  |     6 | 0.5972 |   481 | 461.9 |   317 | 336.1 |   798 |
  |     7 | 0.6138 |   413 | 490.5 |   396 | 318.5 |   809 |
  |     8 | 0.6330 |   350 | 498.0 |   448 | 300.0 |   798 |
  |     9 | 0.6634 |   581 | 527.1 |   226 | 279.9 |   807 |
  |    10 | 1.0000 |   602 | 513.9 |   131 | 219.1 |   733 |
  +--------------------------------------------------------+

       number of observations =      7892
             number of groups =        10
      Hosmer-Lemeshow chi2(8) =       237.53
                  Prob > chi2 =         0.0000

. 
. foreach x in `list' {
  2.         estimates table `x'_1 `x'_2 `x'_3, ///
>           stats(N ll r2_p mrse) b(%7.3f) stfmt(%8.2f)
  3.           
.         sum `x'_yhat1 `x'_yhat2 `x'_yhat3 ${depvar}
  4. 
. }

-----------------------------------------------
    Variable | regre~_1   regre~_2   regre~_3  
-------------+---------------------------------
      AGE13X |    0.001      0.002      0.001  
    HRWAG13X |   -0.008     -0.009             
    ACTDTY13 |   -0.218     -0.222     -0.184  
     RACETHX |   -0.051     -0.052     -0.051  
     EMPST13 |              -0.020     -0.015  
       _cons |    1.158      1.160      1.053  
-------------+---------------------------------
           N |     7892       7892       7892  
          ll | -5130.68   -5090.61   -5294.71  
        r2_p |                                 
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
regress_yh~1 |      7,892          .5    .1874032  -.3837273   2.830181
regress_yh~2 |      7,892          .5    .1931088  -.3914137   3.062785
regress_yh~3 |      7,892          .5    .1612387   .0537162   2.567774
        unin |      7,892          .5    .5000317          0          1

-----------------------------------------------
    Variable | logit_1    logit_2    logit_3   
-------------+---------------------------------
      AGE13X |    0.006      0.013      0.004  
    HRWAG13X |   -0.045     -0.050             
    ACTDTY13 |   -1.142     -1.220     -0.909  
     RACETHX |   -0.239     -0.243     -0.219  
     EMPST13 |              -0.130     -0.078  
       _cons |    3.360      3.507      2.658  
-------------+---------------------------------
           N |     7892       7892       7892  
          ll | -4819.16   -4759.65   -5005.39  
        r2_p |     0.12       0.13       0.08  
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 logit_yhat1 |      7,892          .5    .1964729   .0089229   .9999948
 logit_yhat2 |      7,892          .5    .2036105   .0070731   .9999993
 logit_yhat3 |      7,892          .5    .1670197    .103906   .9999651
        unin |      7,892          .5    .5000317          0          1

-----------------------------------------------
    Variable | probit_1   probit_2   probit_3  
-------------+---------------------------------
      AGE13X |    0.004      0.008      0.003  
    HRWAG13X |   -0.026     -0.028             
    ACTDTY13 |   -0.673     -0.714     -0.555  
     RACETHX |   -0.142     -0.143     -0.133  
     EMPST13 |              -0.077     -0.049  
       _cons |    1.982      2.054      1.619  
-------------+---------------------------------
           N |     7892       7892       7892  
          ll | -4833.60   -4774.39   -5006.58  
        r2_p |     0.12       0.13       0.08  
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
probit_yhat1 |      7,892    .5014338    .1904952   .0032166          1
probit_yhat2 |      7,892    .5015787    .1978466   .0022893          1
probit_yhat3 |      7,892    .5007737    .1663704   .0961157          1
        unin |      7,892          .5    .5000317          0          1

. 
. 
. local list = "regress logit probit"

. 
. forval y = 1/3 {
  2. foreach x in `list' {
  3.         
.                 estimates restore `x'_`y'
  4.                 
.                 noisily di "============================================================"
  5.                 noisily di "Model `x'_`y' " e(cmdline)
  6.                 noisily di "============================================================"
  7. 
.                 count if `x'_yhat`y' > .95 & ${depvar}==1 & e(sample)
  8.                 scalar x = r(N)
  9.                 count if ${depvar}==1 & e(sample)
 10.                 scalar y = r(N)
 11.                 scalar z1 = x/y
 12.                 noisily di "Correct Success Prediction Rate: " z1
 13.                 noisily di "predicted =" x ", Actual = " y
 14. 
.                 noisily di "  "
 15. 
.                 count if `x'_yhat`y'<.05 & ${depvar}==0 & e(sample)
 16.                 scalar x = r(N)
 17.                 count if ${depvar}==0 & e(sample) 
 18.                 scalar y = r(N)
 19.                 scalar z2 = x/y
 20.                 noisily di "Correct Failure Prediction Rate: " z2
 21.                 noisily di "predicted =" x ", Actual = " y
 22. 
.                 noisily di " "
 23.                 
.                 count if `x'_yhat`y'> .95 & ${depvar}==0 & e(sample)
 24.                 scalar x = r(N)
 25.                 count if ${depvar}==1 & e(sample)
 26.                 scalar y = r(N)
 27.                 scalar z3 = x/y
 28.                 noisily di "Incorrect Success Prediction Rate: " z3
 29.                 noisily di "predicted =" x ", Actual = " y
 30. 
.                 noisily di " "
 31.                 
.                 count if `x'_yhat`y'<.05 & ${depvar}==1 & e(sample)
 32.                 scalar x = r(N)
 33.                 count if ${depvar}==0 & e(sample)
 34.                 scalar y = r(N)
 35.                 scalar z4 = x/y
 36.                 noisily di "Incorrect Failure Prediction Rate: " z4
 37.                 noisily di "predicted =" x ", Actual = " y
 38.                 matrix define prediction`x'`y' = (z1, z2, z3, z4)
 39. 
. di "==========================================================================="
 40. }
 41. }
(results regress_1 are active now)
============================================================
Model regress_1 regress unin AGE13X HRWAG13X ACTDTY13 RACETHX , vce(cluster DUID)
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  82
  3,946
Correct Failure Prediction Rate: .02078054
predicted =82, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  23
  3,946
Incorrect Failure Prediction Rate: .00582869
predicted =23, Actual = 3946
===========================================================================
(results logit_1 are active now)
============================================================
Model logit_1 logit unin AGE13X HRWAG13X ACTDTY13 RACETHX , vce(cluster DUID)
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  38
  3,946
Correct Failure Prediction Rate: .00963001
predicted =38, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results probit_1 are active now)
============================================================
Model probit_1 probit unin AGE13X HRWAG13X ACTDTY13 RACETHX , vce(cluster DUID)
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  44
  3,946
Correct Failure Prediction Rate: .01115053
predicted =44, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results regress_2 are active now)
============================================================
Model regress_2 regress unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 , vce(cluster DUID)
============================================================
  12
  3,946
Correct Success Prediction Rate: .00304105
predicted =12, Actual = 3946
  
  69
  3,946
Correct Failure Prediction Rate: .01748606
predicted =69, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  23
  3,946
Incorrect Failure Prediction Rate: .00582869
predicted =23, Actual = 3946
===========================================================================
(results logit_2 are active now)
============================================================
Model logit_2 logit unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 , vce(cluster DUID)
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  44
  3,946
Correct Failure Prediction Rate: .01115053
predicted =44, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results probit_2 are active now)
============================================================
Model probit_2 probit unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 , vce(cluster DUID)
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  44
  3,946
Correct Failure Prediction Rate: .01115053
predicted =44, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results regress_3 are active now)
============================================================
Model regress_3 regress unin AGE13X ACTDTY13 RACETHX EMPST13 , vce(cluster DUID)
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  0
  3,946
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3946
===========================================================================
(results logit_3 are active now)
============================================================
Model logit_3 logit unin AGE13X ACTDTY13 RACETHX EMPST13 , vce(cluster DUID)
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  0
  3,946
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3946
===========================================================================
(results probit_3 are active now)
============================================================
Model probit_3 probit unin AGE13X ACTDTY13 RACETHX EMPST13 , vce(cluster DUID)
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  0
  3,946
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3946
===========================================================================

. 
. 
. 
. forval y = 1/3 {
  2.         matrix accuracy`y' = (predictionregress`y' \ predictionlogit`y' \ predictionprobit`y')
  3.         matrix colnames accuracy`y' = correct_success correct_failure   inaccurate_success inaccurate_failure
  4.         matrix rownames accuracy`x'`y' = REGRESS LOGIT PROBIT
  5.         putexcel set "prediction.csv", sheet(CLUSTERED`y') modify
  6.         putexcel A1 = matrix(accuracy`x'`y'), names nformat(number_d2)
  7. 
. }
file prediction.csv saved
file prediction.csv saved
file prediction.csv saved

. 
. 
. 
. ********************************************************************************
. ********************************************************************************
. *
. * NO OPTIONS
. *
. ********************************************************************************
. *********************************************************************************
. 
. cap drop *uhat* *_yhat*

. 
. global option = " "

. 
. local list = "regress logit probit"

. 
. 
. foreach x in `list' {
  2. 
. `x' ${depvar} ${model1} ${option}
  3. estimates store `x'_1
  4. predict `x'_uhat1, stdp
  5. predict `x'_yhat1 
  6. 
. `x' ${depvar} ${model2} ${option}
  7. estimates store `x'_2
  8. predict `x'_uhat2, stdp
  9. predict `x'_yhat2 
 10. 
. `x' ${depvar} ${model3} ${option}
 11. estimates store `x'_3
 12. predict `x'_uhat3, stdp
 13. predict `x'_yhat3 
 14. di "==========================================================================="
 15. }

      Source |       SS           df       MS      Number of obs   =     7,892
-------------+----------------------------------   F(4, 7887)      =    322.21
       Model |   277.13152         4    69.28288   Prob > F        =    0.0000
    Residual |  1695.86848     7,887  .215020728   R-squared       =    0.1405
-------------+----------------------------------   Adj R-squared   =    0.1400
       Total |        1973     7,891  .250031682   Root MSE        =     .4637

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0011477   .0002747     4.18   0.000     .0006093    .0016861
    HRWAG13X |   -.008325   .0004281   -19.45   0.000    -.0091642   -.0074858
    ACTDTY13 |  -.2182948   .0070502   -30.96   0.000    -.2321151   -.2044746
     RACETHX |  -.0514958   .0052234    -9.86   0.000    -.0617351   -.0412564
       _cons |    1.15783   .0207959    55.68   0.000     1.117065    1.198596
------------------------------------------------------------------------------
(option xb assumed; fitted values)

      Source |       SS           df       MS      Number of obs   =     7,892
-------------+----------------------------------   F(5, 7886)      =    276.47
       Model |  294.263448         5  58.8526896   Prob > F        =    0.0000
    Residual |  1678.73655     7,886  .212875546   R-squared       =    0.1491
-------------+----------------------------------   Adj R-squared   =    0.1486
       Total |        1973     7,891  .250031682   Root MSE        =    .46138

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0021572   .0002955     7.30   0.000     .0015779    .0027366
    HRWAG13X |  -.0087759   .0004289   -20.46   0.000    -.0096167   -.0079351
    ACTDTY13 |  -.2223816   .0070297   -31.63   0.000    -.2361617   -.2086016
     RACETHX |  -.0523574   .0051982   -10.07   0.000    -.0625472   -.0421675
     EMPST13 |  -.0200779   .0022381    -8.97   0.000    -.0244651   -.0156906
       _cons |    1.16014   .0206935    56.06   0.000     1.119575    1.200705
------------------------------------------------------------------------------
(option xb assumed; fitted values)

      Source |       SS           df       MS      Number of obs   =     7,892
-------------+----------------------------------   F(4, 7887)      =    228.81
       Model |  205.149655         4  51.2874136   Prob > F        =    0.0000
    Residual |  1767.85035     7,887  .224147375   R-squared       =    0.1040
-------------+----------------------------------   Adj R-squared   =    0.1035
       Total |        1973     7,891  .250031682   Root MSE        =    .47344

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |    .000789   .0002954     2.67   0.008     .0002099    .0013681
    ACTDTY13 |  -.1837356   .0069481   -26.44   0.000    -.1973558   -.1701154
     RACETHX |  -.0506313   .0053334    -9.49   0.000     -.061086   -.0401765
     EMPST13 |  -.0147126   .0022808    -6.45   0.000    -.0191835   -.0102417
       _cons |   1.052536   .0205371    51.25   0.000     1.012278    1.092795
------------------------------------------------------------------------------
(option xb assumed; fitted values)
===========================================================================

Iteration 0:   log likelihood = -5470.3175  
Iteration 1:   log likelihood = -4822.5106  
Iteration 2:   log likelihood = -4819.1638  
Iteration 3:   log likelihood = -4819.1625  
Iteration 4:   log likelihood = -4819.1625  

Logistic regression                             Number of obs     =      7,892
                                                LR chi2(4)        =    1302.31
                                                Prob > chi2       =     0.0000
Log likelihood = -4819.1625                     Pseudo R2         =     0.1190

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0060638   .0012907     4.70   0.000      .003534    .0085936
    HRWAG13X |  -.0449912   .0024043   -18.71   0.000    -.0497035    -.040279
    ACTDTY13 |   -1.14184   .0385006   -29.66   0.000      -1.2173    -1.06638
     RACETHX |  -.2392406   .0245876    -9.73   0.000    -.2874314   -.1910497
       _cons |   3.360466   .1126864    29.82   0.000     3.139605    3.581327
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))

Iteration 0:   log likelihood = -5470.3175  
Iteration 1:   log likelihood = -4763.1557  
Iteration 2:   log likelihood = -4759.6507  
Iteration 3:   log likelihood = -4759.6491  
Iteration 4:   log likelihood = -4759.6491  

Logistic regression                             Number of obs     =      7,892
                                                LR chi2(5)        =    1421.34
                                                Prob > chi2       =     0.0000
Log likelihood = -4759.6491                     Pseudo R2         =     0.1299

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0129216   .0014718     8.78   0.000      .010037    .0158062
    HRWAG13X |  -.0498148   .0025225   -19.75   0.000    -.0547588   -.0448708
    ACTDTY13 |  -1.220215   .0404088   -30.20   0.000    -1.299415   -1.141015
     RACETHX |   -.243123   .0247415    -9.83   0.000    -.2916155   -.1946305
     EMPST13 |  -.1298485   .0127529   -10.18   0.000    -.1548437   -.1048533
       _cons |    3.50746   .1160704    30.22   0.000     3.279966    3.734953
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))

Iteration 0:   log likelihood = -5470.3175  
Iteration 1:   log likelihood = -5009.0558  
Iteration 2:   log likelihood = -5005.3992  
Iteration 3:   log likelihood = -5005.3939  
Iteration 4:   log likelihood = -5005.3939  

Logistic regression                             Number of obs     =      7,892
                                                LR chi2(4)        =     929.85
                                                Prob > chi2       =     0.0000
Log likelihood = -5005.3939                     Pseudo R2         =     0.0850

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0038088   .0013412     2.84   0.005     .0011801    .0064374
    ACTDTY13 |  -.9091205   .0355098   -25.60   0.000    -.9787184   -.8395226
     RACETHX |  -.2193944   .0239929    -9.14   0.000    -.2664197   -.1723692
     EMPST13 |  -.0779394   .0107579    -7.24   0.000    -.0990245   -.0568542
       _cons |   2.658319   .1030465    25.80   0.000     2.456352    2.860286
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))
===========================================================================

Iteration 0:   log likelihood = -5470.3175  
Iteration 1:   log likelihood = -4837.7115  
Iteration 2:   log likelihood = -4833.6047  
Iteration 3:   log likelihood = -4833.6039  
Iteration 4:   log likelihood = -4833.6039  

Probit regression                               Number of obs     =      7,892
                                                LR chi2(4)        =    1273.43
                                                Prob > chi2       =     0.0000
Log likelihood = -4833.6039                     Pseudo R2         =     0.1164

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0036704   .0007841     4.68   0.000     .0021335    .0052072
    HRWAG13X |  -.0258585   .0013716   -18.85   0.000    -.0285468   -.0231702
    ACTDTY13 |  -.6730292   .0221191   -30.43   0.000    -.7163818   -.6296766
     RACETHX |  -.1417392   .0148113    -9.57   0.000    -.1707687   -.1127096
       _cons |   1.982361   .0643291    30.82   0.000     1.856278    2.108443
------------------------------------------------------------------------------
Note: 0 failures and 6 successes completely determined.
(option pr assumed; Pr(unin))

Iteration 0:   log likelihood = -5470.3175  
Iteration 1:   log likelihood = -4781.8787  
Iteration 2:   log likelihood = -4774.3918  
Iteration 3:   log likelihood = -4774.3903  
Iteration 4:   log likelihood = -4774.3903  

Probit regression                               Number of obs     =      7,892
                                                LR chi2(5)        =    1391.85
                                                Prob > chi2       =     0.0000
Log likelihood = -4774.3903                     Pseudo R2         =     0.1272

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0077013    .000883     8.72   0.000     .0059708    .0094319
    HRWAG13X |  -.0284073   .0014157   -20.07   0.000    -.0311819   -.0256326
    ACTDTY13 |  -.7139996   .0227792   -31.34   0.000    -.7586459   -.6693532
     RACETHX |  -.1433399   .0148693    -9.64   0.000    -.1724833   -.1141966
     EMPST13 |  -.0770525   .0074675   -10.32   0.000    -.0916885   -.0624164
       _cons |   2.054214   .0654193    31.40   0.000     1.925995    2.182434
------------------------------------------------------------------------------
Note: 0 failures and 6 successes completely determined.
(option pr assumed; Pr(unin))

Iteration 0:   log likelihood = -5470.3175  
Iteration 1:   log likelihood = -5009.0036  
Iteration 2:   log likelihood = -5006.5777  
Iteration 3:   log likelihood = -5006.5773  

Probit regression                               Number of obs     =      7,892
                                                LR chi2(4)        =     927.48
                                                Prob > chi2       =     0.0000
Log likelihood = -5006.5773                     Pseudo R2         =     0.0848

------------------------------------------------------------------------------
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0025363   .0008244     3.08   0.002     .0009205    .0041521
    ACTDTY13 |  -.5546073   .0210388   -26.36   0.000    -.5958426   -.5133719
     RACETHX |  -.1326505    .014611    -9.08   0.000    -.1612876   -.1040134
     EMPST13 |  -.0489703   .0066361    -7.38   0.000    -.0619768   -.0359639
       _cons |    1.61884   .0607293    26.66   0.000     1.499813    1.737868
------------------------------------------------------------------------------
Note: 0 failures and 4 successes completely determined.
(option pr assumed; Pr(unin))
===========================================================================

. 
. 
. local list = "regress logit probit"

. 
. forval x = 1/3 {
  2. 
.         stderr regress_uhat`x' logit_uhat`x' probit_uhat`x' 
  3.         matrix define stderr`x' = (regress_uhat`x', logit_uhat`x' ,probit_uhat`x' )
  4. 
. }
stderr of regress_uhat1 = .01253789
stderr of logit_uhat1 = .05746245
stderr of probit_uhat1 = .03538642
stderr of regress_uhat2 = .01252356
stderr of logit_uhat2 = .05736115
stderr of probit_uhat2 = .03544591
stderr of regress_uhat3 = .01284949
stderr of logit_uhat3 = .05685684
stderr of probit_uhat3 = .03528732

. 
. matrix stderr = stderr1\stderr2\stderr3

. matrix rownames stderr = stderr1 stderr2 stderr

. matrix colnames stderr =  REGRESS LOGIT PROBIT

. 
. putexcel set "output.csv", sheet(NONE) modify

. putexcel A1 = matrix(stderr), names nformat(number_d2)
file output.csv saved

. 
. 
. capture {

Probit model for unin

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |      2934          1854  |       4788
     -     |      1012          2092  |       3104
-----------+--------------------------+-----------
   Total   |      3946          3946  |       7892

Classified + if predicted Pr(D) >= .5
True D defined as unin != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   74.35%
Specificity                     Pr( -|~D)   53.02%
Positive predictive value       Pr( D| +)   61.28%
Negative predictive value       Pr(~D| -)   67.40%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   46.98%
False - rate for true D         Pr( -| D)   25.65%
False + rate for classified +   Pr(~D| +)   38.72%
False - rate for classified -   Pr( D| -)   32.60%
--------------------------------------------------
Correctly classified                        63.68%
--------------------------------------------------

Probit model for unin, goodness-of-fit test

       number of observations =      7892
 number of covariate patterns =       631
            Pearson chi2(626) =      3104.24
                  Prob > chi2 =         0.0000

Probit model for unin, goodness-of-fit test

  (Table collapsed on quantiles of estimated probabilities)

       number of observations =      7892
             number of groups =        10
      Hosmer-Lemeshow chi2(8) =       237.53
                  Prob > chi2 =         0.0000

Probit model for unin, goodness-of-fit test

  (Table collapsed on quantiles of estimated probabilities)
  +--------------------------------------------------------+
  | Group |   Prob | Obs_1 | Exp_1 | Obs_0 | Exp_0 | Total |
  |-------+--------+-------+-------+-------+-------+-------|
  |     1 | 0.1990 |   138 | 145.7 |   687 | 679.3 |   825 |
  |     2 | 0.3572 |   214 | 199.4 |   546 | 560.6 |   760 |
  |     3 | 0.4508 |   292 | 318.3 |   491 | 464.7 |   783 |
  |     4 | 0.5038 |   406 | 371.4 |   384 | 418.6 |   790 |
  |     5 | 0.5616 |   469 | 425.8 |   320 | 363.2 |   789 |
  |-------+--------+-------+-------+-------+-------+-------|
  |     6 | 0.5972 |   481 | 461.9 |   317 | 336.1 |   798 |
  |     7 | 0.6138 |   413 | 490.5 |   396 | 318.5 |   809 |
  |     8 | 0.6330 |   350 | 498.0 |   448 | 300.0 |   798 |
  |     9 | 0.6634 |   581 | 527.1 |   226 | 279.9 |   807 |
  |    10 | 1.0000 |   602 | 513.9 |   131 | 219.1 |   733 |
  +--------------------------------------------------------+

       number of observations =      7892
             number of groups =        10
      Hosmer-Lemeshow chi2(8) =       237.53
                  Prob > chi2 =         0.0000

. 
. foreach x in `list' {
  2. 
.         estimates table `x'_1 `x'_2 `x'_3, ///
>           stats(N ll r2_p mrse) b(%7.3f) stfmt(%8.2f)
  3.           
.         sum `x'_yhat1 `x'_yhat2 `x'_yhat3 ${depvar}
  4.         sum `x'_uhat1 `x'_uhat2 `x'_uhat3 
  5. }

-----------------------------------------------
    Variable | regre~_1   regre~_2   regre~_3  
-------------+---------------------------------
      AGE13X |    0.001      0.002      0.001  
    HRWAG13X |   -0.008     -0.009             
    ACTDTY13 |   -0.218     -0.222     -0.184  
     RACETHX |   -0.051     -0.052     -0.051  
     EMPST13 |              -0.020     -0.015  
       _cons |    1.158      1.160      1.053  
-------------+---------------------------------
           N |     7892       7892       7892  
          ll | -5130.68   -5090.61   -5294.71  
        r2_p |                                 
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
regress_yh~1 |      7,892          .5    .1874032  -.3837273   2.830181
regress_yh~2 |      7,892          .5    .1931088  -.3914137   3.062785
regress_yh~3 |      7,892          .5    .1612387   .0537162   2.567774
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
regress_uh~1 |      7,892    .0110662    .0037104    .006128   .0731928
regress_uh~2 |      7,892    .0119516    .0043593   .0061013   .0773048
regress_uh~3 |      7,892    .0111775     .004132    .006256     .07534

-----------------------------------------------
    Variable | logit_1    logit_2    logit_3   
-------------+---------------------------------
      AGE13X |    0.006      0.013      0.004  
    HRWAG13X |   -0.045     -0.050             
    ACTDTY13 |   -1.142     -1.220     -0.909  
     RACETHX |   -0.239     -0.243     -0.219  
     EMPST13 |              -0.130     -0.078  
       _cons |    3.360      3.507      2.658  
-------------+---------------------------------
           N |     7892       7892       7892  
          ll | -4819.16   -4759.65   -5005.39  
        r2_p |     0.12       0.13       0.08  
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 logit_yhat1 |      7,892          .5    .1964729   .0089229   .9999948
 logit_yhat2 |      7,892          .5    .2036105   .0070731   .9999993
 logit_yhat3 |      7,892          .5    .1670197    .103906   .9999651
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 logit_uhat1 |      7,892    .0551867    .0208098   .0289135   .4026387
 logit_uhat2 |      7,892    .0615075    .0265693   .0294374   .4698838
 logit_uhat3 |      7,892    .0522233    .0210633   .0280995   .3930917

-----------------------------------------------
    Variable | probit_1   probit_2   probit_3  
-------------+---------------------------------
      AGE13X |    0.004      0.008      0.003  
    HRWAG13X |   -0.026     -0.028             
    ACTDTY13 |   -0.673     -0.714     -0.555  
     RACETHX |   -0.142     -0.143     -0.133  
     EMPST13 |              -0.077     -0.049  
       _cons |    1.982      2.054      1.619  
-------------+---------------------------------
           N |     7892       7892       7892  
          ll | -4833.60   -4774.39   -5006.58  
        r2_p |     0.12       0.13       0.08  
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
probit_yhat1 |      7,892    .5014338    .1904952   .0032166          1
probit_yhat2 |      7,892    .5015787    .1978466   .0022893          1
probit_yhat3 |      7,892    .5007737    .1663704   .0961157          1
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
probit_uhat1 |      7,892    .0327337    .0117423   .0176768   .2306068
probit_uhat2 |      7,892    .0362552    .0148517   .0179176   .2619683
probit_uhat3 |      7,892    .0316883    .0124438   .0173577   .2328503

. 
. 
. local list = "regress logit probit"

. 
. forval y = 1/3 {
  2. foreach x in `list' {
  3.         
.                 estimates restore `x'_`y'
  4.                 
.                 noisily di "============================================================"
  5.                 noisily di "Model `x'_`y' " e(cmdline)
  6.                 noisily di "============================================================"
  7. 
.                 count if `x'_yhat`y' > .95 & ${depvar}==1 & e(sample)
  8.                 scalar x = r(N)
  9.                 count if ${depvar}==1 & e(sample)
 10.                 scalar y = r(N)
 11.                 scalar z1 = x/y
 12.                 noisily di "Correct Success Prediction Rate: " z1
 13.                 noisily di "predicted =" x ", Actual = " y
 14. 
.                 noisily di "  "
 15. 
.                 count if `x'_yhat`y'<.05 & ${depvar}==0 & e(sample)
 16.                 scalar x = r(N)
 17.                 count if ${depvar}==0 & e(sample) 
 18.                 scalar y = r(N)
 19.                 scalar z2 = x/y
 20.                 noisily di "Correct Failure Prediction Rate: " z2
 21.                 noisily di "predicted =" x ", Actual = " y
 22. 
.                 noisily di " "
 23.                 
.                 count if `x'_yhat`y'> .95 & ${depvar}==0 & e(sample)
 24.                 scalar x = r(N)
 25.                 count if ${depvar}==1 & e(sample)
 26.                 scalar y = r(N)
 27.                 scalar z3 = x/y
 28.                 noisily di "Incorrect Success Prediction Rate: " z3
 29.                 noisily di "predicted =" x ", Actual = " y
 30. 
.                 noisily di " "
 31.                 
.                 count if `x'_yhat`y'<.05 & ${depvar}==1 & e(sample)
 32.                 scalar x = r(N)
 33.                 count if ${depvar}==0 & e(sample)
 34.                 scalar y = r(N)
 35.                 scalar z4 = x/y
 36.                 noisily di "Incorrect Failure Prediction Rate: " z4
 37.                 noisily di "predicted =" x ", Actual = " y
 38.                 matrix define prediction`x'`y' = (z1, z2, z3, z4)
 39. 
. di "==========================================================================="
 40. }
 41. }
(results regress_1 are active now)
============================================================
Model regress_1 regress unin AGE13X HRWAG13X ACTDTY13 RACETHX  
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  82
  3,946
Correct Failure Prediction Rate: .02078054
predicted =82, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  23
  3,946
Incorrect Failure Prediction Rate: .00582869
predicted =23, Actual = 3946
===========================================================================
(results logit_1 are active now)
============================================================
Model logit_1 logit unin AGE13X HRWAG13X ACTDTY13 RACETHX  
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  38
  3,946
Correct Failure Prediction Rate: .00963001
predicted =38, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results probit_1 are active now)
============================================================
Model probit_1 probit unin AGE13X HRWAG13X ACTDTY13 RACETHX  
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  44
  3,946
Correct Failure Prediction Rate: .01115053
predicted =44, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results regress_2 are active now)
============================================================
Model regress_2 regress unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13  
============================================================
  12
  3,946
Correct Success Prediction Rate: .00304105
predicted =12, Actual = 3946
  
  69
  3,946
Correct Failure Prediction Rate: .01748606
predicted =69, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  23
  3,946
Incorrect Failure Prediction Rate: .00582869
predicted =23, Actual = 3946
===========================================================================
(results logit_2 are active now)
============================================================
Model logit_2 logit unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13  
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  44
  3,946
Correct Failure Prediction Rate: .01115053
predicted =44, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results probit_2 are active now)
============================================================
Model probit_2 probit unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13  
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  44
  3,946
Correct Failure Prediction Rate: .01115053
predicted =44, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results regress_3 are active now)
============================================================
Model regress_3 regress unin AGE13X ACTDTY13 RACETHX EMPST13  
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  0
  3,946
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3946
===========================================================================
(results logit_3 are active now)
============================================================
Model logit_3 logit unin AGE13X ACTDTY13 RACETHX EMPST13  
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  0
  3,946
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3946
===========================================================================
(results probit_3 are active now)
============================================================
Model probit_3 probit unin AGE13X ACTDTY13 RACETHX EMPST13  
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  0
  3,946
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3946
===========================================================================

. 
. 
. 
. 
. forval y = 1/3 {
  2.         matrix accuracy`y' = (predictionregress`y' \ predictionlogit`y' \ predictionprobit`y')
  3.         matrix colnames accuracy`y' = correct_success correct_failure   inaccurate_success inaccurate_failure
  4.         matrix rownames accuracy`x'`y' = REGRESS LOGIT PROBIT
  5.         putexcel set "prediction.csv", sheet(NO_OPTIONS`y') modify
  6.         putexcel A1 = matrix(accuracy`x'`y'), names nformat(number_d2)
  7. 
. }
file prediction.csv saved
file prediction.csv saved
file prediction.csv saved

. 
. 
. ********************************************************************************
. ********************************************************************************
. *
. * Robust Only
. * 
. ********************************************************************************
. ********************************************************************************
. 
. 
. 
. cap drop *_uhat* *_yhat*

. 
. global option = ", robust "

. 
. local list = "regress logit probit"

. 
. 
. foreach x in `list' {
  2. 
. `x' ${depvar} ${model1} ${option}
  3. estimates store `x'_1
  4. predict `x'_uhat1, stdp
  5. predict `x'_yhat1 
  6. 
. `x' ${depvar} ${model2} ${option}
  7. estimates store `x'_2
  8. predict `x'_uhat2, stdp
  9. predict `x'_yhat2 
 10. 
. `x' ${depvar} ${model3} ${option}
 11. estimates store `x'_3
 12. predict `x'_uhat3, stdp
 13. predict `x'_yhat3 
 14. di "==========================================================================="
 15. }

Linear regression                               Number of obs     =      7,892
                                                F(4, 7887)        =     166.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1405
                                                Root MSE          =      .4637

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0011477   .0002982     3.85   0.000     .0005631    .0017322
    HRWAG13X |   -.008325    .000429   -19.41   0.000     -.009166   -.0074841
    ACTDTY13 |  -.2182948   .0120951   -18.05   0.000    -.2420045   -.1945852
     RACETHX |  -.0514958   .0053374    -9.65   0.000    -.0619585    -.041033
       _cons |    1.15783   .0291073    39.78   0.000     1.100772    1.214889
------------------------------------------------------------------------------
(option xb assumed; fitted values)

Linear regression                               Number of obs     =      7,892
                                                F(5, 7886)        =     126.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1491
                                                Root MSE          =     .46138

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0021572   .0003411     6.32   0.000     .0014886    .0028258
    HRWAG13X |  -.0087759   .0004454   -19.70   0.000    -.0096489   -.0079028
    ACTDTY13 |  -.2223816   .0130955   -16.98   0.000    -.2480524   -.1967109
     RACETHX |  -.0523574   .0053336    -9.82   0.000    -.0628127    -.041902
     EMPST13 |  -.0200779   .0020754    -9.67   0.000    -.0241463   -.0160095
       _cons |    1.16014   .0308306    37.63   0.000     1.099704    1.220576
------------------------------------------------------------------------------
(option xb assumed; fitted values)

Linear regression                               Number of obs     =      7,892
                                                F(4, 7887)        =     141.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1040
                                                Root MSE          =     .47344

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |    .000789   .0003079     2.56   0.010     .0001855    .0013925
    ACTDTY13 |  -.1837356   .0099861   -18.40   0.000    -.2033109   -.1641602
     RACETHX |  -.0506313   .0054295    -9.33   0.000    -.0612746    -.039988
     EMPST13 |  -.0147126   .0021188    -6.94   0.000     -.018866   -.0105593
       _cons |   1.052536     .02475    42.53   0.000      1.00402    1.101053
------------------------------------------------------------------------------
(option xb assumed; fitted values)
===========================================================================

Iteration 0:   log pseudolikelihood = -5470.3175  
Iteration 1:   log pseudolikelihood = -4822.5106  
Iteration 2:   log pseudolikelihood = -4819.1638  
Iteration 3:   log pseudolikelihood = -4819.1625  
Iteration 4:   log pseudolikelihood = -4819.1625  

Logistic regression                             Number of obs     =      7,892
                                                Wald chi2(4)      =     815.31
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -4819.1625               Pseudo R2         =     0.1190

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0060638   .0012667     4.79   0.000     .0035811    .0085465
    HRWAG13X |  -.0449912   .0024887   -18.08   0.000    -.0498691   -.0401134
    ACTDTY13 |   -1.14184   .0424368   -26.91   0.000    -1.225015   -1.058665
     RACETHX |  -.2392406   .0250993    -9.53   0.000    -.2884343   -.1900468
       _cons |   3.360466   .1223672    27.46   0.000     3.120631    3.600301
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood = -5470.3175  
Iteration 1:   log pseudolikelihood = -4763.1557  
Iteration 2:   log pseudolikelihood = -4759.6507  
Iteration 3:   log pseudolikelihood = -4759.6491  
Iteration 4:   log pseudolikelihood = -4759.6491  

Logistic regression                             Number of obs     =      7,892
                                                Wald chi2(5)      =     851.98
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -4759.6491               Pseudo R2         =     0.1299

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0129216   .0014301     9.04   0.000     .0101186    .0157246
    HRWAG13X |  -.0498148   .0026485   -18.81   0.000    -.0550058   -.0446238
    ACTDTY13 |  -1.220215   .0446333   -27.34   0.000    -1.307695   -1.132736
     RACETHX |   -.243123   .0253936    -9.57   0.000    -.2928935   -.1933525
     EMPST13 |  -.1298485   .0111875   -11.61   0.000    -.1517756   -.1079214
       _cons |    3.50746   .1265898    27.71   0.000     3.259348    3.755571
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood = -5470.3175  
Iteration 1:   log pseudolikelihood = -5009.0558  
Iteration 2:   log pseudolikelihood = -5005.3992  
Iteration 3:   log pseudolikelihood = -5005.3939  
Iteration 4:   log pseudolikelihood = -5005.3939  

Logistic regression                             Number of obs     =      7,892
                                                Wald chi2(4)      =     756.57
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -5005.3939               Pseudo R2         =     0.0850

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0038088   .0013006     2.93   0.003     .0012597    .0063579
    ACTDTY13 |  -.9091205   .0362383   -25.09   0.000    -.9801463   -.8380948
     RACETHX |  -.2193944    .024467    -8.97   0.000    -.2673488   -.1714401
     EMPST13 |  -.0779394   .0095069    -8.20   0.000    -.0965726   -.0593061
       _cons |   2.658319   .1049394    25.33   0.000     2.452642    2.863997
------------------------------------------------------------------------------
(option pr assumed; Pr(unin))
===========================================================================

Iteration 0:   log pseudolikelihood = -5470.3175  
Iteration 1:   log pseudolikelihood = -4837.7115  
Iteration 2:   log pseudolikelihood = -4833.6047  
Iteration 3:   log pseudolikelihood = -4833.6039  
Iteration 4:   log pseudolikelihood = -4833.6039  

Probit regression                               Number of obs     =      7,892
                                                Wald chi2(4)      =     845.75
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -4833.6039               Pseudo R2         =     0.1164

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0036704   .0007708     4.76   0.000     .0021596    .0051811
    HRWAG13X |  -.0258585   .0015108   -17.12   0.000    -.0288196   -.0228974
    ACTDTY13 |  -.6730292   .0246682   -27.28   0.000    -.7213779   -.6246805
     RACETHX |  -.1417392   .0151415    -9.36   0.000    -.1714159   -.1120625
       _cons |   1.982361   .0710187    27.91   0.000     1.843167    2.121555
------------------------------------------------------------------------------
Note: 0 failures and 6 successes completely determined.
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood = -5470.3175  
Iteration 1:   log pseudolikelihood = -4781.8787  
Iteration 2:   log pseudolikelihood = -4774.3918  
Iteration 3:   log pseudolikelihood = -4774.3903  
Iteration 4:   log pseudolikelihood = -4774.3903  

Probit regression                               Number of obs     =      7,892
                                                Wald chi2(5)      =     918.88
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -4774.3903               Pseudo R2         =     0.1272

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0077013   .0008572     8.98   0.000     .0060212    .0093815
    HRWAG13X |  -.0284073   .0015826   -17.95   0.000    -.0315091   -.0253054
    ACTDTY13 |  -.7139996   .0254524   -28.05   0.000    -.7638854   -.6641137
     RACETHX |  -.1433399   .0152715    -9.39   0.000    -.1732716   -.1134082
     EMPST13 |  -.0770525   .0065596   -11.75   0.000     -.089909   -.0641959
       _cons |   2.054214   .0726522    28.27   0.000     1.911819     2.19661
------------------------------------------------------------------------------
Note: 0 failures and 6 successes completely determined.
(option pr assumed; Pr(unin))

Iteration 0:   log pseudolikelihood = -5470.3175  
Iteration 1:   log pseudolikelihood = -5009.0036  
Iteration 2:   log pseudolikelihood = -5006.5777  
Iteration 3:   log pseudolikelihood = -5006.5773  

Probit regression                               Number of obs     =      7,892
                                                Wald chi2(4)      =     822.99
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -5006.5773               Pseudo R2         =     0.0848

------------------------------------------------------------------------------
             |               Robust
        unin |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      AGE13X |   .0025363   .0008002     3.17   0.002     .0009679    .0041048
    ACTDTY13 |  -.5546073   .0214387   -25.87   0.000    -.5966264   -.5125881
     RACETHX |  -.1326505   .0149197    -8.89   0.000    -.1618925   -.1034085
     EMPST13 |  -.0489703   .0059349    -8.25   0.000    -.0606025   -.0373382
       _cons |    1.61884   .0620309    26.10   0.000     1.497262    1.740419
------------------------------------------------------------------------------
Note: 0 failures and 4 successes completely determined.
(option pr assumed; Pr(unin))
===========================================================================

. 
. 
. local list = "regress logit probit"

. 
. forval x = 1/3 {
  2. 
.         stderr regress_uhat`x' logit_uhat`x' probit_uhat`x' 
  3.         matrix define stderr`x' = (regress_uhat`x', logit_uhat`x' ,probit_uhat`x' )
  4. 
. }
stderr of regress_uhat1 = .01487542
stderr of logit_uhat1 = .05690857
stderr of probit_uhat1 = .03503713
stderr of regress_uhat2 = .01508352
stderr of logit_uhat2 = .0565212
stderr of probit_uhat2 = .03494672
stderr of regress_uhat3 = .01415507
stderr of logit_uhat3 = .05578042
stderr of probit_uhat3 = .03471339

. 
. matrix stderr = stderr1\stderr2\stderr3

. matrix rownames stderr = stderr1 stderr2 stderr3

. matrix colnames stderr =  REGRESS LOGIT PROBIT

. 
. putexcel set "output.csv", sheet(ROBUST) modify

. putexcel A1 = matrix(stderr), names nformat(number_d2)
file output.csv saved

. 
. 
. capture {

Probit model for unin

              -------- True --------
Classified |         D            ~D  |      Total
-----------+--------------------------+-----------
     +     |      2934          1854  |       4788
     -     |      1012          2092  |       3104
-----------+--------------------------+-----------
   Total   |      3946          3946  |       7892

Classified + if predicted Pr(D) >= .5
True D defined as unin != 0
--------------------------------------------------
Sensitivity                     Pr( +| D)   74.35%
Specificity                     Pr( -|~D)   53.02%
Positive predictive value       Pr( D| +)   61.28%
Negative predictive value       Pr(~D| -)   67.40%
--------------------------------------------------
False + rate for true ~D        Pr( +|~D)   46.98%
False - rate for true D         Pr( -| D)   25.65%
False + rate for classified +   Pr(~D| +)   38.72%
False - rate for classified -   Pr( D| -)   32.60%
--------------------------------------------------
Correctly classified                        63.68%
--------------------------------------------------

Probit model for unin, goodness-of-fit test

       number of observations =      7892
 number of covariate patterns =       631
            Pearson chi2(626) =      3104.24
                  Prob > chi2 =         0.0000

Probit model for unin, goodness-of-fit test

  (Table collapsed on quantiles of estimated probabilities)

       number of observations =      7892
             number of groups =        10
      Hosmer-Lemeshow chi2(8) =       237.53
                  Prob > chi2 =         0.0000

Probit model for unin, goodness-of-fit test

  (Table collapsed on quantiles of estimated probabilities)
  +--------------------------------------------------------+
  | Group |   Prob | Obs_1 | Exp_1 | Obs_0 | Exp_0 | Total |
  |-------+--------+-------+-------+-------+-------+-------|
  |     1 | 0.1990 |   138 | 145.7 |   687 | 679.3 |   825 |
  |     2 | 0.3572 |   214 | 199.4 |   546 | 560.6 |   760 |
  |     3 | 0.4508 |   292 | 318.3 |   491 | 464.7 |   783 |
  |     4 | 0.5038 |   406 | 371.4 |   384 | 418.6 |   790 |
  |     5 | 0.5616 |   469 | 425.8 |   320 | 363.2 |   789 |
  |-------+--------+-------+-------+-------+-------+-------|
  |     6 | 0.5972 |   481 | 461.9 |   317 | 336.1 |   798 |
  |     7 | 0.6138 |   413 | 490.5 |   396 | 318.5 |   809 |
  |     8 | 0.6330 |   350 | 498.0 |   448 | 300.0 |   798 |
  |     9 | 0.6634 |   581 | 527.1 |   226 | 279.9 |   807 |
  |    10 | 1.0000 |   602 | 513.9 |   131 | 219.1 |   733 |
  +--------------------------------------------------------+

       number of observations =      7892
             number of groups =        10
      Hosmer-Lemeshow chi2(8) =       237.53
                  Prob > chi2 =         0.0000

. 
. foreach x in `list' {
  2. 
. estimates table `x'_1 `x'_2 `x'_3, ///
>   stats(N ll r2_p mrse) b(%7.3f) stfmt(%8.2f)
  3.   
. sum `x'_yhat1 `x'_yhat2 `x'_yhat3 ${depvar}
  4. 
. sum `x'_uhat1 `x'_uhat2 `x'_uhat3
  5. di "==========================================================================="
  6. }

-----------------------------------------------
    Variable | regre~_1   regre~_2   regre~_3  
-------------+---------------------------------
      AGE13X |    0.001      0.002      0.001  
    HRWAG13X |   -0.008     -0.009             
    ACTDTY13 |   -0.218     -0.222     -0.184  
     RACETHX |   -0.051     -0.052     -0.051  
     EMPST13 |              -0.020     -0.015  
       _cons |    1.158      1.160      1.053  
-------------+---------------------------------
           N |     7892       7892       7892  
          ll | -5130.68   -5090.61   -5294.71  
        r2_p |                                 
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
regress_yh~1 |      7,892          .5    .1874032  -.3837273   2.830181
regress_yh~2 |      7,892          .5    .1931088  -.3914137   3.062785
regress_yh~3 |      7,892          .5    .1612387   .0537162   2.567774
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
regress_uh~1 |      7,892    .0126853    .0046682     .00715   .1258937
regress_uh~2 |      7,892    .0136578    .0055021   .0072419   .1447729
regress_uh~3 |      7,892    .0120807    .0044071   .0072432   .1084306
===========================================================================

-----------------------------------------------
    Variable | logit_1    logit_2    logit_3   
-------------+---------------------------------
      AGE13X |    0.006      0.013      0.004  
    HRWAG13X |   -0.045     -0.050             
    ACTDTY13 |   -1.142     -1.220     -0.909  
     RACETHX |   -0.239     -0.243     -0.219  
     EMPST13 |              -0.130     -0.078  
       _cons |    3.360      3.507      2.658  
-------------+---------------------------------
           N |     7892       7892       7892  
          ll | -4819.16   -4759.65   -5005.39  
        r2_p |     0.12       0.13       0.08  
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 logit_yhat1 |      7,892          .5    .1964729   .0089229   .9999948
 logit_yhat2 |      7,892          .5    .2036105   .0070731   .9999993
 logit_yhat3 |      7,892          .5    .1670197    .103906   .9999651
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 logit_uhat1 |      7,892    .0561183    .0223879   .0283022   .4449087
 logit_uhat2 |      7,892     .061651    .0267998   .0285991   .5048823
 logit_uhat3 |      7,892    .0515124    .0201893   .0278215   .3901535
===========================================================================

-----------------------------------------------
    Variable | probit_1   probit_2   probit_3  
-------------+---------------------------------
      AGE13X |    0.004      0.008      0.003  
    HRWAG13X |   -0.026     -0.028             
    ACTDTY13 |   -0.673     -0.714     -0.555  
     RACETHX |   -0.142     -0.143     -0.133  
     EMPST13 |              -0.077     -0.049  
       _cons |    1.982      2.054      1.619  
-------------+---------------------------------
           N |     7892       7892       7892  
          ll | -4833.60   -4774.39   -5006.58  
        r2_p |     0.12       0.13       0.08  
        mrse |                                 
-----------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
probit_yhat1 |      7,892    .5014338    .1904952   .0032166          1
probit_yhat2 |      7,892    .5015787    .1978466   .0022893          1
probit_yhat3 |      7,892    .5007737    .1663704   .0961157          1
        unin |      7,892          .5    .5000317          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
probit_uhat1 |      7,892    .0337287    .0131571   .0173075   .2583369
probit_uhat2 |      7,892    .0367689    .0153341   .0174347   .2848034
probit_uhat3 |      7,892    .0312947    .0118923   .0172032   .2315466
===========================================================================

. 
. 
. local list = "regress logit probit"

. 
. forval y = 1/3 {
  2. foreach x in `list' {
  3.         
.                 estimates restore `x'_`y'
  4.                 
.                 noisily di "============================================================"
  5.                 noisily di "Model `x'_`y' " e(cmdline)
  6.                 noisily di "============================================================"
  7. 
.                 count if `x'_yhat`y' > .95 & ${depvar}==1 & e(sample)
  8.                 scalar x = r(N)
  9.                 count if ${depvar}==1 & e(sample)
 10.                 scalar y = r(N)
 11.                 scalar z1 = x/y
 12.                 noisily di "Correct Success Prediction Rate: " z1
 13.                 noisily di "predicted =" x ", Actual = " y
 14. 
.                 noisily di "  "
 15. 
.                 count if `x'_yhat`y'<.05 & ${depvar}==0 & e(sample)
 16.                 scalar x = r(N)
 17.                 count if ${depvar}==0 & e(sample) 
 18.                 scalar y = r(N)
 19.                 scalar z2 = x/y
 20.                 noisily di "Correct Failure Prediction Rate: " z2
 21.                 noisily di "predicted =" x ", Actual = " y
 22. 
.                 noisily di " "
 23.                 
.                 count if `x'_yhat`y'> .95 & ${depvar}==0 & e(sample)
 24.                 scalar x = r(N)
 25.                 count if ${depvar}==1 & e(sample)
 26.                 scalar y = r(N)
 27.                 scalar z3 = x/y
 28.                 noisily di "Incorrect Success Prediction Rate: " z3
 29.                 noisily di "predicted =" x ", Actual = " y
 30. 
.                 noisily di " "
 31.                 
.                 count if `x'_yhat`y'<.05 & ${depvar}==1 & e(sample)
 32.                 scalar x = r(N)
 33.                 count if ${depvar}==0 & e(sample)
 34.                 scalar y = r(N)
 35.                 scalar z4 = x/y
 36.                 noisily di "Incorrect Failure Prediction Rate: " z4
 37.                 noisily di "predicted =" x ", Actual = " y
 38.                 matrix define prediction`x'`y' = (z1, z2, z3, z4)
 39. 
. di "==========================================================================="
 40. }
 41. }
(results regress_1 are active now)
============================================================
Model regress_1 regress unin AGE13X HRWAG13X ACTDTY13 RACETHX , robust 
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  82
  3,946
Correct Failure Prediction Rate: .02078054
predicted =82, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  23
  3,946
Incorrect Failure Prediction Rate: .00582869
predicted =23, Actual = 3946
===========================================================================
(results logit_1 are active now)
============================================================
Model logit_1 logit unin AGE13X HRWAG13X ACTDTY13 RACETHX , robust 
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  38
  3,946
Correct Failure Prediction Rate: .00963001
predicted =38, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results probit_1 are active now)
============================================================
Model probit_1 probit unin AGE13X HRWAG13X ACTDTY13 RACETHX , robust 
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  44
  3,946
Correct Failure Prediction Rate: .01115053
predicted =44, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results regress_2 are active now)
============================================================
Model regress_2 regress unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 , robust 
============================================================
  12
  3,946
Correct Success Prediction Rate: .00304105
predicted =12, Actual = 3946
  
  69
  3,946
Correct Failure Prediction Rate: .01748606
predicted =69, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  23
  3,946
Incorrect Failure Prediction Rate: .00582869
predicted =23, Actual = 3946
===========================================================================
(results logit_2 are active now)
============================================================
Model logit_2 logit unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 , robust 
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  44
  3,946
Correct Failure Prediction Rate: .01115053
predicted =44, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results probit_2 are active now)
============================================================
Model probit_2 probit unin AGE13X HRWAG13X ACTDTY13 RACETHX EMPST13 , robust 
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  44
  3,946
Correct Failure Prediction Rate: .01115053
predicted =44, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  13
  3,946
Incorrect Failure Prediction Rate: .00329448
predicted =13, Actual = 3946
===========================================================================
(results regress_3 are active now)
============================================================
Model regress_3 regress unin AGE13X ACTDTY13 RACETHX EMPST13 , robust 
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  0
  3,946
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3946
===========================================================================
(results logit_3 are active now)
============================================================
Model logit_3 logit unin AGE13X ACTDTY13 RACETHX EMPST13 , robust 
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  0
  3,946
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3946
===========================================================================
(results probit_3 are active now)
============================================================
Model probit_3 probit unin AGE13X ACTDTY13 RACETHX EMPST13 , robust 
============================================================
  6
  3,946
Correct Success Prediction Rate: .00152053
predicted =6, Actual = 3946
  
  0
  3,946
Correct Failure Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Success Prediction Rate: 0
predicted =0, Actual = 3946
 
  0
  3,946
Incorrect Failure Prediction Rate: 0
predicted =0, Actual = 3946
===========================================================================

. 
. 
. 
. 
. forval y = 1/3 {
  2.                 matrix accuracy`y' = (predictionregress`y' \ predictionlogit`y' \ predictionprobit`y')
  3.                 
.         matrix colnames accuracy`y' = correct_success correct_failure   inaccurate_success inaccurate_failure
  4.         matrix rownames accuracy`x'`y' = REGRESS LOGIT PROBIT
  5.         putexcel set "prediction.csv", sheet(ROBUST`y') modify
  6.         putexcel A1 = matrix(accuracy`x'`y'), names nformat(number_d2)
  7. 
. }
file prediction.csv saved
file prediction.csv saved
file prediction.csv saved

. 
. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\rayde\Desktop\uninsured_bootstrap3.log
  log type:  text
 closed on:   8 Aug 2019, 20:56:44
--------------------------------------------------------------------------------------------------------------------------------------------------
