--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mafton/Documents/School/Econ 644/class10study.log
  log type:  text
 opened on:   2 Apr 2018, 12:48:32

. set more off

. use ceosalary.dta

. /*mison richard test*/
/ is not a valid command name
r(199);

. gen lceoten=log(ceoten)
(5 missing values generated)

. list ceoten lceoten if lceoten==.

     +------------------+
     | ceoten   lceoten |
     |------------------|
 85. |      0         . |
129. |      0         . |
137. |      0         . |
170. |      0         . |
177. |      0         . |
     +------------------+

. gen lmktval= log(mktval)

. regress salary ceoten mktval lceoten lmktval

      Source |       SS           df       MS      Number of obs   =       172
-------------+----------------------------------   F(4, 167)       =     14.08
       Model |  15124272.2         4  3781068.05   Prob > F        =    0.0000
    Residual |  44851706.4       167  268573.093   R-squared       =    0.2522
-------------+----------------------------------   Adj R-squared   =    0.2343
       Total |  59975978.7       171  350736.717   Root MSE        =    518.24

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |  -16.05584   11.78489    -1.36   0.175    -39.32242    7.210735
      mktval |   .0120975   .0103903     1.16   0.246    -.0084157    .0326107
     lceoten |   248.7483   91.37862     2.72   0.007     68.34214    429.1545
     lmktval |    179.227   59.53627     3.01   0.003     61.68626    296.7677
       _cons |   -794.895    425.982    -1.87   0.064    -1635.899    46.10894
------------------------------------------------------------------------------

. test (lceoten lmktval)

 ( 1)  lceoten = 0
 ( 2)  lmktval = 0

       F(  2,   167) =    8.26
            Prob > F =    0.0004

. regress salary lceoten lmktval

      Source |       SS           df       MS      Number of obs   =       172
-------------+----------------------------------   F(2, 169)       =     26.48
       Model |  14312362.7         2  7156181.36   Prob > F        =    0.0000
    Residual |  45663615.9       169  270198.911   R-squared       =    0.2386
-------------+----------------------------------   Adj R-squared   =    0.2296
       Total |  59975978.7       171  350736.717   Root MSE        =    519.81

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lceoten |    141.446   43.41147     3.26   0.001     55.74734    227.1446
     lmktval |   235.0279   34.98285     6.72   0.000     165.9682    304.0876
       _cons |  -1110.221   277.7181    -4.00   0.000    -1658.465   -561.9779
------------------------------------------------------------------------------

. regress salary ceoten mktval

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =     19.72
       Model |  11227107.9         2  5613553.96   Prob > F        =    0.0000
    Residual |  49538856.8       174  284706.074   R-squared       =    0.1848
-------------+----------------------------------   Adj R-squared   =    0.1754
       Total |  60765964.7       176  345261.163   Root MSE        =    533.58

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   11.52597   5.624648     2.05   0.042     .4246476    22.62729
      mktval |    .036974   .0062433     5.92   0.000     .0246517    .0492963
       _cons |   641.0594   64.04995    10.01   0.000     514.6446    767.4742
------------------------------------------------------------------------------

. regress salary lceoten lmktval

      Source |       SS           df       MS      Number of obs   =       172
-------------+----------------------------------   F(2, 169)       =     26.48
       Model |  14312362.7         2  7156181.36   Prob > F        =    0.0000
    Residual |  45663615.9       169  270198.911   R-squared       =    0.2386
-------------+----------------------------------   Adj R-squared   =    0.2296
       Total |  59975978.7       171  350736.717   Root MSE        =    519.81

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lceoten |    141.446   43.41147     3.26   0.001     55.74734    227.1446
     lmktval |   235.0279   34.98285     6.72   0.000     165.9682    304.0876
       _cons |  -1110.221   277.7181    -4.00   0.000    -1658.465   -561.9779
------------------------------------------------------------------------------

. predict yhat
(option xb assumed; fitted values)
(5 missing values generated)

. regress salary ceoten mktval yhat

      Source |       SS           df       MS      Number of obs   =       172
-------------+----------------------------------   F(3, 168)       =     17.97
       Model |  14571956.3         3  4857318.76   Prob > F        =    0.0000
    Residual |  45404022.4       168  270262.038   R-squared       =    0.2430
-------------+----------------------------------   Adj R-squared   =    0.2294
       Total |  59975978.7       171  350736.717   Root MSE        =    519.87

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   -1.93043   6.490254    -0.30   0.767    -14.74339    10.88253
      mktval |   .0072438   .0098544     0.74   0.463    -.0122106    .0266982
        yhat |   .8959845    .236355     3.79   0.000      .429376    1.362593
       _cons |   80.44773   164.8285     0.49   0.626    -244.9543    405.8498
------------------------------------------------------------------------------

. test yhat

 ( 1)  yhat = 0

       F(  1,   168) =   14.37
            Prob > F =    0.0002

. regress salary ceoten mktval

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =     19.72
       Model |  11227107.9         2  5613553.96   Prob > F        =    0.0000
    Residual |  49538856.8       174  284706.074   R-squared       =    0.1848
-------------+----------------------------------   Adj R-squared   =    0.1754
       Total |  60765964.7       176  345261.163   Root MSE        =    533.58

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   11.52597   5.624648     2.05   0.042     .4246476    22.62729
      mktval |    .036974   .0062433     5.92   0.000     .0246517    .0492963
       _cons |   641.0594   64.04995    10.01   0.000     514.6446    767.4742
------------------------------------------------------------------------------

. estat ovtest

Ramsey RESET test using powers of the fitted values of salary
       Ho:  model has no omitted variables
                 F(3, 171) =      4.10
                  Prob > F =      0.0076

. regress salary c.ceoten##c.ceoten mktval

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(3, 173)       =     15.83
       Model |  13086189.2         3  4362063.08   Prob > F        =    0.0000
    Residual |  47679775.5       173  275605.639   R-squared       =    0.2154
-------------+----------------------------------   Adj R-squared   =    0.2017
       Total |  60765964.7       176  345261.163   Root MSE        =    524.98

-----------------------------------------------------------------------------------
           salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
           ceoten |   47.47244   14.90585     3.18   0.002     18.05171    76.89318
                  |
c.ceoten#c.ceoten |  -1.302377   .5014544    -2.60   0.010    -2.292133   -.3126203
                  |
           mktval |   .0371405    .006143     6.05   0.000     .0250156    .0492654
            _cons |   503.1456    82.4074     6.11   0.000     340.4922     665.799
-----------------------------------------------------------------------------------

. estat ovtest

Ramsey RESET test using powers of the fitted values of salary
       Ho:  model has no omitted variables
                 F(3, 170) =      1.28
                  Prob > F =      0.2845

. regress salary c.mktval##c.mktval ceoten

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(3, 173)       =     14.78
       Model |  12397104.8         3  4132368.27   Prob > F        =    0.0000
    Residual |  48368859.9       173  279588.786   R-squared       =    0.2040
-------------+----------------------------------   Adj R-squared   =    0.1902
       Total |  60765964.7       176  345261.163   Root MSE        =    528.76

-----------------------------------------------------------------------------------
           salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
           mktval |   .0653956   .0152089     4.30   0.000     .0353767    .0954144
                  |
c.mktval#c.mktval |  -8.84e-07   4.32e-07    -2.05   0.042    -1.74e-06   -3.11e-08
                  |
           ceoten |   12.30547    5.58688     2.20   0.029      1.27825     23.3327
            _cons |   580.4781   70.04059     8.29   0.000      442.234    718.7222
-----------------------------------------------------------------------------------

. estat ovtest

Ramsey RESET test using powers of the fitted values of salary
       Ho:  model has no omitted variables
                 F(3, 170) =      2.28
                  Prob > F =      0.0808

. regress salary lceoten mktval

      Source |       SS           df       MS      Number of obs   =       172
-------------+----------------------------------   F(2, 169)       =     21.32
       Model |  12083038.6         2  6041519.28   Prob > F        =    0.0000
    Residual |  47892940.1       169  283390.178   R-squared       =    0.2015
-------------+----------------------------------   Adj R-squared   =    0.1920
       Total |  59975978.7       171  350736.717   Root MSE        =    532.34

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lceoten |   128.4061   44.36797     2.89   0.004     40.81928    215.9929
      mktval |   .0370447   .0062466     5.93   0.000     .0247132    .0493763
       _cons |   518.7934   90.24979     5.75   0.000     340.6313    696.9556
------------------------------------------------------------------------------

. predict yhat
variable yhat already defined
r(110);

. predict yhat2
(option xb assumed; fitted values)
(5 missing values generated)

. regress salary ceoten mktval yhat

      Source |       SS           df       MS      Number of obs   =       172
-------------+----------------------------------   F(3, 168)       =     17.97
       Model |  14571956.3         3  4857318.76   Prob > F        =    0.0000
    Residual |  45404022.4       168  270262.038   R-squared       =    0.2430
-------------+----------------------------------   Adj R-squared   =    0.2294
       Total |  59975978.7       171  350736.717   Root MSE        =    519.87

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   -1.93043   6.490254    -0.30   0.767    -14.74339    10.88253
      mktval |   .0072438   .0098544     0.74   0.463    -.0122106    .0266982
        yhat |   .8959845    .236355     3.79   0.000      .429376    1.362593
       _cons |   80.44773   164.8285     0.49   0.626    -244.9543    405.8498
------------------------------------------------------------------------------

. test yhat

 ( 1)  yhat = 0

       F(  1,   168) =   14.37
            Prob > F =    0.0002

. regress salary lceoten lmktval

      Source |       SS           df       MS      Number of obs   =       172
-------------+----------------------------------   F(2, 169)       =     26.48
       Model |  14312362.7         2  7156181.36   Prob > F        =    0.0000
    Residual |  45663615.9       169  270198.911   R-squared       =    0.2386
-------------+----------------------------------   Adj R-squared   =    0.2296
       Total |  59975978.7       171  350736.717   Root MSE        =    519.81

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lceoten |    141.446   43.41147     3.26   0.001     55.74734    227.1446
     lmktval |   235.0279   34.98285     6.72   0.000     165.9682    304.0876
       _cons |  -1110.221   277.7181    -4.00   0.000    -1658.465   -561.9779
------------------------------------------------------------------------------

. predict yhat3
(option xb assumed; fitted values)
(5 missing values generated)

. regress salary ceoten mktval yhat

      Source |       SS           df       MS      Number of obs   =       172
-------------+----------------------------------   F(3, 168)       =     17.97
       Model |  14571956.3         3  4857318.76   Prob > F        =    0.0000
    Residual |  45404022.4       168  270262.038   R-squared       =    0.2430
-------------+----------------------------------   Adj R-squared   =    0.2294
       Total |  59975978.7       171  350736.717   Root MSE        =    519.87

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   -1.93043   6.490254    -0.30   0.767    -14.74339    10.88253
      mktval |   .0072438   .0098544     0.74   0.463    -.0122106    .0266982
        yhat |   .8959845    .236355     3.79   0.000      .429376    1.362593
       _cons |   80.44773   164.8285     0.49   0.626    -244.9543    405.8498
------------------------------------------------------------------------------

. test yhat

 ( 1)  yhat = 0

       F(  1,   168) =   14.37
            Prob > F =    0.0002

. regress salary ceoten mktval lceoten

      Source |       SS           df       MS      Number of obs   =       172
-------------+----------------------------------   F(3, 168)       =     15.03
       Model |  12690353.4         3  4230117.81   Prob > F        =    0.0000
    Residual |  47285625.2       168  281462.055   R-squared       =    0.2116
-------------+----------------------------------   Adj R-squared   =    0.1975
       Total |  59975978.7       171  350736.717   Root MSE        =    530.53

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |  -17.70244   12.05136    -1.47   0.144    -41.49406    6.089179
      mktval |   .0374466   .0062314     6.01   0.000     .0251447    .0497485
     lceoten |   249.4967   93.54524     2.67   0.008     64.82112    434.1724
       _cons |   452.9626   100.4892     4.51   0.000     254.5783    651.3468
------------------------------------------------------------------------------

. test lceoten

 ( 1)  lceoten = 0

       F(  1,   168) =    7.11
            Prob > F =    0.0084

. test lceoten mktval

 ( 1)  lceoten = 0
 ( 2)  mktval = 0

       F(  2,   168) =   20.84
            Prob > F =    0.0000

. regress salary ceoten mktval lceoten lmktval

      Source |       SS           df       MS      Number of obs   =       172
-------------+----------------------------------   F(4, 167)       =     14.08
       Model |  15124272.2         4  3781068.05   Prob > F        =    0.0000
    Residual |  44851706.4       167  268573.093   R-squared       =    0.2522
-------------+----------------------------------   Adj R-squared   =    0.2343
       Total |  59975978.7       171  350736.717   Root MSE        =    518.24

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |  -16.05584   11.78489    -1.36   0.175    -39.32242    7.210735
      mktval |   .0120975   .0103903     1.16   0.246    -.0084157    .0326107
     lceoten |   248.7483   91.37862     2.72   0.007     68.34214    429.1545
     lmktval |    179.227   59.53627     3.01   0.003     61.68626    296.7677
       _cons |   -794.895    425.982    -1.87   0.064    -1635.899    46.10894
------------------------------------------------------------------------------

. test lceoten lmktval

 ( 1)  lceoten = 0
 ( 2)  lmktval = 0

       F(  2,   167) =    8.26
            Prob > F =    0.0004

. regress salary ceoten mktval

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =     19.72
       Model |  11227107.9         2  5613553.96   Prob > F        =    0.0000
    Residual |  49538856.8       174  284706.074   R-squared       =    0.1848
-------------+----------------------------------   Adj R-squared   =    0.1754
       Total |  60765964.7       176  345261.163   Root MSE        =    533.58

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   11.52597   5.624648     2.05   0.042     .4246476    22.62729
      mktval |    .036974   .0062433     5.92   0.000     .0246517    .0492963
       _cons |   641.0594   64.04995    10.01   0.000     514.6446    767.4742
------------------------------------------------------------------------------

. generate e= rnormal(0, 100)

. gen salary_obs=salary+3

. gen salary_obs=salary+e, replace
variable salary_obs already defined
r(110);

. drop salary_obs

. gen salary_obs=salary+e

. regress salary_obs ceoten mktval

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =     18.60
       Model |    11290397         2  5645198.48   Prob > F        =    0.0000
    Residual |  52796220.8       174  303426.556   R-squared       =    0.1762
-------------+----------------------------------   Adj R-squared   =    0.1667
       Total |  64086617.8       176   364128.51   Root MSE        =    550.84

------------------------------------------------------------------------------
  salary_obs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   11.31955   5.806625     1.95   0.053    -.1409347    22.78004
      mktval |   .0371703   .0064453     5.77   0.000     .0244494    .0498913
       _cons |   635.4683   66.12219     9.61   0.000     504.9635    765.9731
------------------------------------------------------------------------------

. regress salary ceoten mktval

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =     19.72
       Model |  11227107.9         2  5613553.96   Prob > F        =    0.0000
    Residual |  49538856.8       174  284706.074   R-squared       =    0.1848
-------------+----------------------------------   Adj R-squared   =    0.1754
       Total |  60765964.7       176  345261.163   Root MSE        =    533.58

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   11.52597   5.624648     2.05   0.042     .4246476    22.62729
      mktval |    .036974   .0062433     5.92   0.000     .0246517    .0492963
       _cons |   641.0594   64.04995    10.01   0.000     514.6446    767.4742
------------------------------------------------------------------------------

. generate er= rnormal(0,10)

. gen ceoten_obs=ceoten+er

. regress salary ceoten_obs mktval

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =     17.36
       Model |  10107106.2         2   5053553.1   Prob > F        =    0.0000
    Residual |  50658858.5       174  291142.865   R-squared       =    0.1663
-------------+----------------------------------   Adj R-squared   =    0.1567
       Total |  60765964.7       176  345261.163   Root MSE        =    539.58

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ceoten_obs |  -1.678434   3.295338    -0.51   0.611    -8.182415    4.825547
      mktval |   .0371342   .0063151     5.88   0.000     .0246702    .0495982
       _cons |   745.5106   53.10264    14.04   0.000     640.7024    850.3188
------------------------------------------------------------------------------

. regress salary ceoten mktval monthbirth

      Source |       SS           df       MS      Number of obs   =       175
-------------+----------------------------------   F(3, 171)       =     13.62
       Model |  11692156.4         3  3897385.47   Prob > F        =    0.0000
    Residual |  48916574.1       171  286061.837   R-squared       =    0.1929
-------------+----------------------------------   Adj R-squared   =    0.1788
       Total |  60608730.5       174  348326.038   Root MSE        =    534.85

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   11.46819   5.723944     2.00   0.047     .1695054    22.76688
      mktval |   .0363137   .0062921     5.77   0.000     .0238936    .0487338
  monthbirth |  -13.48747   11.24818    -1.20   0.232    -35.69065    8.715696
       _cons |   729.4592   100.0883     7.29   0.000     531.8914     927.027
------------------------------------------------------------------------------

. summarize salary ceoten mktval monthbirth

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      salary |        177    865.8644    587.5893        100       5299
      ceoten |        177    7.954802    7.150826          0         37
      mktval |        177    3600.316    6442.276        387      45400
  monthbirth |        175    6.497143    3.622843          1         12

. codebook monthbirth

--------------------------------------------------------------------------------------------------------------
monthbirth                                                                                      month of birth
--------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,12]                       units:  1
         unique values:  12                       missing .:  2/177

                  mean:   6.49714
              std. dev:   3.62284

           percentiles:        10%       25%       50%       75%       90%
                                 2         3         6        10        12

. gen m=(monthbirth==.)

. display monthbirth
1

. browse monthbirth

. browse m

. recode monthbirth (missing=0), prefix(mz_)
(2 differences between monthbirth and mz_monthbirth)

. list monthbirth mz_monthbirth if monthbirth!=mz_monthbirth

     +---------------------+
     | monthb~h   mz_mon~h |
     |---------------------|
  8. |        .          0 |
112. |        .          0 |
     +---------------------+

. regress salary m ceoten mktval mz_monthbirth

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(4, 172)       =     10.26
       Model |  11707632.3         4  2926908.07   Prob > F        =    0.0000
    Residual |  49058332.5       172  285222.863   R-squared       =    0.1927
-------------+----------------------------------   Adj R-squared   =    0.1739
       Total |  60765964.7       176  345261.163   Root MSE        =    534.06

-------------------------------------------------------------------------------
       salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            m |    99.3063   389.7746     0.25   0.799    -670.0512    868.6638
       ceoten |   10.98336   5.674019     1.94   0.055    -.2163157    22.18303
       mktval |   .0363786   .0062822     5.79   0.000     .0239785    .0487786
mz_monthbirth |  -13.50639   11.23164    -1.20   0.231      -35.676    8.663215
        _cons |   733.1589   99.80358     7.35   0.000     536.1614    930.1565
-------------------------------------------------------------------------------

. regress salary ceoten mktval monthbirth

      Source |       SS           df       MS      Number of obs   =       175
-------------+----------------------------------   F(3, 171)       =     13.62
       Model |  11692156.4         3  3897385.47   Prob > F        =    0.0000
    Residual |  48916574.1       171  286061.837   R-squared       =    0.1929
-------------+----------------------------------   Adj R-squared   =    0.1788
       Total |  60608730.5       174  348326.038   Root MSE        =    534.85

------------------------------------------------------------------------------
      salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ceoten |   11.46819   5.723944     2.00   0.047     .1695054    22.76688
      mktval |   .0363137   .0062921     5.77   0.000     .0238936    .0487338
  monthbirth |  -13.48747   11.24818    -1.20   0.232    -35.69065    8.715696
       _cons |   729.4592   100.0883     7.29   0.000     531.8914     927.027
------------------------------------------------------------------------------

. summarize salary, detail

                  1990 compensation, $1000s
-------------------------------------------------------------
      Percentiles      Smallest
 1%          129            100
 5%          270            129
10%          358            174       Obs                 177
25%          471            185       Sum of Wgt.         177

50%          707                      Mean           865.8644
                        Largest       Std. Dev.      587.5893
75%         1119           2220
90%         1550           2265       Variance       345261.2
95%         1798           2792       Skewness       2.998603
99%         2792           5299       Kurtosis       20.40129

. histogram salary, width(100) frequency
(bin=52, start=100, width=100)

. histogram salary, width(100) frequency addlabel
(bin=52, start=100, width=100)

. graph hbox salary

. regress salary c.ceoten##c.ceoten mktval if salary<5000

      Source |       SS           df       MS      Number of obs   =       176
-------------+----------------------------------   F(3, 172)       =     25.09
       Model |  12482396.2         3  4160798.75   Prob > F        =    0.0000
    Residual |  28519214.3       172  165809.385   R-squared       =    0.3044
-------------+----------------------------------   Adj R-squared   =    0.2923
       Total |  41001610.5       175  234294.917   Root MSE        =     407.2

-----------------------------------------------------------------------------------
           salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
           ceoten |   35.64757   11.61379     3.07   0.002     12.72366    58.57148
                  |
c.ceoten#c.ceoten |   -.963834   .3902212    -2.47   0.014    -1.734073    -.193595
                  |
           mktval |    .038384   .0047662     8.05   0.000     .0289763    .0477917
            _cons |   529.1724   63.96436     8.27   0.000     402.9163    655.4286
-----------------------------------------------------------------------------------

. regress salary c.ceoten##c.ceoten mktval

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(3, 173)       =     15.83
       Model |  13086189.2         3  4362063.08   Prob > F        =    0.0000
    Residual |  47679775.5       173  275605.639   R-squared       =    0.2154
-------------+----------------------------------   Adj R-squared   =    0.2017
       Total |  60765964.7       176  345261.163   Root MSE        =    524.98

-----------------------------------------------------------------------------------
           salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
           ceoten |   47.47244   14.90585     3.18   0.002     18.05171    76.89318
                  |
c.ceoten#c.ceoten |  -1.302377   .5014544    -2.60   0.010    -2.292133   -.3126203
                  |
           mktval |   .0371405    .006143     6.05   0.000     .0250156    .0492654
            _cons |   503.1456    82.4074     6.11   0.000     340.4922     665.799
-----------------------------------------------------------------------------------

. rreg salary c.ceoten##c.ceoten mktval

   Huber iteration 1:  maximum difference in weights = .88314372
   Huber iteration 2:  maximum difference in weights = .17755351
   Huber iteration 3:  maximum difference in weights = .03503352
Biweight iteration 4:  maximum difference in weights = .24218672
Biweight iteration 5:  maximum difference in weights = .03693918
Biweight iteration 6:  maximum difference in weights = .0173368
Biweight iteration 7:  maximum difference in weights = .00238057

Robust regression                               Number of obs     =        177
                                                F(  3,       173) =      28.75
                                                Prob > F          =     0.0000

-----------------------------------------------------------------------------------
           salary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
           ceoten |   25.88861   10.68767     2.42   0.016     4.793602    46.98363
                  |
c.ceoten#c.ceoten |   -.620729   .3595486    -1.73   0.086    -1.330396    .0889378
                  |
           mktval |   .0390107   .0044046     8.86   0.000      .030317    .0477044
            _cons |   523.9644   59.08707     8.87   0.000       407.34    640.5887
-----------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  /Users/mafton/Documents/School/Econ 644/class10study.log
  log type:  text
 closed on:   2 Apr 2018, 13:09:58
--------------------------------------------------------------------------------------------------------------
