--------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/debraray/Downloads/project.log
  log type:  text
 opened on:   9 Nov 2016, 06:35:25

. set more off

. 
. use "BDES_JME2013-DATASET-3.dta"

. 
. corr cif ngdp_usd
(obs=3,052)

             |      cif ngdp_usd
-------------+------------------
         cif |   1.0000
    ngdp_usd |   0.6736   1.0000


. 
. graph twoway (lfit cif ngdp_usd) (scatter cif ngdp_usd)

. 
. tempname buffer 

. drop if year!=2008
(4,429 observations deleted)

. 
. postfile `buffer' LMIdcif using projectLMId, replace 

. local reps = 50 

. local sampsize = 30 

. forvalues i = 1/`reps' {  
  2.         qui {
  3.         preserve
  4.         drop if LMId!=1
  5.         gsample `sampsize', wor
  6.         sum cif, detail  
  7.         post `buffer' (r(mean))
  8.         restore
  9.         }
 10. }

. postclose `buffer'

. use projectLMId, clear

. sum LMIdcif, det

                           LMIdcif
-------------------------------------------------------------
      Percentiles      Smallest
 1%     4280.677       4280.677
 5%     5905.608       5472.503
10%     6204.557       5905.608       Obs                  50
25%     9276.575       5932.784       Sum of Wgt.          50

50%     10643.86                      Mean           9991.653
                        Largest       Std. Dev.      2095.025
75%     11606.59       12018.31
90%     11899.57       12215.73       Variance        4389130
95%     12215.73       12253.43       Skewness      -1.144185
99%     12413.55       12413.55       Kurtosis       3.252278

. 
. clear

. use "BDES_JME2013-DATASET-3.dta"

. 
. tempname buffer

. drop if year!=2008
(4,429 observations deleted)

. 
. postfile `buffer' HIdcif using projectHId, replace 

. local reps = 50

. local sampsize = 30

. forvalues i = 1/`reps' {
  2.         qui {
  3.         preserve
  4.         drop if HId!=1
  5.         gsample `sampsize', wor
  6.         sum cif, detail
  7.         post `buffer' (r(mean))
  8.         restore
  9.         }
 10. }

. postclose `buffer'

. use projectHId, clear

. merge 1:1 _n using projectLMId

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                50  (_merge==3)
    -----------------------------------------

. sum HIdcif, det

                           HIdcif
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2338.164      -2338.164
 5%     5482.015       -1058.25
10%     12109.43       5482.015       Obs                  50
25%     24578.12       8258.541       Sum of Wgt.          50

50%     30589.62                      Mean           35760.39
                        Largest       Std. Dev.      20043.48
75%     51208.61       66757.41
90%     65294.22        68436.4       Variance       4.02e+08
95%      68436.4        75801.7       Skewness       .3641898
99%     78992.62       78992.62       Kurtosis       2.418678

. 
. capture drop _merge

. save projectmerge, replace
file projectmerge.dta saved

. 
. use projectmerge

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      HIdcif |         50    35760.39    20043.48  -2338.164   78992.62
     LMIdcif |         50    9991.653    2095.025   4280.677   12413.55

. 
. ttest HIdcif == LMIdcif, unpaired unequal

Two-sample t test with unequal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
  HIdcif |      50    35760.39    2834.576    20043.48     30064.1    41456.69
 LMIdcif |      50    9991.653    296.2813    2095.025    9396.253    10587.05
---------+--------------------------------------------------------------------
combined |     100    22876.02    1920.151    19201.51    19066.03    26686.02
---------+--------------------------------------------------------------------
    diff |            25768.74    2850.019                20044.51    31492.97
------------------------------------------------------------------------------
    diff = mean(HIdcif) - mean(LMIdcif)                           t =   9.0416
Ho: diff = 0                     Satterthwaite's degrees of freedom =  50.0705

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. graph bar (mean) HIdcif (mean) LMIdcif, ytitle(Mean Capital Inflow from Foreign Agents (in mill usd) ) title(Average Cap
> ital Inflow Comparison) legend(label(2 "Lower-Middle Income") label(1 "High Income"))

. graph export bargraph.pdf, replace 
(file /Users/debraray/Downloads/bargraph.pdf written in PDF format)

. 
end of do-file

