------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\dray\Downloads\midterm.log
  log type:  text
 opened on:  18 Oct 2018, 21:14:38

. use "C:\Users\dray\Downloads\saversdata.dta"
(SAVASTATA created this dataset on 15MAR2012)

. sum lsavings

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    lsavings |    499,386    4.141021     1.80147  -8.517193   8.517193

. sum lsavings if elig==0 & year == 2001

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    lsavings |     75,846    4.446852    1.770845  -8.517193   8.516393

. sum lsavings if elig==1 & year == 2001

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    lsavings |      9,570    1.856398    .3326183  -2.896792   2.302585

. sum lsavings if elig==0 & year == 2006

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    lsavings |     79,063    4.241782    1.654375  -8.517193   8.516393

. sum lsavings if elig==1 & year == 2006

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    lsavings |      7,060    1.924041     .280439  -1.013352   2.302585

. 
. regress lsavings i.elig##i.year if year==2001 | year==2006

      Source |       SS           df       MS      Number of obs   =   171,539
-------------+----------------------------------   F(3, 171535)    =  11579.04
       Model |  92312.0079         3  30770.6693   Prob > F        =    0.0000
    Residual |  455844.885   171,535  2.65744533   R-squared       =    0.1684
-------------+----------------------------------   Adj R-squared   =    0.1684
       Total |  548156.893   171,538  3.19554205   Root MSE        =    1.6302

------------------------------------------------------------------------------
    lsavings |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      1.elig |  -2.590453    .017684  -146.49   0.000    -2.625113   -2.555793
             |
        year |
       2006  |  -.2050693   .0082855   -24.75   0.000    -.2213087     -.18883
             |
   elig#year |
     1 2006  |   .2727116   .0268839    10.14   0.000     .2200198    .3254034
             |
       _cons |   4.446852   .0059192   751.25   0.000      4.43525    4.458453
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. gen post_ind = .;
.; invalid name
r(198);

end of do-file

r(198);

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. gen post_ind = .
(527,223 missing values generated)

. replace post_ind = 1 if (year == 2006)
(89,580 real changes made)

. replace post_ind = 0 if (year == 2001)
(90,307 real changes made)

. 
. gen post_elig = post_ind*elig
(347,336 missing values generated)

. 
. reg lsavings post_elig post_ind elig

      Source |       SS           df       MS      Number of obs   =   171,539
-------------+----------------------------------   F(3, 171535)    =  11579.04
       Model |  92312.0079         3  30770.6693   Prob > F        =    0.0000
    Residual |  455844.885   171,535  2.65744533   R-squared       =    0.1684
-------------+----------------------------------   Adj R-squared   =    0.1684
       Total |  548156.893   171,538  3.19554205   Root MSE        =    1.6302

------------------------------------------------------------------------------
    lsavings |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   post_elig |   .2727116   .0268839    10.14   0.000     .2200198    .3254034
    post_ind |  -.2050693   .0082855   -24.75   0.000    -.2213087     -.18883
        elig |  -2.590453    .017684  -146.49   0.000    -2.625113   -2.555793
       _cons |   4.446852   .0059192   751.25   0.000      4.43525    4.458453
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. regress lsavings i.elig##i.year if year==2001 | year==2006

      Source |       SS           df       MS      Number of obs   =   171,539
-------------+----------------------------------   F(3, 171535)    =  11579.04
       Model |  92312.0079         3  30770.6693   Prob > F        =    0.0000
    Residual |  455844.885   171,535  2.65744533   R-squared       =    0.1684
-------------+----------------------------------   Adj R-squared   =    0.1684
       Total |  548156.893   171,538  3.19554205   Root MSE        =    1.6302

------------------------------------------------------------------------------
    lsavings |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      1.elig |  -2.590453    .017684  -146.49   0.000    -2.625113   -2.555793
             |
        year |
       2006  |  -.2050693   .0082855   -24.75   0.000    -.2213087     -.18883
             |
   elig#year |
     1 2006  |   .2727116   .0268839    10.14   0.000     .2200198    .3254034
             |
       _cons |   4.446852   .0059192   751.25   0.000      4.43525    4.458453
------------------------------------------------------------------------------

. 
end of do-file

. regress lsavings i.elig##i.year

      Source |       SS           df       MS      Number of obs   =   499,386
-------------+----------------------------------   F(11, 499374)   =   9390.26
       Model |   277768.11        11  25251.6464   Prob > F        =    0.0000
    Residual |  1342882.98   499,374  2.68913275   R-squared       =    0.1714
-------------+----------------------------------   Adj R-squared   =    0.1714
       Total |  1620651.09   499,385  3.24529388   Root MSE        =    1.6399

------------------------------------------------------------------------------
    lsavings |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      1.elig |  -2.590453   .0177891  -145.62   0.000    -2.625319   -2.555587
             |
        year |
       2002  |  -.0787383   .0086343    -9.12   0.000    -.0956612   -.0618154
       2003  |  -.0649311   .0085164    -7.62   0.000    -.0816231   -.0482391
       2004  |   .1354103   .0082096    16.49   0.000     .1193198    .1515008
       2005  |  -.2001519   .0085764   -23.34   0.000    -.2169614   -.1833425
       2006  |  -.2050693   .0083347   -24.60   0.000    -.2214051   -.1887335
             |
   elig#year |
     1 2002  |   .0901886   .0257199     3.51   0.000     .0397785    .1405988
     1 2003  |    .104991   .0260859     4.02   0.000     .0538635    .1561184
     1 2004  |  -.0907095    .026475    -3.43   0.001    -.1425997   -.0388192
     1 2005  |   .2622561   .0270619     9.69   0.000     .2092157    .3152965
     1 2006  |   .2727116   .0270437    10.08   0.000     .2197069    .3257164
             |
       _cons |   4.446852   .0059544   746.81   0.000     4.435181    4.458522
------------------------------------------------------------------------------

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. sort elig year

. bysort elig: gen lsavings1 = lsavings[_n] - lsavings[_n-1]
(53,842 missing values generated)

. regress lsavings1 i.elig i.year i.elig##i.year, vce(cluster elig) 

Linear regression                               Number of obs     =    473,381
                                                F(0, 1)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0000
                                                Root MSE          =     2.2992

                                   (Std. Err. adjusted for 2 clusters in elig)
------------------------------------------------------------------------------
             |               Robust
   lsavings1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      1.elig |   .0011646   1.02e-14  1.1e+11   0.000     .0011646    .0011646
             |
        year |
       2002  |   .0024648   1.05e-14  2.3e+11   0.000     .0024648    .0024648
       2003  |   .0005113   1.16e-14  4.4e+10   0.000     .0005113    .0005113
       2004  |   .0006395   8.81e-15  7.3e+10   0.000     .0006395    .0006395
       2005  |    .002164   1.14e-14  1.9e+11   0.000      .002164     .002164
       2006  |   .0019285   1.20e-14  1.6e+11   0.000     .0019285    .0019285
             |
   elig#year |
     1 2002  |  -.0027442   1.05e-14 -2.6e+11   0.000    -.0027442   -.0027442
     1 2003  |  -.0000153   1.16e-14 -1.3e+09   0.000    -.0000153   -.0000153
     1 2004  |  -.0008092   8.81e-15 -9.2e+10   0.000    -.0008092   -.0008092
     1 2005  |  -.0020352   1.14e-14 -1.8e+11   0.000    -.0020352   -.0020352
     1 2006  |  -.0016362   1.20e-14 -1.4e+11   0.000    -.0016362   -.0016362
             |
       _cons |  -.0009395   1.02e-14 -9.2e+10   0.000    -.0009395   -.0009395
------------------------------------------------------------------------------

. 
end of do-file

. exit, clear
