---------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\dray\Downloads\question2.log
  log type:  text
 opened on:   3 Nov 2018, 16:34:16

. 
. use "C:\Users\dray\Downloads\minwage.dta"

. 
. regress gwage232 t

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(1, 609)       =      0.11
       Model |  9.3009e-06         1  9.3009e-06   Prob > F        =    0.7456
    Residual |  .053768398       609   .00008829   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =   -0.0015
       Total |  .053777699       610   .00008816   Root MSE        =     .0094

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   7.00e-07   2.16e-06     0.32   0.746    -3.53e-06    4.93e-06
       _cons |   .0034024   .0007631     4.46   0.000     .0019038    .0049009
------------------------------------------------------------------------------

. predict wage_dt, resid
(1 missing value generated)

. regress gmwage t

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(1, 609)       =      0.66
       Model |  .000727972         1  .000727972   Prob > F        =    0.4163
    Residual |  .670079707       609  .001100295   R-squared       =    0.0011
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |  .670807679       610  .001099685   Root MSE        =    .03317

------------------------------------------------------------------------------
      gmwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -6.19e-06   7.61e-06    -0.81   0.416    -.0000211    8.75e-06
       _cons |    .006082   .0026938     2.26   0.024     .0007918    .0113722
------------------------------------------------------------------------------

. predict xdt2, resid
(1 missing value generated)

. regress gcpi t

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(1, 609)       =     13.42
       Model |  .000199965         1  .000199965   Prob > F        =    0.0003
    Residual |  .009075444       609  .000014902   R-squared       =    0.0216
-------------+----------------------------------   Adj R-squared   =    0.0200
       Total |  .009275409       610  .000015206   Root MSE        =    .00386

------------------------------------------------------------------------------
        gcpi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   3.24e-06   8.85e-07     3.66   0.000     1.50e-06    4.98e-06
       _cons |   .0023025   .0003135     7.34   0.000     .0016868    .0029181
------------------------------------------------------------------------------

. predict wdt, resid
(1 missing value generated)

. regress wage_dt xdt2 wdt

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(2, 608)       =    125.88
       Model |  .015744458         2  .007872229   Prob > F        =    0.0000
    Residual |   .03802394       608  .000062539   R-squared       =    0.2928
-------------+----------------------------------   Adj R-squared   =    0.2905
       Total |  .053768399       610  .000088145   Root MSE        =    .00791

------------------------------------------------------------------------------
     wage_dt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        xdt2 |   .1507202   .0096608    15.60   0.000     .1317475    .1696928
         wdt |   .2378038   .0830125     2.86   0.004     .0747778    .4008298
       _cons |   1.52e-11   .0003199     0.00   1.000    -.0006283    .0006283
------------------------------------------------------------------------------

. regress gwage232 gmwage gcpi

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(2, 608)       =    125.80
       Model |  .015739988         2  .007869994   Prob > F        =    0.0000
    Residual |  .038037711       608  .000062562   R-squared       =    0.2927
-------------+----------------------------------   Adj R-squared   =    0.2904
       Total |  .053777699       610   .00008816   Root MSE        =    .00791

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |   .1505714   .0096574    15.59   0.000     .1316055    .1695372
        gcpi |   .2435223    .082128     2.97   0.003     .0822333    .4048112
       _cons |   .0021842   .0004213     5.18   0.000     .0013569    .0030115
------------------------------------------------------------------------------

. regress gwage232 gmwage gcpi, robust

Linear regression                               Number of obs     =        611
                                                F(2, 608)         =      11.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2927
                                                Root MSE          =     .00791

------------------------------------------------------------------------------
             |               Robust
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |   .1505714   .0449981     3.35   0.001     .0622007     .238942
        gcpi |   .2435223   .0905791     2.69   0.007     .0656364    .4214081
       _cons |   .0021842   .0004001     5.46   0.000     .0013985    .0029699
------------------------------------------------------------------------------

. regress gwage232 gcpi gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwage_9
>  gmwage_10 gmwage_11 gmwage_12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(14, 584)      =     20.18
       Model |  .016919577        14  .001208541   Prob > F        =    0.0000
    Residual |  .034967639       584  .000059876   R-squared       =    0.3261
-------------+----------------------------------   Adj R-squared   =    0.3099
       Total |  .051887216       598  .000086768   Root MSE        =    .00774

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gcpi |   .2077567   .0885913     2.35   0.019     .0337602    .3817532
      gmwage |   .1493019    .009484    15.74   0.000     .1306749    .1679289
    gmwage_1 |  -.0043451   .0094838    -0.46   0.647    -.0229716    .0142814
    gmwage_2 |   .0007167   .0094661     0.08   0.940     -.017875    .0193085
    gmwage_3 |  -.0188113    .009498    -1.98   0.048    -.0374656   -.0001569
    gmwage_4 |  -.0062754   .0095646    -0.66   0.512    -.0250606    .0125098
    gmwage_5 |  -.0074584   .0096048    -0.78   0.438    -.0263226    .0114057
    gmwage_6 |   .0015449   .0095503     0.16   0.872    -.0172122    .0203021
    gmwage_7 |  -.0004578   .0095175    -0.05   0.962    -.0191505     .018235
    gmwage_8 |   .0190364   .0095234     2.00   0.046      .000332    .0377407
    gmwage_9 |   .0187524   .0095198     1.97   0.049     .0000552    .0374496
   gmwage_10 |   .0120034   .0095452     1.26   0.209    -.0067437    .0307505
   gmwage_11 |   .0156649   .0095891     1.63   0.103    -.0031685    .0344982
   gmwage_12 |   .0179264   .0095979     1.87   0.062    -.0009242    .0367769
       _cons |   .0020967   .0004278     4.90   0.000     .0012564    .0029369
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. regress gwage232 gmwage gcpi t

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(3, 607)       =     83.83
       Model |  .015753759         3  .005251253   Prob > F        =    0.0000
    Residual |   .03802394       607  .000062642   R-squared       =    0.2929
-------------+----------------------------------   Adj R-squared   =    0.2894
       Total |  .053777699       610   .00008816   Root MSE        =    .00791

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |   .1507202   .0096688    15.59   0.000     .1317319    .1697085
        gcpi |   .2378038   .0830808     2.86   0.004      .074643    .4009646
           t |   8.61e-07   1.84e-06     0.47   0.639    -2.75e-06    4.47e-06
       _cons |   .0019382   .0006732     2.88   0.004     .0006162    .0032602
------------------------------------------------------------------------------

. 
end of do-file

. regress l.gmwage t
time variable not set
r(111);

. tsset t
        time variable:  t, 1 to 612
                delta:  1 unit

. regress l.gmwage t

      Source |       SS           df       MS      Number of obs   =       610
-------------+----------------------------------   F(1, 608)       =      0.65
       Model |  .000715753         1  .000715753   Prob > F        =    0.4206
    Residual |  .670074407       608  .001102096   R-squared       =    0.0011
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |   .67079016       609  .001101462   Root MSE        =     .0332

------------------------------------------------------------------------------
    L.gmwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -6.15e-06   7.63e-06    -0.81   0.421    -.0000211    8.84e-06
       _cons |   .0060806   .0027048     2.25   0.025     .0007686    .0113925
------------------------------------------------------------------------------

. predict residx, resid
(2 missing values generated)

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. regress gwage232 t

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(1, 609)       =      0.11
       Model |  9.3009e-06         1  9.3009e-06   Prob > F        =    0.7456
    Residual |  .053768398       609   .00008829   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =   -0.0015
       Total |  .053777699       610   .00008816   Root MSE        =     .0094

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   7.00e-07   2.16e-06     0.32   0.746    -3.53e-06    4.93e-06
       _cons |   .0034024   .0007631     4.46   0.000     .0019038    .0049009
------------------------------------------------------------------------------

. predict yresid, resid
(1 missing value generated)

. 
end of do-file

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. regress gcpi t

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(1, 609)       =     13.42
       Model |  .000199965         1  .000199965   Prob > F        =    0.0003
    Residual |  .009075444       609  .000014902   R-squared       =    0.0216
-------------+----------------------------------   Adj R-squared   =    0.0200
       Total |  .009275409       610  .000015206   Root MSE        =    .00386

------------------------------------------------------------------------------
        gcpi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   3.24e-06   8.85e-07     3.66   0.000     1.50e-06    4.98e-06
       _cons |   .0023025   .0003135     7.34   0.000     .0016868    .0029181
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. predict wresid, resid
(1 missing value generated)

. 
end of do-file

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. regress yresid residx wresid

      Source |       SS           df       MS      Number of obs   =       610
-------------+----------------------------------   F(2, 607)       =      3.16
       Model |  .000554582         2  .000277291   Prob > F        =    0.0430
    Residual |  .053202212       607  .000087648   R-squared       =    0.0103
-------------+----------------------------------   Adj R-squared   =    0.0071
       Total |  .053756794       609  .000088271   Root MSE        =    .00936

------------------------------------------------------------------------------
      yresid |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      residx |   -.007284   .0114515    -0.64   0.525    -.0297733    .0152053
      wresid |   .2423916   .0984275     2.46   0.014     .0490918    .4356914
       _cons |   4.66e-06   .0003791     0.01   0.990    -.0007398    .0007491
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. gwage232 l.gmwage gcpi t
command gwage232 is unrecognized
r(199);

end of do-file

r(199);

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. regress gwage232 l.gmwage gcpi t

      Source |       SS           df       MS      Number of obs   =       610
-------------+----------------------------------   F(3, 606)       =      2.14
       Model |  .000562422         3  .000187474   Prob > F        =    0.0946
    Residual |  .053202171       606  .000087792   R-squared       =    0.0105
-------------+----------------------------------   Adj R-squared   =    0.0056
       Total |  .053764594       609  .000088283   Root MSE        =    .00937

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |
         L1. |   -.007284   .0114609    -0.64   0.525    -.0297919    .0152239
             |
        gcpi |    .242388   .0985088     2.46   0.014      .048928    .4358481
           t |  -1.77e-07   2.18e-06    -0.08   0.935    -4.46e-06    4.10e-06
       _cons |   .0029074   .0007989     3.64   0.000     .0013385    .0044762
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. regress gwage232 l.gmwage gcpi t

      Source |       SS           df       MS      Number of obs   =       610
-------------+----------------------------------   F(3, 606)       =      2.14
       Model |  .000562422         3  .000187474   Prob > F        =    0.0946
    Residual |  .053202171       606  .000087792   R-squared       =    0.0105
-------------+----------------------------------   Adj R-squared   =    0.0056
       Total |  .053764594       609  .000088283   Root MSE        =    .00937

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |
         L1. |   -.007284   .0114609    -0.64   0.525    -.0297919    .0152239
             |
        gcpi |    .242388   .0985088     2.46   0.014      .048928    .4358481
           t |  -1.77e-07   2.18e-06    -0.08   0.935    -4.46e-06    4.10e-06
       _cons |   .0029074   .0007989     3.64   0.000     .0013385    .0044762
------------------------------------------------------------------------------

. 
end of do-file

. gen lag = l.gmwage
(2 missing values generated)

. browse l.gmwage
factor variables and time-series operators not allowed
r(101);

. browse lag

. gen diff2 = l2.gmwage - gmwage
(3 missing values generated)

. gen diff1 = l.gmwage - gmwage
(2 missing values generated)

. browse diff1 diff2 gmwage

. regress gwage232 gmwage diff1 diff2

      Source |       SS           df       MS      Number of obs   =       609
-------------+----------------------------------   F(3, 605)       =     79.44
       Model |  .015190227         3  .005063409   Prob > F        =    0.0000
    Residual |  .038561219       605  .000063738   R-squared       =    0.2826
-------------+----------------------------------   Adj R-squared   =    0.2790
       Total |  .053751446       608  .000088407   Root MSE        =    .00798

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |   .1468606   .0171603     8.56   0.000     .1131595    .1805616
       diff1 |  -.0035865   .0097504    -0.37   0.713    -.0227353    .0155622
       diff2 |   .0000608   .0097504     0.01   0.995     -.019088    .0192096
       _cons |   .0030128   .0003314     9.09   0.000     .0023619    .0036637
------------------------------------------------------------------------------

. regress gwage232 gmwage l.gmwage l2.gmwage

      Source |       SS           df       MS      Number of obs   =       609
-------------+----------------------------------   F(3, 605)       =     79.44
       Model |  .015190227         3  .005063409   Prob > F        =    0.0000
    Residual |  .038561219       605  .000063738   R-squared       =    0.2826
-------------+----------------------------------   Adj R-squared   =    0.2790
       Total |  .053751446       608  .000088407   Root MSE        =    .00798

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |
         --. |   .1503863   .0097504    15.42   0.000     .1312376    .1695351
         L1. |  -.0035865   .0097504    -0.37   0.713    -.0227353    .0155622
         L2. |   .0000608   .0097504     0.01   0.995     -.019088    .0192096
             |
       _cons |   .0030128   .0003314     9.09   0.000     .0023619    .0036637
------------------------------------------------------------------------------

. regress gwage232 gmwage gmwage_1 gmwage_2

      Source |       SS           df       MS      Number of obs   =       609
-------------+----------------------------------   F(3, 605)       =     79.44
       Model |  .015190227         3  .005063409   Prob > F        =    0.0000
    Residual |  .038561219       605  .000063738   R-squared       =    0.2826
-------------+----------------------------------   Adj R-squared   =    0.2790
       Total |  .053751446       608  .000088407   Root MSE        =    .00798

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |   .1503863   .0097504    15.42   0.000     .1312376    .1695351
    gmwage_1 |  -.0035865   .0097504    -0.37   0.713    -.0227353    .0155622
    gmwage_2 |   .0000608   .0097504     0.01   0.995     -.019088    .0192096
       _cons |   .0030128   .0003314     9.09   0.000     .0023619    .0036637
------------------------------------------------------------------------------

. gen Z = gmwage+gmwage_1+gmwage_2
(3 missing values generated)

. regress gwage232 Z

      Source |       SS           df       MS      Number of obs   =       609
-------------+----------------------------------   F(1, 607)       =     57.73
       Model |   .00466825         1   .00466825   Prob > F        =    0.0000
    Residual |  .049083195       607  .000080862   R-squared       =    0.0868
-------------+----------------------------------   Adj R-squared   =    0.0853
       Total |  .053751446       608  .000088407   Root MSE        =    .00899

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |   .0489535   .0064429     7.60   0.000     .0363005    .0616065
       _cons |   .0030128   .0003733     8.07   0.000     .0022797    .0037459
------------------------------------------------------------------------------

. gen sum = gmwage + gmwage_1 + gmwage_2 + gmwage_3 + gmwage_4 + gmwage_5 + gmwage_6 + gmwage_7 + gmwage_8 +
>  gmwage_9 + gmwage_10 + gmwage_11 + gmwage_12
(13 missing values generated)

. regress gwage232 sum

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(1, 597)       =     29.49
       Model |  .002442502         1  .002442502   Prob > F        =    0.0000
    Residual |  .049444714       597  .000082822   R-squared       =    0.0471
-------------+----------------------------------   Adj R-squared   =    0.0455
       Total |  .051887216       598  .000086768   Root MSE        =     .0091

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         sum |   .0182939   .0033687     5.43   0.000      .011678    .0249098
       _cons |   .0026029   .0004143     6.28   0.000     .0017893    .0034166
------------------------------------------------------------------------------

. regress gwage232 gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwage_9 g
> mwage_10 gmwage_11 gmwage_12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(13, 585)      =     21.15
       Model |  .016590285        13  .001276176   Prob > F        =    0.0000
    Residual |   .03529693       585  .000060337   R-squared       =    0.3197
-------------+----------------------------------   Adj R-squared   =    0.3046
       Total |  .051887216       598  .000086768   Root MSE        =    .00777

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |   .1493651   .0095204    15.69   0.000     .1306667    .1680634
    gmwage_1 |  -.0028778   .0094995    -0.30   0.762     -.021535    .0157794
    gmwage_2 |   .0011375   .0095007     0.12   0.905    -.0175222    .0197972
    gmwage_3 |  -.0169406   .0095008    -1.78   0.075    -.0356004    .0017191
    gmwage_4 |  -.0037859    .009542    -0.40   0.692    -.0225266    .0149549
    gmwage_5 |  -.0042493   .0095433    -0.45   0.656    -.0229926     .014494
    gmwage_6 |   .0036803   .0095433     0.39   0.700     -.015063    .0224236
    gmwage_7 |    .000602   .0095433     0.06   0.950    -.0181413    .0193453
    gmwage_8 |   .0204094   .0095419     2.14   0.033     .0016688      .03915
    gmwage_9 |   .0199881   .0095417     2.09   0.037     .0012479    .0387282
   gmwage_10 |   .0140516   .0095417     1.47   0.141    -.0046885    .0327917
   gmwage_11 |   .0186562   .0095404     1.96   0.051    -.0000814    .0373938
   gmwage_12 |   .0206957   .0095615     2.16   0.031     .0019167    .0394748
       _cons |   .0026658   .0003537     7.54   0.000     .0019711    .0033604
------------------------------------------------------------------------------

. gen sub1 = gmwage_1 - gmwage
(2 missing values generated)

. gen sub1 = gmwage_2 - gmwage
variable sub1 already defined
r(110);

. gen sub2 = gmwage_2 - gmwage
(3 missing values generated)

. gen sub3 = gmwage_3 - gmwage
(4 missing values generated)

. gen sub4 = gmwage_4 - gmwage
(5 missing values generated)

. gen sub5 = gmwage_5 - gmwage
(6 missing values generated)

. gen sub6 = gmwage_6 - gmwage
(7 missing values generated)

. gen sub7 = gmwage_7 - gmwage
(8 missing values generated)

. gen sub8 = gmwage_8 - gmwage
(9 missing values generated)

. gen sub9 = gmwage_9 - gmwage
(10 missing values generated)

. gen sub10 = gmwage_10 - gmwage
(11 missing values generated)

. gen sub11 = gmwage_11 - gmwage
(12 missing values generated)

. gen sub12 = gmwage_12 - gmwage
(13 missing values generated)

. regress gwage232 gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwage_9 g
> mwage_10 gmwage_11 gmwage_12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(13, 585)      =     21.15
       Model |  .016590285        13  .001276176   Prob > F        =    0.0000
    Residual |   .03529693       585  .000060337   R-squared       =    0.3197
-------------+----------------------------------   Adj R-squared   =    0.3046
       Total |  .051887216       598  .000086768   Root MSE        =    .00777

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |   .1493651   .0095204    15.69   0.000     .1306667    .1680634
    gmwage_1 |  -.0028778   .0094995    -0.30   0.762     -.021535    .0157794
    gmwage_2 |   .0011375   .0095007     0.12   0.905    -.0175222    .0197972
    gmwage_3 |  -.0169406   .0095008    -1.78   0.075    -.0356004    .0017191
    gmwage_4 |  -.0037859    .009542    -0.40   0.692    -.0225266    .0149549
    gmwage_5 |  -.0042493   .0095433    -0.45   0.656    -.0229926     .014494
    gmwage_6 |   .0036803   .0095433     0.39   0.700     -.015063    .0224236
    gmwage_7 |    .000602   .0095433     0.06   0.950    -.0181413    .0193453
    gmwage_8 |   .0204094   .0095419     2.14   0.033     .0016688      .03915
    gmwage_9 |   .0199881   .0095417     2.09   0.037     .0012479    .0387282
   gmwage_10 |   .0140516   .0095417     1.47   0.141    -.0046885    .0327917
   gmwage_11 |   .0186562   .0095404     1.96   0.051    -.0000814    .0373938
   gmwage_12 |   .0206957   .0095615     2.16   0.031     .0019167    .0394748
       _cons |   .0026658   .0003537     7.54   0.000     .0019711    .0033604
------------------------------------------------------------------------------

. regress gwage232 sub1 sub2 sub3 sub4 sub5 sub6 sub7 sub8 sub9 sub10 sub11 sub12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(12, 586)      =     18.92
       Model |  .014489581        12  .001207465   Prob > F        =    0.0000
    Residual |  .037397635       586  .000063818   R-squared       =    0.2793
-------------+----------------------------------   Adj R-squared   =    0.2645
       Total |  .051887216       598  .000086768   Root MSE        =    .00799

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sub1 |  -.0198142   .0093131    -2.13   0.034    -.0381052   -.0015232
        sub2 |  -.0160054   .0093029    -1.72   0.086    -.0342765    .0022658
        sub3 |  -.0340868   .0093028    -3.66   0.000    -.0523577    -.015816
        sub4 |  -.0210096    .009343    -2.25   0.025    -.0393595   -.0026597
        sub5 |  -.0217253   .0093302    -2.33   0.020      -.04005   -.0034007
        sub6 |  -.0137957   .0093302    -1.48   0.140    -.0321204    .0045289
        sub7 |  -.0168741   .0093302    -1.81   0.071    -.0351987    .0014506
        sub8 |    .003185   .0093429     0.34   0.733    -.0151646    .0215346
        sub9 |   .0027852   .0093438     0.30   0.766    -.0155663    .0211367
       sub10 |  -.0031479    .009344    -0.34   0.736    -.0214997    .0152039
       sub11 |   .0016645   .0093542     0.18   0.859    -.0167072    .0200363
       sub12 |   .0050548   .0094481     0.54   0.593    -.0135014     .023611
       _cons |   .0035866   .0003264    10.99   0.000     .0029455    .0042277
------------------------------------------------------------------------------

. regress gwage232 gmwage sub1 sub2 sub3 sub4 sub5 sub6 sub7 sub8 sub9 sub10 sub11 sub12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(13, 585)      =     21.15
       Model |  .016590285        13  .001276176   Prob > F        =    0.0000
    Residual |   .03529693       585  .000060337   R-squared       =    0.3197
-------------+----------------------------------   Adj R-squared   =    0.3046
       Total |  .051887216       598  .000086768   Root MSE        =    .00777

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |   .2207322   .0374088     5.90   0.000     .1472603    .2942041
        sub1 |  -.0028778   .0094995    -0.30   0.762     -.021535    .0157794
        sub2 |   .0011375   .0095007     0.12   0.905    -.0175222    .0197972
        sub3 |  -.0169406   .0095008    -1.78   0.075    -.0356004    .0017191
        sub4 |  -.0037859    .009542    -0.40   0.692    -.0225266    .0149549
        sub5 |  -.0042493   .0095433    -0.45   0.656    -.0229926     .014494
        sub6 |   .0036803   .0095433     0.39   0.700     -.015063    .0224236
        sub7 |    .000602   .0095433     0.06   0.950    -.0181413    .0193453
        sub8 |   .0204094   .0095419     2.14   0.033     .0016688      .03915
        sub9 |   .0199881   .0095417     2.09   0.037     .0012479    .0387282
       sub10 |   .0140516   .0095417     1.47   0.141    -.0046885    .0327917
       sub11 |   .0186562   .0095404     1.96   0.051    -.0000814    .0373938
       sub12 |   .0206957   .0095615     2.16   0.031     .0019167    .0394748
       _cons |   .0026658   .0003537     7.54   0.000     .0019711    .0033604
------------------------------------------------------------------------------

. regress gwage232 gcpi gmwage sub1 sub2 sub3 sub4 sub5 sub6 sub7 sub8 sub9 sub10 sub11 sub12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(14, 584)      =     20.18
       Model |  .016919577        14  .001208541   Prob > F        =    0.0000
    Residual |  .034967639       584  .000059876   R-squared       =    0.3261
-------------+----------------------------------   Adj R-squared   =    0.3099
       Total |  .051887216       598  .000086768   Root MSE        =    .00774

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gcpi |   .2077567   .0885913     2.35   0.019     .0337602    .3817532
      gmwage |    .197599   .0385492     5.13   0.000     .1218869     .273311
        sub1 |  -.0043451   .0094838    -0.46   0.647    -.0229716    .0142814
        sub2 |   .0007167   .0094661     0.08   0.940     -.017875    .0193085
        sub3 |  -.0188113    .009498    -1.98   0.048    -.0374656   -.0001569
        sub4 |  -.0062754   .0095646    -0.66   0.512    -.0250606    .0125098
        sub5 |  -.0074584   .0096048    -0.78   0.438    -.0263226    .0114057
        sub6 |   .0015449   .0095503     0.16   0.872    -.0172122    .0203021
        sub7 |  -.0004578   .0095175    -0.05   0.962    -.0191505     .018235
        sub8 |   .0190364   .0095234     2.00   0.046      .000332    .0377407
        sub9 |   .0187524   .0095198     1.97   0.049     .0000552    .0374496
       sub10 |   .0120034   .0095452     1.26   0.209    -.0067437    .0307505
       sub11 |   .0156649   .0095891     1.63   0.103    -.0031685    .0344982
       sub12 |   .0179264   .0095979     1.87   0.062    -.0009242    .0367769
       _cons |   .0020967   .0004278     4.90   0.000     .0012564    .0029369
------------------------------------------------------------------------------

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. regress gwage232 gcpi gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwag
> e_9 gmwage_10 gmwage_11 gmwage_12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(14, 584)      =     20.18
       Model |  .016919577        14  .001208541   Prob > F        =    0.0000
    Residual |  .034967639       584  .000059876   R-squared       =    0.3261
-------------+----------------------------------   Adj R-squared   =    0.3099
       Total |  .051887216       598  .000086768   Root MSE        =    .00774

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gcpi |   .2077567   .0885913     2.35   0.019     .0337602    .3817532
      gmwage |   .1493019    .009484    15.74   0.000     .1306749    .1679289
    gmwage_1 |  -.0043451   .0094838    -0.46   0.647    -.0229716    .0142814
    gmwage_2 |   .0007167   .0094661     0.08   0.940     -.017875    .0193085
    gmwage_3 |  -.0188113    .009498    -1.98   0.048    -.0374656   -.0001569
    gmwage_4 |  -.0062754   .0095646    -0.66   0.512    -.0250606    .0125098
    gmwage_5 |  -.0074584   .0096048    -0.78   0.438    -.0263226    .0114057
    gmwage_6 |   .0015449   .0095503     0.16   0.872    -.0172122    .0203021
    gmwage_7 |  -.0004578   .0095175    -0.05   0.962    -.0191505     .018235
    gmwage_8 |   .0190364   .0095234     2.00   0.046      .000332    .0377407
    gmwage_9 |   .0187524   .0095198     1.97   0.049     .0000552    .0374496
   gmwage_10 |   .0120034   .0095452     1.26   0.209    -.0067437    .0307505
   gmwage_11 |   .0156649   .0095891     1.63   0.103    -.0031685    .0344982
   gmwage_12 |   .0179264   .0095979     1.87   0.062    -.0009242    .0367769
       _cons |   .0020967   .0004278     4.90   0.000     .0012564    .0029369
------------------------------------------------------------------------------

. 
end of do-file

. regress gwage232 gcpi gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwage_9
>  gmwage_10 gmwage_11 gmwage_12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(14, 584)      =     20.18
       Model |  .016919577        14  .001208541   Prob > F        =    0.0000
    Residual |  .034967639       584  .000059876   R-squared       =    0.3261
-------------+----------------------------------   Adj R-squared   =    0.3099
       Total |  .051887216       598  .000086768   Root MSE        =    .00774

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gcpi |   .2077567   .0885913     2.35   0.019     .0337602    .3817532
      gmwage |   .1493019    .009484    15.74   0.000     .1306749    .1679289
    gmwage_1 |  -.0043451   .0094838    -0.46   0.647    -.0229716    .0142814
    gmwage_2 |   .0007167   .0094661     0.08   0.940     -.017875    .0193085
    gmwage_3 |  -.0188113    .009498    -1.98   0.048    -.0374656   -.0001569
    gmwage_4 |  -.0062754   .0095646    -0.66   0.512    -.0250606    .0125098
    gmwage_5 |  -.0074584   .0096048    -0.78   0.438    -.0263226    .0114057
    gmwage_6 |   .0015449   .0095503     0.16   0.872    -.0172122    .0203021
    gmwage_7 |  -.0004578   .0095175    -0.05   0.962    -.0191505     .018235
    gmwage_8 |   .0190364   .0095234     2.00   0.046      .000332    .0377407
    gmwage_9 |   .0187524   .0095198     1.97   0.049     .0000552    .0374496
   gmwage_10 |   .0120034   .0095452     1.26   0.209    -.0067437    .0307505
   gmwage_11 |   .0156649   .0095891     1.63   0.103    -.0031685    .0344982
   gmwage_12 |   .0179264   .0095979     1.87   0.062    -.0009242    .0367769
       _cons |   .0020967   .0004278     4.90   0.000     .0012564    .0029369
------------------------------------------------------------------------------

. 
. regress gwage232 t

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(1, 609)       =      0.11
       Model |  9.3009e-06         1  9.3009e-06   Prob > F        =    0.7456
    Residual |  .053768398       609   .00008829   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =   -0.0015
       Total |  .053777699       610   .00008816   Root MSE        =     .0094

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   7.00e-07   2.16e-06     0.32   0.746    -3.53e-06    4.93e-06
       _cons |   .0034024   .0007631     4.46   0.000     .0019038    .0049009
------------------------------------------------------------------------------

. 
. predict yresid, resid
variable yresid already defined
r(110);

. 
. regress gcpi t

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(1, 609)       =     13.42
       Model |  .000199965         1  .000199965   Prob > F        =    0.0003
    Residual |  .009075444       609  .000014902   R-squared       =    0.0216
-------------+----------------------------------   Adj R-squared   =    0.0200
       Total |  .009275409       610  .000015206   Root MSE        =    .00386

------------------------------------------------------------------------------
        gcpi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   3.24e-06   8.85e-07     3.66   0.000     1.50e-06    4.98e-06
       _cons |   .0023025   .0003135     7.34   0.000     .0016868    .0029181
------------------------------------------------------------------------------

. 
. predict wresid, resid
variable wresid already defined
r(110);

. 
. regress gmwage_1 t

      Source |       SS           df       MS      Number of obs   =       610
-------------+----------------------------------   F(1, 608)       =      0.65
       Model |  .000715753         1  .000715753   Prob > F        =    0.4206
    Residual |  .670074407       608  .001102096   R-squared       =    0.0011
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |   .67079016       609  .001101462   Root MSE        =     .0332

------------------------------------------------------------------------------
    gmwage_1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -6.15e-06   7.63e-06    -0.81   0.421    -.0000211    8.84e-06
       _cons |   .0060806   .0027048     2.25   0.025     .0007686    .0113925
------------------------------------------------------------------------------

. 
. predict residx1, resid
(2 missing values generated)

. 
. regress gmwage_2 t

      Source |       SS           df       MS      Number of obs   =       609
-------------+----------------------------------   F(1, 607)       =      0.64
       Model |  .000703575         1  .000703575   Prob > F        =    0.4250
    Residual |  .670069009       607  .001103903   R-squared       =    0.0010
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |  .670772584       608  .001103244   Root MSE        =    .03323

------------------------------------------------------------------------------
    gmwage_2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -6.11e-06   7.66e-06    -0.80   0.425    -.0000212    8.93e-06
       _cons |    .006079   .0027159     2.24   0.026     .0007452    .0114127
------------------------------------------------------------------------------

. 
. predict residx2, resid
(3 missing values generated)

. 
. regress gmwage_3 t

      Source |       SS           df       MS      Number of obs   =       608
-------------+----------------------------------   F(1, 606)       =      0.63
       Model |  .000691439         1  .000691439   Prob > F        =    0.4294
    Residual |   .67006351       606  .001105715   R-squared       =    0.0010
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |   .67075495       607  .001105033   Root MSE        =    .03325

------------------------------------------------------------------------------
    gmwage_3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -6.08e-06   7.68e-06    -0.79   0.429    -.0000212    9.01e-06
       _cons |   .0060772   .0027271     2.23   0.026     .0007214     .011433
------------------------------------------------------------------------------

. 
. predict residx3, resid
(4 missing values generated)

. 
. regress gmwage_4 t

      Source |       SS           df       MS      Number of obs   =       607
-------------+----------------------------------   F(1, 605)       =      0.92
       Model |  .001008552         1  .001008552   Prob > F        =    0.3381
    Residual |  .663861591       605  .001097292   R-squared       =    0.0015
-------------+----------------------------------   Adj R-squared   =   -0.0001
       Total |  .664870144       606  .001097145   Root MSE        =    .03313

------------------------------------------------------------------------------
    gmwage_4 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -7.36e-06   7.67e-06    -0.96   0.338    -.0000224    7.71e-06
       _cons |   .0063496   .0027257     2.33   0.020     .0009967    .0117025
------------------------------------------------------------------------------

. 
. predict residx4, resid
(5 missing values generated)

. 
. regress gmwage_5 t

      Source |       SS           df       MS      Number of obs   =       606
-------------+----------------------------------   F(1, 604)       =      0.91
       Model |  .000995343         1  .000995343   Prob > F        =    0.3417
    Residual |  .663858155       604  .001099103   R-squared       =    0.0015
-------------+----------------------------------   Adj R-squared   =   -0.0002
       Total |  .664853499       605  .001098931   Root MSE        =    .03315

------------------------------------------------------------------------------
    gmwage_5 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -7.33e-06   7.70e-06    -0.95   0.342    -.0000224    7.79e-06
       _cons |   .0063506   .0027369     2.32   0.021     .0009756    .0117257
------------------------------------------------------------------------------

. 
. predict residx5, resid
(6 missing values generated)

. 
. regress gmwage_6 t

      Source |       SS           df       MS      Number of obs   =       605
-------------+----------------------------------   F(1, 603)       =      0.89
       Model |  .000982152         1  .000982152   Prob > F        =    0.3453
    Residual |  .663854646       603   .00110092   R-squared       =    0.0015
-------------+----------------------------------   Adj R-squared   =   -0.0002
       Total |  .664836798       604  .001100723   Root MSE        =    .03318

------------------------------------------------------------------------------
    gmwage_6 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -7.30e-06   7.72e-06    -0.94   0.345    -.0000225    7.87e-06
       _cons |   .0063515   .0027483     2.31   0.021     .0009542    .0117488
------------------------------------------------------------------------------

. 
. predict residx6, resid
(7 missing values generated)

. 
. regress gmwage_7 t

      Source |       SS           df       MS      Number of obs   =       604
-------------+----------------------------------   F(1, 602)       =      0.88
       Model |   .00096898         1   .00096898   Prob > F        =    0.3489
    Residual |  .663851063       602  .001102743   R-squared       =    0.0015
-------------+----------------------------------   Adj R-squared   =   -0.0002
       Total |  .664820043       603  .001102521   Root MSE        =    .03321

------------------------------------------------------------------------------
    gmwage_7 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -7.26e-06   7.75e-06    -0.94   0.349    -.0000225    7.96e-06
       _cons |   .0063523   .0027596     2.30   0.022     .0009326     .011772
------------------------------------------------------------------------------

. 
. predict residx7, resid
(8 missing values generated)

. 
. regress gmwage_8 t

      Source |       SS           df       MS      Number of obs   =       603
-------------+----------------------------------   F(1, 601)       =      0.87
       Model |  .000955828         1  .000955828   Prob > F        =    0.3526
    Residual |  .663847404       601  .001104571   R-squared       =    0.0014
-------------+----------------------------------   Adj R-squared   =   -0.0002
       Total |  .664803232       602  .001104324   Root MSE        =    .03324

------------------------------------------------------------------------------
    gmwage_8 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -7.23e-06   7.78e-06    -0.93   0.353    -.0000225    8.04e-06
       _cons |   .0063529   .0027711     2.29   0.022     .0009107    .0117951
------------------------------------------------------------------------------

. 
. predict residx8, resid
(9 missing values generated)

. 
. regress gmwage_9 t

      Source |       SS           df       MS      Number of obs   =       602
-------------+----------------------------------   F(1, 600)       =      0.85
       Model |  .000942697         1  .000942697   Prob > F        =    0.3563
    Residual |  .663843667       600  .001106406   R-squared       =    0.0014
-------------+----------------------------------   Adj R-squared   =   -0.0002
       Total |  .664786365       601  .001106134   Root MSE        =    .03326

------------------------------------------------------------------------------
    gmwage_9 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -7.20e-06   7.80e-06    -0.92   0.356    -.0000225    8.12e-06
       _cons |   .0063534   .0027826     2.28   0.023     .0008886    .0118183
------------------------------------------------------------------------------

. 
. predict residx9, resid
(10 missing values generated)

. 
. regress gmwage_10 t

      Source |       SS           df       MS      Number of obs   =       601
-------------+----------------------------------   F(1, 599)       =      0.84
       Model |  .000929588         1  .000929588   Prob > F        =    0.3601
    Residual |  .663839853       599  .001108247   R-squared       =    0.0014
-------------+----------------------------------   Adj R-squared   =   -0.0003
       Total |  .664769441       600  .001107949   Root MSE        =    .03329

------------------------------------------------------------------------------
   gmwage_10 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -7.17e-06   7.83e-06    -0.92   0.360    -.0000225    8.20e-06
       _cons |   .0063538   .0027942     2.27   0.023     .0008661    .0118414
------------------------------------------------------------------------------

. 
. predict residx10, resid
(11 missing values generated)

. 
. regress gmwage_11 t

      Source |       SS           df       MS      Number of obs   =       600
-------------+----------------------------------   F(1, 598)       =      0.83
       Model |  .000916502         1  .000916502   Prob > F        =    0.3639
    Residual |   .66383596       598  .001110094   R-squared       =    0.0014
-------------+----------------------------------   Adj R-squared   =   -0.0003
       Total |  .664752462       599   .00110977   Root MSE        =    .03332

------------------------------------------------------------------------------
   gmwage_11 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -7.14e-06   7.85e-06    -0.91   0.364    -.0000226    8.29e-06
       _cons |   .0063539   .0028059     2.26   0.024     .0008434    .0118645
------------------------------------------------------------------------------

. 
. predict residx11, resid
(12 missing values generated)

. 
. regress gmwage_12 t

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(1, 597)       =      0.81
       Model |   .00090344         1   .00090344   Prob > F        =    0.3677
    Residual |  .663831985       597  .001111946   R-squared       =    0.0014
-------------+----------------------------------   Adj R-squared   =   -0.0003
       Total |  .664735426       598  .001111598   Root MSE        =    .03335

------------------------------------------------------------------------------
   gmwage_12 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -7.10e-06   7.88e-06    -0.90   0.368    -.0000226    8.37e-06
       _cons |    .006354   .0028176     2.26   0.024     .0008204    .0118875
------------------------------------------------------------------------------

. 
. predict residx12, resid
(13 missing values generated)

. regress yresid wresid residx residx1 residx2 residx3 residx4 residx5 residx6 residx7 residx8 residx9 residx10
>  residx11 residx12
note: residx1 omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(13, 585)      =      1.87
       Model |  .002066937        13  .000158995   Prob > F        =    0.0310
    Residual |  .049805003       585  .000085137   R-squared       =    0.0398
-------------+----------------------------------   Adj R-squared   =    0.0185
       Total |   .05187194       598  .000086742   Root MSE        =    .00923

------------------------------------------------------------------------------
      yresid |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      wresid |   .2080653    .109123     1.91   0.057    -.0062552    .4223858
      residx |  -.0069777   .0113292    -0.62   0.538    -.0292285    .0152732
     residx1 |          0  (omitted)
     residx2 |  -.0017788   .0113004    -0.16   0.875    -.0239732    .0204156
     residx3 |  -.0213419   .0113491    -1.88   0.061    -.0436319    .0009481
     residx4 |  -.0089135   .0114398    -0.78   0.436    -.0313816    .0135547
     residx5 |  -.0099317   .0114958    -0.86   0.388    -.0325099    .0126464
     residx6 |  -.0009279   .0114189    -0.08   0.935    -.0233549    .0214992
     residx7 |  -.0029301   .0113696    -0.26   0.797    -.0252603       .0194
     residx8 |   .0189707   .0113804     1.67   0.096    -.0033808    .0413222
     residx9 |     .01632   .0113723     1.44   0.152    -.0060155    .0386555
    residx10 |   .0095665   .0114092     0.84   0.402    -.0128415    .0319745
    residx11 |   .0152152   .0114719     1.33   0.185    -.0073159    .0377463
    residx12 |   .0282718   .0114527     2.47   0.014     .0057785    .0507652
       _cons |   9.68e-07   .0003773     0.00   0.998      -.00074    .0007419
------------------------------------------------------------------------------

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. regress gmwage t

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(1, 609)       =      0.66
       Model |  .000727972         1  .000727972   Prob > F        =    0.4163
    Residual |  .670079707       609  .001100295   R-squared       =    0.0011
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |  .670807679       610  .001099685   Root MSE        =    .03317

------------------------------------------------------------------------------
      gmwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -6.19e-06   7.61e-06    -0.81   0.416    -.0000211    8.75e-06
       _cons |    .006082   .0026938     2.26   0.024     .0007918    .0113722
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. regress gmwage_1 t

      Source |       SS           df       MS      Number of obs   =       610
-------------+----------------------------------   F(1, 608)       =      0.65
       Model |  .000715753         1  .000715753   Prob > F        =    0.4206
    Residual |  .670074407       608  .001102096   R-squared       =    0.0011
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |   .67079016       609  .001101462   Root MSE        =     .0332

------------------------------------------------------------------------------
    gmwage_1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -6.15e-06   7.63e-06    -0.81   0.421    -.0000211    8.84e-06
       _cons |   .0060806   .0027048     2.25   0.025     .0007686    .0113925
------------------------------------------------------------------------------

. 
end of do-file

. browse residx residx1

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. regress gmwage_1 t

      Source |       SS           df       MS      Number of obs   =       610
-------------+----------------------------------   F(1, 608)       =      0.65
       Model |  .000715753         1  .000715753   Prob > F        =    0.4206
    Residual |  .670074407       608  .001102096   R-squared       =    0.0011
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |   .67079016       609  .001101462   Root MSE        =     .0332

------------------------------------------------------------------------------
    gmwage_1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -6.15e-06   7.63e-06    -0.81   0.421    -.0000211    8.84e-06
       _cons |   .0060806   .0027048     2.25   0.025     .0007686    .0113925
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. predict residx_1, resid
(2 missing values generated)

. 
end of do-file

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. regress gmwage t

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(1, 609)       =      0.66
       Model |  .000727972         1  .000727972   Prob > F        =    0.4163
    Residual |  .670079707       609  .001100295   R-squared       =    0.0011
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |  .670807679       610  .001099685   Root MSE        =    .03317

------------------------------------------------------------------------------
      gmwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -6.19e-06   7.61e-06    -0.81   0.416    -.0000211    8.75e-06
       _cons |    .006082   .0026938     2.26   0.024     .0007918    .0113722
------------------------------------------------------------------------------

. predict residx_0, resid
(1 missing value generated)

. 
end of do-file

. regress yresid wresid residx_0 residx_1 residx2 residx3 residx4 residx5 residx6 residx7 residx8 residx9 resid
> x10 residx11 residx12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(14, 584)      =     20.24
       Model |  .016947914        14  .001210565   Prob > F        =    0.0000
    Residual |  .034924026       584  .000059801   R-squared       =    0.3267
-------------+----------------------------------   Adj R-squared   =    0.3106
       Total |   .05187194       598  .000086742   Root MSE        =    .00773

------------------------------------------------------------------------------
      yresid |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      wresid |   .1880283   .0914651     2.06   0.040     .0083878    .3676689
    residx_0 |   .1496609   .0094874    15.77   0.000     .1310273    .1682945
    residx_1 |  -.0038285   .0094971    -0.40   0.687    -.0224812    .0148242
     residx2 |    .001133   .0094727     0.12   0.905    -.0174717    .0197378
     residx3 |  -.0182627   .0095137    -1.92   0.055    -.0369481    .0004226
     residx4 |  -.0056132     .00959    -0.59   0.559    -.0244483     .013222
     residx5 |  -.0067277   .0096368    -0.70   0.485    -.0256548    .0121994
     residx6 |   .0021683   .0095722     0.23   0.821    -.0166319    .0209685
     residx7 |    .000058   .0095308     0.01   0.995    -.0186607    .0187767
     residx8 |   .0195708   .0095381     2.05   0.041     .0008377    .0383038
     residx9 |    .019268    .009533     2.02   0.044     .0005449    .0379911
    residx10 |   .0125907    .009564     1.32   0.189    -.0061934    .0313747
    residx11 |   .0163317   .0096149     1.70   0.090    -.0025523    .0352156
    residx12 |   .0185353   .0096183     1.93   0.054    -.0003555     .037426
       _cons |  -.0000214   .0003162    -0.07   0.946    -.0006424    .0005996
------------------------------------------------------------------------------

. regress gemp232 gcpi gmwage sub1 sub2 sub3 sub4 sub5 sub6 sub7 sub8 sub9 sub10 sub11 sub12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(14, 584)      =      0.94
       Model |  .004563835        14  .000325988   Prob > F        =    0.5098
    Residual |   .20150455       584  .000345042   R-squared       =    0.0221
-------------+----------------------------------   Adj R-squared   =   -0.0013
       Total |  .206068385       598  .000344596   Root MSE        =    .01858

------------------------------------------------------------------------------
     gemp232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gcpi |  -.1143189   .2126672    -0.54   0.591    -.5320047    .3033669
      gmwage |   .0257437   .0925391     0.28   0.781    -.1560063    .2074936
        sub1 |   .0131872   .0227662     0.58   0.563    -.0315265    .0579009
        sub2 |  -.0310154   .0227237    -1.36   0.173    -.0756456    .0136148
        sub3 |  -.0056972   .0228003    -0.25   0.803    -.0504778    .0390833
        sub4 |  -.0013479   .0229603    -0.06   0.953    -.0464426    .0437468
        sub5 |   .0023392   .0230567     0.10   0.919     -.042945    .0476233
        sub6 |   .0454017   .0229259     1.98   0.048     .0003744     .090429
        sub7 |   .0275713   .0228472     1.21   0.228    -.0173015    .0724441
        sub8 |  -.0173222   .0228614    -0.76   0.449    -.0622228    .0275785
        sub9 |   -.024838   .0228527    -1.09   0.278    -.0697214    .0200455
       sub10 |  -.0230005   .0229137    -1.00   0.316    -.0680038    .0220028
       sub11 |   .0102054   .0230191     0.44   0.658    -.0350049    .0554156
       sub12 |   .0345125   .0230401     1.50   0.135     -.010739     .079764
       _cons |  -.0002012    .001027    -0.20   0.845    -.0022182    .0018158
------------------------------------------------------------------------------

. do "C:\Users\dray\AppData\Local\Temp\STD03000000.tmp"

. regress gwage232 t

      Source |       SS           df       MS      Number of obs   =       611
-------------+----------------------------------   F(1, 609)       =      0.11
       Model |  9.3009e-06         1  9.3009e-06   Prob > F        =    0.7456
    Residual |  .053768398       609   .00008829   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =   -0.0015
       Total |  .053777699       610   .00008816   Root MSE        =     .0094

------------------------------------------------------------------------------
    gwage232 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   7.00e-07   2.16e-06     0.32   0.746    -3.53e-06    4.93e-06
       _cons |   .0034024   .0007631     4.46   0.000     .0019038    .0049009
------------------------------------------------------------------------------

. predict yresid, resid
variable yresid already defined
r(110);

end of do-file

r(110);

. regress cpi minwage

      Source |       SS           df       MS      Number of obs   =       612
-------------+----------------------------------   F(1, 610)       =  11841.17
       Model |  1185550.94         1  1185550.94   Prob > F        =    0.0000
    Residual |  61073.8795       610  100.121114   R-squared       =    0.9510
-------------+----------------------------------   Adj R-squared   =    0.9509
       Total |  1246624.82       611  2040.30249   Root MSE        =    10.006

------------------------------------------------------------------------------
         cpi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     minwage |   33.67397   .3094547   108.82   0.000     33.06625     34.2817
       _cons |  -6.074714   .7813924    -7.77   0.000     -7.60926   -4.540169
------------------------------------------------------------------------------

. regress minwage cpi

      Source |       SS           df       MS      Number of obs   =       612
-------------+----------------------------------   F(1, 610)       =  11841.17
       Model |  994.296667         1  994.296667   Prob > F        =    0.0000
    Residual |  51.2213795       610  .083969475   R-squared       =    0.9510
-------------+----------------------------------   Adj R-squared   =    0.9509
       Total |  1045.51805       611  1.71115883   Root MSE        =    .28977

------------------------------------------------------------------------------
     minwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         cpi |   .0282417   .0002595   108.82   0.000      .027732    .0287513
       _cons |   .2774038   .0208964    13.28   0.000     .2363662    .3184414
------------------------------------------------------------------------------

. regress gcpi gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwage_9 gmwage_1
> 0 gmwage_11 gmwage_12

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(13, 585)      =      4.13
       Model |  .000699565        13  .000053813   Prob > F        =    0.0000
    Residual |  .007629056       585  .000013041   R-squared       =    0.0840
-------------+----------------------------------   Adj R-squared   =    0.0636
       Total |  .008328622       598  .000013927   Root MSE        =    .00361

------------------------------------------------------------------------------
        gcpi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |   .0003042   .0044261     0.07   0.945    -.0083888    .0089972
    gmwage_1 |   .0070626   .0044164     1.60   0.110    -.0016113    .0157365
    gmwage_2 |   .0020252    .004417     0.46   0.647    -.0066498    .0107002
    gmwage_3 |    .009004    .004417     2.04   0.042     .0003289    .0176791
    gmwage_4 |    .011983   .0044362     2.70   0.007     .0032702    .0206957
    gmwage_5 |   .0154466   .0044368     3.48   0.001     .0067327    .0241605
    gmwage_6 |   .0102781   .0044368     2.32   0.021     .0015642     .018992
    gmwage_7 |   .0051009   .0044368     1.15   0.251     -.003613    .0138148
    gmwage_8 |    .006609   .0044361     1.49   0.137    -.0021036    .0153217
    gmwage_9 |   .0059476    .004436     1.34   0.181    -.0027649      .01466
   gmwage_10 |   .0098586    .004436     2.22   0.027     .0011462     .018571
   gmwage_11 |   .0143982   .0044354     3.25   0.001      .005687    .0231094
   gmwage_12 |   .0133298   .0044452     3.00   0.003     .0045993    .0220603
       _cons |   .0027392   .0001644    16.66   0.000     .0024163    .0030621
------------------------------------------------------------------------------

. regress gcpi gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwage_9 gmwage_1
> 0 gmwage_11 gmwage_12 t tsq
variable tsq not found
r(111);

. gen tsq = t^2

. regress gcpi gmwage gmwage_1 gmwage_2 gmwage_3 gmwage_4 gmwage_5 gmwage_6 gmwage_7 gmwage_8 gmwage_9 gmwage_1
> 0 gmwage_11 gmwage_12 t tsq

      Source |       SS           df       MS      Number of obs   =       599
-------------+----------------------------------   F(15, 583)      =     13.39
       Model |  .002133592        15  .000142239   Prob > F        =    0.0000
    Residual |   .00619503       583  .000010626   R-squared       =    0.2562
-------------+----------------------------------   Adj R-squared   =    0.2370
       Total |  .008328622       598  .000013927   Root MSE        =    .00326

------------------------------------------------------------------------------
        gcpi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gmwage |   .0027787   .0040014     0.69   0.488    -.0050802    .0106375
    gmwage_1 |   .0096556   .0039932     2.42   0.016     .0018127    .0174985
    gmwage_2 |   .0046045   .0039937     1.15   0.249    -.0032393    .0124483
    gmwage_3 |   .0115465   .0039935     2.89   0.004      .003703    .0193899
    gmwage_4 |   .0143625   .0040109     3.58   0.000     .0064849    .0222402
    gmwage_5 |   .0178151   .0040114     4.44   0.000     .0099364    .0256937
    gmwage_6 |   .0126066   .0040112     3.14   0.002     .0047284    .0204849
    gmwage_7 |   .0073899    .004011     1.84   0.066     -.000488    .0152678
    gmwage_8 |   .0088188   .0040101     2.20   0.028     .0009428    .0166948
    gmwage_9 |   .0081165   .0040098     2.02   0.043     .0002411     .015992
   gmwage_10 |   .0119892   .0040096     2.99   0.003     .0041141    .0198642
   gmwage_11 |   .0164582   .0040088     4.11   0.000     .0085848    .0243316
   gmwage_12 |   .0151417   .0040166     3.77   0.000      .007253    .0230304
           t |   .0000347   3.24e-06    10.72   0.000     .0000283    .0000411
         tsq |  -4.67e-08   5.00e-09    -9.33   0.000    -5.65e-08   -3.68e-08
       _cons |  -.0022812    .000457    -4.99   0.000    -.0031786   -.0013837
------------------------------------------------------------------------------

. exit, clear
