----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mafton/Documents/School/Econ 644/study.log
  log type:  text
 opened on:   1 Apr 2018, 16:33:07

. pwd
/Users/mafton/Documents/School/Econ 644

. cd "/users/mafton/Desktop"
/Users/mafton/Desktop

. cd "/users/mafton/documents/school/econ 644"
/Users/mafton/Documents/School/Econ 644

. use ceosalary.dta

. describe

Contains data from ceosalary.dta
  obs:           177                          
 vars:            17                          3 Feb 2017 11:28
 size:        11,328                          (_dta has notes)
----------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------
id              str3    %9s                   unique CEO identifier
name            str18   %18s                  CEO name
phone           double  %10.0f                phone number
gender          str1    %9s                   male or female
mstatus         long    %8.0g      maritalstatus
                                              marital status
salary          int     %9.0g                 1990 compensation, $1000s
age             byte    %9.0g                 in years
daybirth        float   %9.0g                 day of birth
monthbirth      float   %9.0g                 month of birth
college         byte    %9.0g                 =1 if attended college
grad            byte    %9.0g                 =1 if attended graduate school
comten          byte    %9.0g                 years with company
ceoten          byte    %9.0g                 years as ceo with company
sales           str5    %9s                   1990 firm sales, millions
profits         int     %9.0g                 1990 profits, millions
mktval          float   %9.0g                 market value, end 1990, mills.
profmarg        float   %9.0g                 profits as % of sales
----------------------------------------------------------------------------------
Sorted by: id

. summarize

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          id |          0
        name |          0
       phone |        177    5.41e+09    2.50e+09   1.01e+09   9.95e+09
      gender |          0
     mstatus |        177     1.99435    .5589883          1          4
-------------+---------------------------------------------------------
      salary |        177    865.8644    587.5893        100       5299
         age |        177    56.42938     8.42189         33         86
    daybirth |        172    15.75581    8.618538          1         31
  monthbirth |        175    6.497143    3.622843          1         12
     college |        177    .9717514    .1661523          0          1
-------------+---------------------------------------------------------
        grad |        177    .5310734    .5004492          0          1
      comten |        177    22.50282    12.29473          2         58
      ceoten |        177    7.954802    7.150826          0         37
       sales |          0
     profits |        177    207.8305    404.4543       -463       2700
-------------+---------------------------------------------------------
      mktval |        177    3600.316    6442.276        387      45400
    profmarg |        177     6.42011    17.86074  -203.0769   47.45763

. list daybirth name if daybirth==.

     +--------------------------+
     | daybirth            name |
     |--------------------------|
  8. |        .   Melvin Stuart |
 26. |        .      Kamal Cook |
112. |        .     Magee Beach |
125. |        .     Peter Hurst |
172. |        .    Colby Larsen |
     +--------------------------+

. gen mis = (daybirth==.)

. browse mis

. summarize mis

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         mis |        177    .0282486    .1661523          0          1

. display 100*(5/177)
2.8248588

. display mis=1
01

. display if mis==1
if not found
r(111);

. recode daybirth (missing=0), generate(daybirth_mz)
(5 differences between daybirth and daybirth_mz)

. list daybirth_mz daybirth if daybirth!=daybirth_mz

     +---------------------+
     | daybir~z   daybirth |
     |---------------------|
  8. |        0          . |
 26. |        0          . |
112. |        0          . |
125. |        0          . |
172. |        0          . |
     +---------------------+

. histogram age, width(3) frequency addlabel
(bin=18, start=33, width=3)

. ci means age

    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
         age |        177    56.42938     .633028        55.18008    57.67868

. ttest age ==50

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     age |     177    56.42938     .633028     8.42189    55.18008    57.67868
------------------------------------------------------------------------------
    mean = mean(age)                                              t =  10.1565
Ho: mean = 50                                    degrees of freedom =      176

    Ha: mean < 50               Ha: mean != 50                 Ha: mean > 50
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. corr college age
(obs=177)

             |  college      age
-------------+------------------
     college |   1.0000
         age |  -0.1781   1.0000


. regress college age

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      5.73
       Model |  .154052588         1  .154052588   Prob > F        =    0.0177
    Residual |  4.70470447       175  .026884026   R-squared       =    0.0317
-------------+----------------------------------   Adj R-squared   =    0.0262
       Total |  4.85875706       176  .027606574   Root MSE        =    .16396

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0035129   .0014675    -2.39   0.018    -.0064092   -.0006166
       _cons |   1.169983   .0837228    13.97   0.000     1.004747     1.33522
------------------------------------------------------------------------------

. regress college age

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      5.73
       Model |  .154052588         1  .154052588   Prob > F        =    0.0177
    Residual |  4.70470447       175  .026884026   R-squared       =    0.0317
-------------+----------------------------------   Adj R-squared   =    0.0262
       Total |  4.85875706       176  .027606574   Root MSE        =    .16396

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0035129   .0014675    -2.39   0.018    -.0064092   -.0006166
       _cons |   1.169983   .0837228    13.97   0.000     1.004747     1.33522
------------------------------------------------------------------------------

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of college

         chi2(1)      =    84.56
         Prob > chi2  =   0.0000

. regress college age, vce(robust)

Linear regression                               Number of obs     =        177
                                                F(1, 175)         =       2.84
                                                Prob > F          =     0.0938
                                                R-squared         =     0.0317
                                                Root MSE          =     .16396

------------------------------------------------------------------------------
             |               Robust
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0035129    .002085    -1.68   0.094    -.0076279     .000602
       _cons |   1.169983   .1095404    10.68   0.000     .9537931    1.386174
------------------------------------------------------------------------------

. regress college age [aweight=1/(age*(100-age))]
(sum of wgt is   7.4590e-02)

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(1, 175)       =      6.39
       Model |  .187262287         1  .187262287   Prob > F        =    0.0124
    Residual |  5.13165586       175  .029323748   R-squared       =    0.0352
-------------+----------------------------------   Adj R-squared   =    0.0297
       Total |  5.31891815       176  .030221126   Root MSE        =    .17124

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   -.003665   .0014503    -2.53   0.012    -.0065274   -.0008027
       _cons |   1.177699   .0835873    14.09   0.000      1.01273    1.342668
------------------------------------------------------------------------------

. regress college age [aweight=1/age*(100-age))], vce(robust)
too many ')' or ']'
r(132);

. regress college age [aweight=1/(age*(100-age))], vce(robust)
(sum of wgt is   7.4590e-02)

Linear regression                               Number of obs     =        177
                                                F(1, 175)         =       2.55
                                                Prob > F          =     0.1122
                                                R-squared         =     0.0352
                                                Root MSE          =     .17124

------------------------------------------------------------------------------
             |               Robust
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   -.003665   .0022956    -1.60   0.112    -.0081956    .0008656
       _cons |   1.177699   .1209622     9.74   0.000     .9389663    1.416431
------------------------------------------------------------------------------

. regress college age daybirth

      Source |       SS           df       MS      Number of obs   =       172
-------------+----------------------------------   F(2, 169)       =      2.82
       Model |  .156659294         2  .078329647   Prob > F        =    0.0626
    Residual |  4.69799187       169  .027798768   R-squared       =    0.0323
-------------+----------------------------------   Adj R-squared   =    0.0208
       Total |  4.85465116       171  .028389773   Root MSE        =    .16673

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0035342   .0015087    -2.34   0.020    -.0065124   -.0005559
    daybirth |  -.0003193   .0014832    -0.22   0.830    -.0032473    .0026087
       _cons |    1.17552   .0876295    13.41   0.000      1.00253    1.348509
------------------------------------------------------------------------------

. regress college age daybirth_mz

      Source |       SS           df       MS      Number of obs   =       177
-------------+----------------------------------   F(2, 174)       =      2.90
       Model |  .156621352         2  .078310676   Prob > F        =    0.0578
    Residual |  4.70213571       174  .027023768   R-squared       =    0.0322
-------------+----------------------------------   Adj R-squared   =    0.0211
       Total |  4.85875706       176  .027606574   Root MSE        =    .16439

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0034787   .0014755    -2.36   0.020    -.0063909   -.0005665
 daybirth_mz |   -.000431   .0013979    -0.31   0.758      -.00319     .002328
       _cons |   1.174649   .0852931    13.77   0.000     1.006307    1.342991
------------------------------------------------------------------------------

. estat ovtest

Ramsey RESET test using powers of the fitted values of college
       Ho:  model has no omitted variables
                 F(3, 171) =      1.68
                  Prob > F =      0.1741

. gen female = (gender=="F")

. browse female

. label variable female "1 if female, 0 if male"

. regress college age monthbirth female

      Source |       SS           df       MS      Number of obs   =       175
-------------+----------------------------------   F(3, 171)       =      5.43
       Model |  .422309296         3  .140769765   Prob > F        =    0.0014
    Residual |  4.43483356       171  .025934699   R-squared       =    0.0869
-------------+----------------------------------   Adj R-squared   =    0.0709
       Total |  4.85714286       174  .027914614   Root MSE        =    .16104

------------------------------------------------------------------------------
     college |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0034377   .0014569    -2.36   0.019    -.0063136   -.0005619
  monthbirth |    .005172   .0034011     1.52   0.130    -.0015417    .0118856
      female |  -.1199009   .0451177    -2.66   0.009    -.2089603   -.0308415
       _cons |   1.141483   .0882394    12.94   0.000     .9673041    1.315662
------------------------------------------------------------------------------

. predict college_hat
(option xb assumed; fitted values)
(2 missing values generated)

. list name age monthbirth female if college_hat==.

     +-----------------------------------------+
     |          name   age   monthb~h   female |
     |-----------------------------------------|
  8. | Melvin Stuart    63          .        0 |
112. |   Magee Beach    46          .        0 |
     +-----------------------------------------+

. browse college_hat

. scatter college_hat age

. graph save Graph
(file Graph.gph saved)

. view Graph

. vew Graph.gph
command vew is unrecognized
r(199);

. view Graph.gph
